Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel2/*.po
Languages: cy, lv

source: This probably happened because the selected disk or free space is too small to be automatically partitioned.
cy: Mae'n debygol y digwyddodd hyn oherwydd bod y ddisg neu'r ofod rhydd a ddewiswyd yn rhy fach i'w rhaniadu'n awtomatig.
lv: Iespējams, uz izvēlētā diska ir pārāk maz vietas, lai to automātiski sadalītu sadaļās.

source: This probably happened because there are too many (primary) partitions in the partition table.
cy: Mae'n debygol y digwyddodd hyn oherwydd bod gormod o rhaniadau (cynradd) yn y tabl rhaniadau.
lv: Iespējams, sadaļu tabulā ir pārāk daudz (primāro) sadaļu.

source: Unusable free space
cy: Gofod rhydd annefnyddiol
lv: Neizmantojama brīvā vieta

source: Partitioning failed because the chosen free space may not be used. There are probably too many (primary) partitions in the partition table.
cy: Methodd rhaniadu oherwydd ni ellir defnyddio'r gofod rhydd a ddewiswyd. Mwy na thebyg, bod gormod o rhaniadau (cynradd) yn y tabl rhaniadau.
lv: Sadalīšana neizdevās, jo izvēlēto brīvo vietu nevar izmantot. Visticamāk, jūsu sadaļu tabulā ir pārāk daudz (primāro) sadaļu.

source: Small-disk (< 1GB) partitioning scheme
cy: Cynllun rhaniadu disg bach (< 1GB):
lv: Maza diska (< 1GB) dalīšanas shēma

source: Go back to the menu?
cy: Dychwelyd i'r ddewislen?
lv: Atgriezties pie izvēlnes?

source: No file system is specified for partition #${PARTITION} of ${DEVICE}.
cy: Does dim system ffeil wedi ei benodi ar gyfer rhaniad ${PARTITION} ar ${DEVICE}.
lv: ${DEVICE} sadaļai #${PARTITION} nav norādīta failu sistēma.

source: If you do not go back to the partitioning menu and assign a file system to this partition, it won't be used at all.
cy: Os na ddychwelwch i'r ddewislen rhaniadu a phenodi system ffeiliau i'r rhaniad hwn, ni chaiff ei ddefnyddio o gwbl.
lv: Ja jūs neatgriezīsities pie disku dalīšanas izvēlnes un nenorādīsiet šai sadaļai failu sistēmu, tā netiks izmantota vispār.

source: do not use the partition
cy: peidiwch a defnyddio'r rhaniad
lv: nelietot šo sadaļu

source: Format the partition:
cy: Fformadu'r rhaniad:
lv: Sadaļa, kuru formatēt:

source: yes, format it
cy: ie, ei fformadu
lv: jā, formatēt to

source: no, keep existing data
cy: na, cadw'r data presennol
lv: nē, saglabāt esošos datus

source: do not use
cy: peidio a defnyddio
lv: neizmantot

source: format the partition
cy: fformadu'r rhaniad
lv: formatēt sadaļu

source: keep and use the existing data
cy: cadw a defnyddio'r data sy'n bodoli eisioes
lv: saglabāt un izmantot esošos datus

source: Resizing partition...
cy: Yn ailfeintio'r rhaniad...
lv: Maina sadaļas izmēru...

source: Copying partition...
cy: Yn copïo'r rhaniad...
lv: Kopē sadaļu...

source: Write previous changes to disk and continue?
cy: Ysgrifennu'r newidiadau blaenorol i ddisg a pharhau?
lv: Saglabāt izmaiņas diskā un turpināt?

source: Before you can select a partition to copy, any previous changes have to be written to disk.
cy: Cyn dewis rhaniad i copïo, rhaid i'r newidiadau blaenorol gael eu hysgrifennu i ddisg.
lv: Pirms izvēlaties sadaļu, kuru kopēt, visas iepriekšējās izmaiņas ir jāieraksta diskā.

source: You cannot undo this operation.
cy: Ni allwch ddadwneud y weithred hon.
lv: Šo operāciju atcelt nevar.

source: Please note that the copy operation may take a long time.
cy: Sylwer y gall y weithred copïo gymryd amser hir.
lv: Lūdzu, ņemiet vērā, ka kopēšanas operācija var aizņemt daudz laika.

source: Source partition:
cy: Rhaniad ffynhonell:
lv: Sākuma sadaļa:

source: Please choose the partition which contains the data you want to copy.
cy: Os gwelwch yn dda, dewiswch y rhaniad sy'n cynnwys y data hoffech gopïo.
lv: Lūdzu, izvēlieties sadaļu, kas satur datus, kurus vēlaties kopēt.

source: Copy operation failure
cy: Methiant gweithred copïo
lv: Kopēšana neizdevās

source: An error occurred while writing the changes to the storage devices.
cy: Digwyddodd gwall wrth ysgrifennu'r newidiadau i'r dyfeisiau storfa.
lv: Kļūda, mēģinot ierakstīt izmaiņas ierīcēs.

source: The copy operation has been aborted.
cy: Mae'r broses copio wedi'i erthylu.
lv: Kopēšanas operācija tika pārtraukta.

source: The resize operation is impossible
cy: Mae'r weithred ailfeintio yn amhosib
lv: Izmēra maiņas operācija ir neiespējama

source: Because of an unknown reason it is impossible to resize this partition.
cy: Oherwydd rheswm anhysbys, mae'n amhosib ailfeintio'r rhaniad hwn.
lv: Nezināmu iemeslu dēļ nav iespējams izmainīt šīs sadaļas izmērus.

source: Check /var/log/syslog or see virtual console 4 for the details.
cy: Gwiriwch /var/log/syslog neu gwelwch consol rhithwir 4 am y manylion.
lv: Pārbaudiet /var/log/syslog vai skatieties sīkāk ceturtajā virtuālajā konsolē (ALT+F4).

source: Before you can select a new partition size, any previous changes have to be written to disk.
cy: Cyn dewis maint rhaniad newydd, rhaid i newidiadau blaenorol gael eu hysgrifennu i ddisg.
lv: Pirms mainīt sadaļas izmēru, visas citas izmaiņas ir jāieraksta diskos.

source: Please note that the resize operation may take a long time.
cy: Sylwer y gall y weithred ailfeintio gymryd amser hir.
lv: Ņemiet vērā, ka izmēra maiņas operācija var aizņemt ilgu laiku.

source: New partition size:
cy: Maint y rhaniad newydd:
lv: Jaunais sadaļas izmērs:

source: The minimum size for this partition is ${MINSIZE} (or ${PERCENT}) and its maximum size is ${MAXSIZE}.
cy: Y maint lleiaf ar gyfer y rhaniad hwn yw ${MINSIZE} (neu ${PERCENT}) a'r maint mwyaf yw ${MAXSIZE}.
lv: Minimālais izmērs šai sadaļai ir ${MINSIZE} (jeb ${PERCENT}) un maksimālais ir ${MAXSIZE}.

source: Hint: "max" can be used as a shortcut to specify the maximum size, or enter a percentage (e.g. "20%") to use that percentage of the maximum size.
cy: Awgrym: gellir defnyddio "max" fel llwybr byr i nodi y maint mwyaf, neu mewnosod canran (e.e. "20%") ar gyfer defnyddio'r canran hynny o'r maint mwyaf.
lv: Piezīme: Maksimālā izmēra norādīšanai vai ierakstīt vārdu "max", bet lai norādītu izmēru kā daļu no maksimālā var izmantot procenta zīmi, piemēram, "20%".

source: The size entered is invalid
lv: Jūsu ievadītais izmērs nav derīgs

source: The size you entered was not understood. Please enter a positive integer size followed by an optional unit of measure (e.g. "200 GB"). The default unit of measure is the megabyte.
lv: Jūsu ievadītais izmērs nav saprasts. Lūdzu, ievadiet veselu skaitli, kuram seko neobligāta mērvienība, piemēram, "200 GB". Noklusētā mērvienība ir megabaits.

source: The size entered is too large
lv: Ievadītais izmērs ir par lielu

source: The size you entered is larger than the maximum size of the partition. Please enter a smaller size to continue.
lv: Ievadītais izmērs ir lielāks par sadaļas maksimālo izmēru. Lūdzu ievadiet mazāku izmēru.

source: The size entered is too small
lv: Ievadītais izmērs ir par mazu

source: The size you entered is smaller than the minimum size of the partition. Please enter a larger size to continue.
lv: Ievadītais izmērs ir mazāks par minimālo atļauto sadaļas izmēru. Lūdzu ievadiet lielāku izmēru.

source: Resize operation failure
cy: Methiant gweithred ailfeintio
lv: Izmēra maiņa neizdevās

source: The resize operation has been aborted.
cy: Mae'r weithred ailfeintio wedi'i erthylu.
lv: Izmēra maiņas operācija tika pārtraukta.

source: The maximum size for this partition is ${MAXSIZE}.
cy: Y maint mwyaf ar gyfer y rhaniad hwn yw ${MAXSIZE}.
lv: Maksimālais šīs sadaļas izmērs ir ${MAXSIZE}.

source: Invalid size
cy: Maint annilys
lv: Nederīgs izmērs

source: Flags for the new partition:
cy: Banneri ar gyfer y rhaniad newydd:
lv: Jaunās sadaļas iezīmes:

source: Partition name:
cy: Enw rhaniad:
lv: Sadaļas nosaukums:

source: Continue with partitioning?
cy: Parhau gyda'r rhaniadydd
lv: Turpināt dalīšanu?

source: This partitioner doesn't have information about the default type of the partition tables on your architecture. Please send an e-mail message to debian-boot@lists.debian.org with information.
cy: Nid oes gan y rhaniadydd hwn gwybodaeth am math y rhagosod o'r tablau rhaniad ar eich pensaerniaeth. Os gwelwch yn dda, danfonwch ebost at debian-boot@lists.debian.org gyda'r wybodaeth hon.
lv: Šim disku dalīšanas rīkam nav informācijas par šī datora arhitektūras noklusētajiem sadaļu tabulas tipiem. Lūdzu, nosūtiet e-pasta vēstuli ar šo informāciju uz debian-boot@lists.debian.org.

source: Please note that if the type of the partition table is unsupported by libparted, then this partitioner will not work properly.
cy: Sylwer os nad yw math y tabl rhaniad wedi ei gynnal gan libparted, yna ni fydd y rhaniadydd yma'n gweithio'n iawn.
lv: Piezīme: Ja libparted neatbalsta konkrētās sadaļu tabulas tipu, šis disku dalīšanas rīks nestrādās korekti.

source: This partitioner is based on the library libparted which doesn't have support for the partition tables used on your architecture. It is strongly recommended that you exit this partitioner.
cy: Mae'r rhaniadydd hwn wedi ei seilio ar y llyfrgell libparted sydd heb gynhaliaeth ar gyfer y tablau rhaniad a ddefnyddir ar eich pensaerniaeth. Argymhellir yn gryf eich bod chi'n gadael y rhaniadydd hwn.
lv: Disku dalīšanas rīks izmanto libparted versiju, kas šobrīd neatbalsta doto arhitektūru. Jums vajadzētu atteikties no sadaļu veidošanas un iziet no dalīšanas rīka.

source: If you can, please help to add support for your partition table type to libparted.
cy: Os y medrwch, cynorthwywch i ychwanegu cynhaliaeth ar gyfer eich math o tabl rhaniad i libparted os gwelwch yn dda.
lv: Ja varat, lūdzu, palīdziet pievienot jūsu arhitektūras sadaļu tabulas atbalstu libparted bibliotēkai.

source: Partition table type:
cy: Math o tabl rhaniad:
lv: Sadaļu tabulas tips:

source: Select the type of partition table to use.
cy: Dewiswch y math o dabl rhaniad i'w ddefnyddio.
lv: Izvēlieties, kādu sadaļu tabulas tipu lietot.

source: Create new empty partition table on this device?
cy: Creu tabl rhaniad newydd gwag ar y ddyfais hwn?
lv: Izveidot jaunu, tukšu sadaļu tabulu šai ierīcei?

source: You have selected an entire device to partition. If you proceed with creating a new partition table on the device, then all current partitions will be removed.
cy: Rydych wedi dewis dyfais cyfan i'w rhaniadu. Os ydych chi'n parhau gyda chreu tabl rhaniad newydd ar y ddyfais hwn, yna caiff pob rhaniad cyfredol ei ddinistrio.
lv: Jūs izvēlējāties veidot sadaļas visai ierīcei. Ja turpināsiet, visas esošās sadaļas uz šīs ierīces tiks dzēstas.

source: Note that you will be able to undo this operation later if you wish.
cy: Sylwer y cewch dadwneud y weithred hon yn hwyrach os hoffech.
lv: Piezīme: ja vēlēsieties, jūs vēlāk varēsiet atcelt šo darbību.

source: Write a new empty partition table?
cy: Ysgrifennu tabl rhaniad newydd gwag?
lv: Ierakstīt tukšu jauno sadaļu tabulu?

source: Because of limitations in the current implementation of the Sun partition tables in libparted, the newly created partition table has to be written to the disk immediately.
cy: Oherwydd cyfyngiadau yng ngweithrediad cyfredol o'r tablau rhaniad Sun yn libparted, rhaid i'r tabl rhaniad newydd gael ei ysgrifennu i ddsg ar unwaith.
lv: libparted Sun sadaļu tabulas atbalsta implementācijas ierobežojumu dēļ, jaunizveidotā sadaļu tabula uzreiz jāieraksta diskā.

source: You will NOT be able to undo this operation later and all existing data on the disk will be irreversibly removed.
cy: NI fyddwch yn gallu dadwneud y weithred hon wedyn, a chaiff yr holl ddata ar y ddisg ei ddileu yn anadferadwy.
lv: Pēc šīs darbības veikšanas jūs vairs NEVARĒSIET atjaunot iepriekšējo stāvokli, un visi dati uz diska tiks neatgriezeniski dzēsti.

source: Confirm whether you actually want to create a new partition table and write it to disk.
cy: Cadarnhewch eich bod wir eisiau creu tabl rhaniad newydd a'i ysgrifennu i ddisg.
lv: Vai tiešām vēlaties izveidot jaunu sadaļu tabulu un saglabāt to diskā?

source: Are you sure you want a bootable logical partition?
cy: A ydych yn sicr eich bod eisiau rhaniad cychwynol rhesymegol?
lv: Vai tiešām vēlaties palaižamu loģisko sadaļu?

source: You are trying to set the bootable flag on a logical partition. The bootable flag is generally only useful on primary partitions, so setting it on logical partitions is normally discouraged. Some BIOS versions are known to fail to boot if there is no bootable primary partition.
cy: Yr ydych yn ceisio rhoi'r baner cychwynol ar rhaniad rhesymegol. Mae'r faner cychwynol fel rheol ond yn ddefnyddiol ar brif rhaniad, felly gwrthodir ei osod ar rhaniadau rhesymegol. Mae rhai fersiynau BIOS yn methu cychwyn os nad oes yna unrhyw brif rhaniadau cychwynol.
lv: Jūs mēģināt iestatīt palaišanas iezīmi loģiskai sadaļai. Palaišanas iezīme ir lietderīga tikai primārajām sadaļām, tāpēc parasti tās iestatīšana loģiskām sadaļām nav ieteicama. Dažas BIOS versijas nespēj palaist datoru, ja netiek atrasta neviena palaižama primārā sadaļa.

source: However, if you are sure that your BIOS does not have this problem, or if you are using a custom boot manager that pays attention to bootable logical partitions, then setting this flag may make sense.
cy: Er hynny, os ydych yn sicr nad yw'ch BIOS yn dioddef o'r broblem hyn, neu os ydych yn defnyddio rheolwr cychwyn pwrpasol sy'n cymryd sylw o rhaniadau rhesymegol cychwynol, yna bydd gosod y faner yma yn gwneud synnwyr.
lv: Ja jūs droši zināt, ka jūsu BIOS šī problēma nepiemīt, vai arī izmantojat pielāgotu palaišanas pārvaldnieku, tad šīs iezīmes uzstādīšana varētu arī būt pareiza.

source: Set the partition flags
cy: Gosod y banneri rhaniad
lv: Iestatīt sadaļas iezīmes

source: Name:
cy: Enw:
lv: Nosaukums:

source: Bootable flag:
cy: Banner bŵtiadwy:
lv: Palaišanas iezīme:

source: on
cy: ymlaen
lv: ieslēgts

source: off
cy: bant
lv: izslēgts

source: Resize the partition (currently ${SIZE})
cy: Newid maint y rhaniad (${SIZE} ar hyn o bryd)
lv: Mainīt sadaļas izmēru (šobrīd ${SIZE})

source: Copy data from another partition
cy: Copïo data o rhaniad arall
lv: Kopēt datus no citas sadaļas

source: Delete the partition
cy: Dileu'r rhaniad
lv: Dzēst sadaļu

source: Create a new partition
cy: Creu rhaniad newydd
lv: Izveidot jaunu sadaļu

source: Create a new empty partition table on this device
cy: Creu rhaniad newydd gwag ar y ddyfais hwn
lv: Izveidot jaunu tukšu sadaļu tabulu uz šīs ierīces

source: Go back to the menu and correct errors?
cy: Dychwelyd i'r ddewislen a chywiro gwallau?
lv: Atgriezties izvēlnē un izlabot kļūdas?

source: The test of the file system with type ${TYPE} in partition #${PARTITION} of ${DEVICE} found uncorrected errors.
cy: Canfuodd brawf y system ffeiliau gyda'r math ${TYPE} yn rhaniad #${PARTITION} o ${DEVICE} wallau heb eu cywiro.
lv: ${TYPE} failu sistēmas pārbaude ${DEVICE} #${PARTITION} sadaļai atklāja neizlabotas kļūdas.

source: If you do not go back to the partitioning menu and correct these errors, the partition will be used as is.
cy: Os nad ydych yn dychwelyd i'r ddewislen rhaniadu a chywiro'r gwallau hyn, caiff y rhaniad ei ddefnyddio fel y mae.
lv: Ja neatgriezīsieties un neatrisināsiet radušās kļūdas, šī sadaļa tiks izmantota tāda, kāda tā šobrīd ir.

source: The test of the swap space in partition #${PARTITION} of ${DEVICE} found uncorrected errors.
cy: Canfuodd brawf y gofod cyfnewid yn rhaniad #${PARTITION} o ${DEVICE} wallau heb eu cywiro.
lv: Maiņvietas pārbaude ${DEVICE} #${PARTITION} sadaļai atklāja neizlabotas kļūdas.

source: Do you want to return to the partitioning menu?
cy: A hoffech ddychwelyd i'r ddewislen rhaniadu?
lv: Vai vēlaties atgriezties disku dalīšanas izvēlnē?

source: You have not selected any partitions for use as swap space. Enabling swap space is recommended so that the system can make better use of the available physical memory, and so that it behaves better when physical memory is scarce. You may experience installation problems if you do not have enough physical memory.
cy: Nid ydych wedi dewis unrhyw rhaniadau fel defnydd i gofod cyfnewid. Cefnogir gweithredu gofod cyfnewid fel bod y system yn medru gwneud gwell defnydd o'r cof gorfforol sydd ar gael, a fel ei bod yn ymddwyn yn well pan fod prinder cof gorfforol. Mae'n bosibl y cewch problemau gosod os nad oes gennych ddigon o gof gorfforol.
lv: Jūs neizvēlējāties nevienu sadaļu, ko izmantot kā maiņvietu. Maiņvietas aktivizēšana ļaus jūsu sistēmai labāk izmantot pieejamo fizisko atmiņu, kā arī darboties sekmīgāk atmiņas trūkuma apstākļos. Ja jums nebūs pietiekami daudz fiziskās atmiņas, instalēšanas procesā iespējami sarežģījumi.

source: If you do not go back to the partitioning menu and assign a swap partition, the installation will continue without swap space.
cy: Os nad ydych chi'n dychwelyd i'r ddewislen rhaniadu a dewis pwynt cyfnewid o'r fan honno, ni chaiff y rhaniad hwn ei ddefnyddio o gwbl.
lv: Ja neatgriezīsieties uz disku dalīšanas izvēlni un nenorādīsiet maiņvietas sadaļu, instalēšana turpināsies bez tās.

source: Failed to create a file system
cy: Methwyd a chreu system ffeil
lv: Neizdevās izveidot failu sistēmu

source: The ${TYPE} file system creation in partition #${PARTITION} of ${DEVICE} failed.
cy: Mae creu system ffeil ${TYPE} yn rhaniad #${PARTITION} o ${DEVICE} wedi methu.
lv: ${TYPE} failu sistēmas izveide uz ${DEVICE} #${PARTITION} sadaļas nav izdevusies.

source: Failed to create a swap space
cy: Methwyd creu gofod cyfnewid
lv: Neizdevās izveidot maiņvietu

source: The creation of swap space in partition #${PARTITION} of ${DEVICE} failed.
cy: Methodd cread gofod cyfnewid yn rhaniad #${PARTITION} o ${DEVICE}.
lv: Maiņvietas izveide uz ${DEVICE} #${PARTITION} sadaļas nav izdevusies.

source: No mount point is assigned for the ${FILESYSTEM} file system in partition #${PARTITION} of ${DEVICE}.
lv: Nav norādīts montēšanas punkts failu sistēmai ${FILESYSTEM}, kas atrodas uz iekārtas ${DEVICE} sadaļas #${PARTITION}

source: If you do not go back to the partitioning menu and assign a mount point from there, this partition will not be used at all.
cy: Os nad ydych chi'n dychwelyd i'r ddewislen rhaniadu a dewis pwynt gosod o'r fan honno, ni chaiff y rhaniad hwn ei ddefnyddio o gwbl.
lv: Ja neatgriezīsieties uz disku dalīšanas izvēlni un nenorādīsiet montēšanas punktu, šī sadaļa vispār netiks izmantota.

source: Invalid file system for this mount point
cy: System ffeil annilys ar gyfer y pwynt gosod hwn
lv: Nederīga failu sistēma šim montēšanas punktam

source: The file system type ${FILESYSTEM} cannot be mounted on ${MOUNTPOINT}, because it is not a fully-functional Unix file system. Please choose a different file system, such as ${EXT2}.
cy: Ni ellir gosod math o system ffeil ${FILESYSTEM} ar ${MOUNTPOINT}, oherwydd nad yw'n system ffeil Unix llwyr weithredol. Dewiswch math gwahanol o system ffeil, fel ${EXT2}.
lv: ${FILESYSTEM} failu sistēmu nevar piemontēt ${MOUNTPOINT}, jo tā nav pilnībā funkcionāla Unix failu sistēma. Lūdzu, izvēlieties citu failu sistēmu, piemēram, ${EXT2}.

source: / - the root file system
cy: / - system ffeiliau gwraidd
lv: / - saknes failu sistēma

source: /boot - static files of the boot loader
cy: /boot - ffeiliau sefydlog y bŵtlwythydd
lv: /boot - palaidēja statiskie faili

source: /home - user home directories
cy: /home - cyfeiriadau cartref defnyddwyr
lv: /home - lietotāju mājas mapes

source: /tmp - temporary files
cy: /tmp - ffeiliau dros dro
lv: /tmp - pagaidu faili

source: /usr - static data
cy: /usr - data sefydlog
lv: /usr - statiskie dati

source: /var - variable data
cy: /var - data newidol
lv: /var - mainīgie dati

source: /srv - data for services provided by this system
cy: /srv - data ar gyfer gwasanaethau a ddarparir gan y system hwn
lv: /srv - šīs sistēmas pakalpojumu dati

source: /opt - add-on application software packages
cy: /opt - pecynnau meddalwedd ychwanegol
lv: /opt - programmatūras papildinājumu pakotnes

source: /usr/local - local hierarchy
cy: /usr/local - hierarchaeth lleol
lv: /usr/local - lokālā hierarhija

source: Enter manually
cy: Mewnosod â llaw
lv: Norādīt manuāli

source: Do not mount it
cy: Peidio a'i osod
lv: Nemontēt to

source: Mount point for this partition:
cy: Pwynt gosod ar gyfer y rhaniad hwn:
lv: Šīs sadaļas montēšanas punkts:

source: Invalid mount point
cy: Pwynt gosod annilys
lv: Nederīgs montēšanas punkts

source: The mount point you entered is invalid.
cy: Mae'r pwynt gosod a rhoddwyd yn annilys.
lv: Jūsu ievadītais montēšanas punkts nav derīgs.

source: Mount points must start with "/". They cannot contain spaces.
cy: Rhaid i bwyntiau gosod cychwyn efo "/". Ni chant gynnwys bylchau.
lv: Montēšanas punktam jāsākas ar "/". Tajā nevar būt atstarpes.

source: Label for the file system in this partition:
cy: Label ar gyfer y system ffeiliau yn rhaniad hwn:
lv: Šīs sadaļas failu sistēmas etiķete:

source: Format the swap area:
cy: Fformadu'r gofod cyfnewid:
lv: Formatēt maiņvietas apgabalu:

source: yes
cy: ie
lv: jā

source: no
cy: na
lv: nē

source: Label:
lv: Etiķete:

source: none[ Do not translate what's inside the brackets and just put the translation for the word "none" in your language without any brackets. This "none" relates to "Label:" ]
cy: dim
lv: nekāda

source: Reserved blocks:
cy: Blociau neilltuedig:
lv: Rezervētie bloki:

source: Percentage of the file system blocks reserved for the super-user:
cy: Canran o flociau'r system ffeiliau wedi eu neilltuo ar gyfer yr uwch-ddefnyddiwr:
lv: Superlietotājam rezervētais failu sistēmas apjoms procentos:

source: Typical usage:
cy: Defnydd nodweddiadol:
lv: Tipiskais izmantojums:

source: standard
cy: safonnol
lv: standarta

source: Mount point:
cy: Pwynt gosod:
lv: Montēšanas punkts:

source: none[ Do not translate what's inside the brackets and just put the translation for the word "none" in your language without any brackets. This "none" relates to "Mount point:" ]
cy: dim
lv: nav norādīts

source: Ext2 file system
cy: System ffeiliau ext2
lv: Ext2 failu sistēma

source: FAT16 file system
cy: system ffeiliau FAT16
lv: FAT16 failu sistēma

source: FAT32 file system
cy: system ffeiliau FAT32
lv: FAT32 failu sistēma

source: swap area
cy: ardal cyfnewid
lv: maiņvietas apgabals

source: Mount options:
cy: Opsiynnau gosod:
lv: Montēšanas opcijas:

source: Mount options can tune the behavior of the file system.
cy: Gall opsiynnau gosod addasu ymddygiad y system ffeiliau.
lv: Montēšanas opcijas nosaka failu sistēmas uzvedību.

source: noatime - do not update inode access times at each access
cy: noatime - peidio a diweddaru amser cyrchu inodau ar bob cyrchiad
lv: noatime - piekļūstot inode, neatjaunināt tā pieejas laikus

source: relatime - update inode access times relative to modify time
cy: relatime - uwchraddio amserau cyrchu inodau yn gymharol i amser newidiol
lv: relatime - atjaunināt inode piekļuves laiku attiecībā pret izmainīšanas laiku

source: nodev - do not support character or block special devices
cy: nodev - peidio a chynal dyfeisiau arbennig nod neu floc
lv: nodev - neatbalstīt rakstzīmju vai bloku speciālas ierīces

source: nosuid - ignore set-user-identifier or set-group-identifier bits
cy: nosuid - anwybyddu didau gosod-adnabyddyd-defnyddiwr neu gosod-adnabyddydd-grŵp
lv: nosuid - ignorēt set-user-identifier vai set-group-identifier bitus

source: noexec - do not allow execution of any binaries
cy: noexec - peidio a chaniatau gweithredu rhaglenni
lv: noexec - neļaut izpildīt izpildāmos failus

source: ro - mount the file system read-only
cy: ro - clymu'r system ffeil fel un darllen-yn-unig
lv: ro - montēt failu sistēmu vienīgi lasīšanas režīmā

source: sync - all input/output activities occur synchronously
cy: sync - mae pob gweithred mewnbwn/allbwn yn digwydd yn gydamserus
lv: sync - visas ievades/izvades darbības notiek sinhroni
