Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel2/*.po
Languages: cy, lv

source: Some software has been backported from the development tree to work with this release. Although this software has not gone through such complete testing as that contained in the release, it includes newer versions of some applications which may provide useful features.
lv: Dažas programmas ir ņemtas no jaunākajām izstrādes versijām un pārveidotas, lai tās spētu darboties šajā laidienā. Lai gan šāda programmatūra nav izgājusi tādu pašu testēšanu kā laidienā iekļautā, tajā ir atrodamas dažu programmu jaunākas versijas, kas varētu piedāvāt noderīgas funkcijas.

source: Create a normal user account now?
cy: Creu cyfrif defnyddiwr arferol nawr?
lv: Izveidot normālu lietotāja kontu?

source: It's a bad idea to use the root account for normal day-to-day activities, such as the reading of electronic mail, because even a small mistake can result in disaster. You should create a normal user account to use for those day-to-day tasks.
cy: Mae'n syniad gwael defnyddio'r cyfrinair 'root' ar gyfer gweithredion cyffredinol megis darllen ebost, oherwydd gall hyd yn oed gamgymeriad bychan achosi trychineb. Dylwch greu cyfrif defnyddiwr cyffredin i'w ddefnyddio ar gyfer tasgau cyffredinol.
lv: Lietot superlietotāja (root) kontu normālajam ikdienas darbam (piemēram, epasta lasīšanai) nav laba doma, jo pat mazākā kļūda var izraisīt ievērojamus bojājumus jūsu sistēmai. Jums vajadzētu izveidot parastu lietotāja kontu, ar kuru veikt ikdienas aktivitātes.

source: Note that you may create it later (as well as any additional account) by typing 'adduser <username>' as root, where <username> is an username, like 'imurdock' or 'rms'.
lv: Jūs varēsiet izveidot šādu lietotāja kontu (un arī citus papildu ierakstus) arī vēlāk ar komandas 'adduser <lietotājavārds>' palīdzību, kur <lietotājavārds> varētu būt, piemēram, 'janis' vai 'peterisk'.

source: Invalid username
cy: Enw defnyddiwr annilys
lv: Nederīgs lietotāja vārds

source: Reserved username
cy: Defnyddiwr ar gadw
lv: Lietotāja vārds ir aizņemts

source: The username you entered (${USERNAME}) is reserved for use by the system. Please select a different one.
cy: Mae'r defnyddiwr a mewnosodwyd (${USERNAME}) wedi ar gadw ar gyfer defnydd gan y system. Dewiswch un gwahanol.
lv: Sistēma ir jau rezervējusi jūsu ievadīto lietotāja vārdu (${USERNAME}). Lūdzu, izvēlieties citu.

source: Password input error
cy: Gwall mewnbwn cyfrinair
lv: Kļūda, ievadot paroli

source: The two passwords you entered were not the same. Please try again.
cy: Nid oedd y ddau gryfinair y rhoddoch yr yn peth. Ceisiwch eto os gwelwch yn dda.
lv: Jūsu ievadītās paroles atšķiras. Lūdzu, mēģiniet vēlreiz.

source: Empty password
cy: Cyfrinair gwag
lv: Tukša parole

source: You entered an empty password, which is not allowed. Please choose a non-empty password.
cy: Fe rhoddoch gyfrinair gwag, ond ni chaniateir hyn. Dewiswch gyfrinair nad yw'n wag.
lv: Jūs ievadījāt tukšu paroli, kas nav atļauts. Lūdzu, ievadiet paroli, kas nav tukša.

source: Enable shadow passwords?
cy: Galluogi cyfrineiriau cysgod?
lv: Aktivizēt paroļu ēnošanu?

source: Shadow passwords make your system more secure because nobody is able to view even encrypted passwords. The passwords are stored in a separate file that can only be read by special programs. The use of shadow passwords is strongly recommended, except in a few cases such as NIS environments.
cy: Mae cyfrineiriau cysgod yn gwneud eich system yn fwy diogel oherwydd does neb yn gallu gweld hyd yn oed cyfrineiriau wedi eu amgryptio. Caiff cyfrineiriau eu cadw mewn ffeil a gellir ei ddarllen dim ond gan rhaglenni arbennig. Argymhellir defnydd cyfrineiriau cysgod yn gryf, ar wahan i mean rhai sefyllfaoedd, megis amgylchfeydd NIS.
lv: Paroļu ēnošana padara jūsu sistēmu drošāku, jo neviens sistēmas lietotājs nevar redzēt paroles pat šifrētā formā. Paroles tiek glabātas īpašā failā, ko var lasīt tikai speciālas programmas. Paroļu ēnošanas lietošana ir ļoti ieteicama, izņemot dažus īpašos gadījumus, kā piemēram, NIS izmantošana.

source: critical
cy: hanfodol
lv: kritiska

source: high
cy: uchel
lv: augsta

source: medium
cy: canolig
lv: vidēja

source: low
cy: isel
lv: zema

source: Ignore questions with a priority less than:
cy: Anwybyddwch cwestiynau gyda blaenoriaeth llai na
lv: Ignorēt jautājumus ar prioritāti zemāku par:

source: Packages that use debconf for configuration prioritize the questions they might ask you. Only questions with a certain priority or higher are actually shown to you; all less important questions are skipped.
cy: Mae pecynnau sy'n defnyddio debconf yn blaenoriaethu y cwestiynau maent yn gofyn. Dim ond cwestiynau gyda rhyw flaenoriaeth penodedig neu uwch a gaiff eu dangos i chi; caiff pob cwestiwn llai pwysig eu hepgor.
lv: Pakotnes, kas konfigurēšanai lieto debconf, piešķir jautājumiem dažādas prioritātes. Tikai jautājumi ar noteikto vai augstāku prioritāti tiek patiešām uzdoti, visi zemākas prioritātes jautājumi tiek izlaisti.

source: You can select the lowest priority of question you want to see: - 'critical' is for items that will probably break the system without user intervention. - 'high' is for items that don't have reasonable defaults. - 'medium' is for normal items that have reasonable defaults. - 'low' is for trivial items that have defaults that will work in the vast majority of cases.
cy: Gallwch ddewis y blaenoriaeth cwestiwn isaf rydych chi eisiau ei weld: - mae 'hanfodol' ar gyfer eitemau a wnaiff dorri system mwy na thebyg os nad yw'r defnyddwir yn ymyrryd. - mae 'uchel' ar gyfer eitemau sydd heb rhagosodiad rhesymol. - mae 'canolig' ar gyfer eitemau arferol sydd efo rhagosodiad rhesymol. - mae 'isel' ar gyfer eitemau dibwys sydd efo rhagosodiad a fydd yn gweithio yn y rhan helaeth o sefyllfaoedd.
lv: Jūs varat noteikt, kādas prioritātes jautājumus jūs gribat redzēt: - 'kritiska' apzīmē jautājumus, uz kuriem lietotājam jāatbild, lai sistēma varētu strādāt. - 'augsta' - jautājumus, kam nav labas noklusētās atbildes. - 'vidēja' - normālus jautājumus, kam ir lietojami noklusējumi. - 'zema' - triviālus jautājumus, kur atbildes noklusētā vērtība strādās lielākajā daļā gadījumu.

source: For example, this question is of medium priority, and if your priority were already 'high' or 'critical', you wouldn't see this question.
cy: Er enghraifft, mae'r cwestiwn hwn o flaenoriaeth canolog, ac os oedd eich blaenoriaeth chi yn 'uchel' neu 'hanfodol' eisioes, ni fyddwch yn gweld y cwestiwn hwn.
lv: Piemēram, šim jautājumam ir vidēja prioritāte un, ja jūsu izvēlētā prioritāte būtu 'augsta' vai 'kritiska', jūs šo jautājumu neredzētu.

source: Change debconf priority
cy: Newid blaenoriaeth debconf
lv: Izmainīt debconf prioritāti

source: Unable to configure GRUB
cy: Methwyd cyflunio GRUB
lv: Nevar nokonfigurēt GRUB

source: Device for boot loader installation:
cy: Y dyfais ar gyfer sefydliad llwythydd bŵtio:
lv: Ierīce, uz kuras instalēt palaidēju:

source: You need to make the newly installed system bootable, by installing the GRUB boot loader on a bootable device. The usual way to do this is to install GRUB on the master boot record of your first hard drive. If you prefer, you can install GRUB elsewhere on the drive, or to another drive, or even to a floppy.
cy: Rhaid i chi wneud y system Debian sydd newydd gael ei sefydlu yn fŵtiadwy, gan sefydlu'r bŵtlwythydd GRUB ar ddyfais bŵtiadwy. Y ffordd arferol i wneud hyn yw i sefydlu GRUB ar gofnod bŵt meistr eich disgen galed cyntaf. Os hoffech, gallwch sefydlu GRUB rhywle arall ar y disg, neu ar ddisg arall, neu hyd yn oed at ddisgen hyblyg.
lv: Jums jāpadara jaunā sistēma palaižama, instalējot GRUB palaidēju uz kādas no palaižamām ierīcēm. Parasti to veic, instalējot GRUB uz pirmā cietā diska galvenā palaišanas ieraksta. Taču jūs varat instalēt GRUB arī citur uz diska, uz cita diska dziņa vai pat uz disketes.

source: GRUB password:
cy: Cyfrinair GRUB:
lv: GRUB parole:

source: The GRUB boot loader offers many powerful interactive features, which could be used to compromise your system if unauthorized users have access to the machine when it is starting up. To defend against this, you may choose a password which will be required before editing menu entries or entering the GRUB command-line interface. By default, any user will still be able to start any menu entry without entering the password.
lv: GRUB palaidējs piedāvā daudzas spēcīgas interaktīvas iespējas, ko var izmantot, lai kaitētu jūsu sistēmai, ja nesankcionēti lietotāji var piekļūt tai palaišanas laikā. Lai aizsargātos no tā, jūs varat iestatīt paroli, kas būs jāievada katru reizi pirms piekļūšanas GRUB komandrindas saskarnei. Pēc noklusējuma lietotāji varēs piekļūt jebkuram izvēlnes ierakstam, neievadot paroli.

source: If you do not wish to set a GRUB password, leave this field blank.
cy: Os nad ydych chi'n gwybod beth i'w rhoi, gadewch e'n wag
lv: Ja nevēlaties iestatīt GRUB paroli, atstājiet šo rindiņu tukšu.

source: Please enter the same GRUB password again to verify that you have typed it correctly.
cy: Os gwelwch yn dda, rhowch yr un cyfrinair 'root' eto er mwyn gwirio eich bod wedi ei deipio'n gywir.
lv: Lūdzu ievadiet to pašu GRUB paroli vēlreiz, lai pārliecinātos, ka jūs to ievadījāt pareizi.

source: GRUB installation failed
cy: Gosodiad GRUB wedi methu
lv: GRUB instalēšana neizdevās

source: The '${GRUB}' package failed to install into /target/. Without the GRUB boot loader, the installed system will not boot.
cy: Methodd y pecyn '${GRUB}' gosod i fewn i /target/. Ni all y system gosodedig gychwyn heb y llwythwr cychwyn GRUB.
lv: '${GRUB}' pakotni neizdevās uzinstalēt uz /target/. Bez GRUB palaidēja uzinstalēto sistēmu nevarēs palaist.

source: Unable to install GRUB in ${BOOTDEV}
cy: Methywd sefydlu GRUB yn ${BOOTDEV}
lv: Nevar instalēt GRUB uz ${BOOTDEV}

source: Executing 'grub-install ${BOOTDEV}' failed.
cy: Methwyd rhedeg 'grub-install ${BOOTDEV}'.
lv: Kļūda, izpildot 'grub-install ${BOOTDEV}'.

source: This is a fatal error.
cy: Mae hyn yn wall marwol.
lv: Šī ir fatāla kļūda.

source: Executing 'update-grub' failed.
cy: Methwyd rhedeg 'update-grub'.
lv: Kļūda, izpildot 'update-grub'.

source: Reinstall GRUB boot loader
cy: Sefydlu'r bŵtlwythydd GRUB
lv: Pārinstalēt GRUB palaidēju

source: Failed to retrieve the preconfiguration file
cy: Methwyd cyrchu'r ffeil cyngyfluniad
lv: Prekonfigurācijas faila ielāde nesekmīga

source: The file needed for preconfiguration could not be retrieved from ${LOCATION}. The installation will proceed in non-automated mode.
cy: Methwyd cyrchu'r ffeil sy'n angenrheidiol ar gyfer cyngyfluniad o ${LOCATION}. Fe fydd y sefydliad yn mynd ymlaen yn y modd di-awtomatig.
lv: Failu, kas nepieciešams prekonfigurācijai, nevarēja iegūt no ${LOCATION}. Instalēšana turpināsies neautomātiskajā režīmā.

source: Failed to process the preconfiguration file
cy: Methwyd llwytho'r ffeil cyngyfluniad
lv: Kļūda, apstrādājot prekonfigurācijas failu

source: The installer failed to process the preconfiguration file from ${LOCATION}. The file may be corrupt.
cy: Methodd y sefydlydd lwytho'r ffeil cyngyfluniad o ${LOCATION}. Efallai mae'r ffeil yn llygredig.
lv: Instalators nevarēja apstrādāt prekonfigurācijas failu no ${LOCATION}. Iespējams, šis fails ir bojāts.

source: Failed to run preseeded command
cy: Methwyd rhedeg y gochymyn cynhedynnedig
lv: Kļūda, izpildot prekonfigurācijas komandu

source: Execution of preseeded command "${COMMAND}" failed with exit code ${CODE}.
cy: Method gweithrediad y gorchymyn cynhedynnedig "${COMMAND}" gyda'r côd gorffen ${CODE}.
lv: Prekonfigurēšanas komanda "${COMMAND}" bija nesekmīga ar izejas kļūdu ${CODE}.

source: Rescue mode
cy: Defnyddio'r modd arbed
lv: Glābšanas režīms

source: Device to use as root file system:
cy: Y ddyfais i'w glymu fel y system ffeiliau gwraidd:
lv: Ierīce, kuru izmantot saknes failu sistēmai:

source: Enter a device you wish to use as your root file system. You will be able to choose among various rescue operations to perform on this file system.
cy: Mewnosodwch ddyfais yr ydych am ddefnyddio fel ei system ffeil gwraidd. Byddwch yn medru dewis rhwng gwahanol gwasanaethau achub i weithredu ar y system ffeil yma.
lv: Ievadiet ierīci, ko jūs vēlaties lietot kā jūsu sistēmas saknes failu sistēmu. Jums tiks piedāvātas vairākas glābšanas operācijas, ko jūs varēsiet veikt ar šo failu sistēmu.

source: If you choose not to use a root file system, you will be given a reduced choice of operations that can be performed without one. This may be useful if you need to correct a partitioning problem.
lv: Izvēloties nelietot saknes failu sistēmu, just tiks dota pieeja ierobežotam operāciju sarakstam, ko var veikt bez saknes failu sistēmas. Tas varbūt noderīgi sadaļu veidošanas problēmu novēršanai.

source: Execute a shell in ${DEVICE}
lv: Izpildīt čaulu ${DEVICE}

source: Execute a shell in the installer environment
cy: Gweithredu cragen yn yr amgylchedd gosodiad
lv: Palaist komandrindu instalatora vidē

source: Choose a different root file system
cy: / - system ffeiliau gwraidd
lv: Izvēlēties citu saknes failu sistēmu

source: Reboot the system
cy: Dim system ffeiliau gwraidd
lv: Pārstartēt sistēmu

source: Executing a shell
cy: Gweithredu cragen
lv: Komandrindas izpildīšana

source: After this message, you will be given a shell with ${DEVICE} mounted on "/". If you need any other file systems (such as a separate "/usr"), you will have to mount those yourself.
lv: Pēc šī ziņojuma, ja failu sistēma ${DEVICE} būs piemontēta sekmīgi, jums tiks piedāvāta čaula šajā failu sistēmā. Ja jums ir nepieciešamas vēl kādas failu sistēmas (piemēram, atsevišķa "/usr"), tās būs jāpiemontē manuāli.

source: Interactive shell on ${DEVICE}
lv: Komandrinda uz ${DEVICE}

source: After this message, you will be given a shell with ${DEVICE} mounted on "/target". You may work on it using the tools available in the installer environment. If you want to make it your root file system temporarily, run "chroot /target". If you need any other file systems (such as a separate "/usr"), you will have to mount those yourself.
lv: Pēc šī ziņojuma, ja failu sistēma ${DEVICE} būs piemontēta sekmīgi, jums tiks piedāvāta čaula ar šo failu sistēmu piemontētu kā "/target". Jūs varat darboties uz tās ar rīkiem no instalatora vides. Ja vēlaties īslaicīgi padarīt to par jūsu čaulas saknes failu sistēmu, izmantojiet komandu "chroot /target". Ja jums ir nepieciešamas citas failu sistēmas (piemēram, atsevišķa "/usr"), tās būs jāpiemontē manuāli.

source: After this message, you will be given a shell in the installer environment. No file systems have been mounted.
lv: Pēc šī ziņojuma jums tiks piedāvāta komandrinda uzstādītāja vidē. Nekādas failu sistēmas nav piemontētas.

source: Interactive shell in the installer environment
cy: Cragen rhyngweithiol yn yr amgylchedd gosodiad
lv: Palaist komandrindu instalatora vidē

source: Passphrase for ${DEVICE}:
cy: Cyfrinair ar gyfer ${DEVICE}:
lv: Parole ${DEVICE}:

source: Please enter the passphrase for the encrypted volume ${DEVICE}.
cy: Mewnosodwch y cyfrinair ar gyfer ${DEVICE}.
lv: Lūdzu, ievadiet paroli šifrētajam sējumam ${DEVICE}.

source: If you don't enter anything, the volume will not be available during rescue operations.
cy: Os na mewonosodwch unrhyw beth, ni fydd ar gael yn ystod yr proses achub
lv: Ja jūs neievadīsiet neko, sējums nebūs pieejams glābšanas operācijām.

source: Partitions to assemble:
lv: Saliekamās sadaļas:

source: Select the partitions to assemble into a RAID array. If you select "Automatic", then all devices containing RAID physical volumes will be scanned and assembled.
lv: Sadaļu izvēle RAID masīva salikšanai. Izvēloties "Automātiski" visas iekārtas ar RAID fiziskajiem sējumiem tiks noskanētas un saliktas kopā.

source: Note that a RAID partition at the end of a disk may sometimes cause that disk to be mistakenly detected as containing a RAID physical volume. In that case, you should select the appropriate partitions individually.
lv: Jāņem vērā, ka ja RAID sadaļa atrodas diska beigās, tad tas var izraisīt nepareizu šī diska noteikšanu kā RAID fiziskos sējumu saturošu. Šādā gadījumā ir manuāli jāizvēlas atbilstošās sadaļas.

source: floppy
cy: hyblyg
lv: diskete

source: web
cy: we
lv: tīmeklis

source: mounted file system
cy: Dim system ffeiliau gwraidd
lv: piemontēta failu sistēma

source: How should the debug logs be saved or transferred?
cy: Pa mor hir dylid cadw cofnodion debug neu cyfnewid?
lv: Kā saglabāt vai pārsūtīt atkļūdošanas žurnāla ierakstus?

source: Debugging log files for the installer can be saved to floppy, served up over the web, or saved to a mounted file system.
cy: Gellir safio'r ffeiliau cofnodion debugging ar ddisg hyblyg, dros y we, neu ar system ffeil gosodedig.
lv: Instalatora atkļūdošanas žurnāla ierakstu failus var saglabāt disketē, publicēt internetā vai saglabāt uz piemontētas failu sistēmas.

source: Directory in which to save debug logs:
cy: Cyfeiriadur i safio'r cofnodion debug
lv: Mape, kurā saglabāt atkļūdošanas žurnāla ierakstus:

source: Please make sure the file system you want to save debug logs on is mounted before you continue.
cy: Sicrhewch bod y system ffeil yr am safio'r logs iddo wedi'i gosod cyn parhau
lv: Pirms turpiniet, lūdzu, pārliecinieties, ka failu sistēma, uz kuras vēlaties saglabāt atkļūdošanas žurnāla ierakstus, ir piemontēta.

source: Cannot save logs
cy: Methu safio logs
lv: Žurnāla ierakstus neizdevās saglabāt

source: The directory "${DIR}" does not exist.
cy: Nid yw'r cyfeiriadur "${DIR}" yn bodoli
lv: Mape "${DIR}" neeksistē.

source: Insert formatted floppy in drive
cy: Rhowch ddisgen wedi ei fformadu yn y gyrriant
lv: Ielieciet formatētu disketi diskešu dzinī

source: Log files and debug info will be copied into this floppy.
cy: Caiff cofnodion a gwybodaeth cyfluniad eu copïo i'r disgen hyblyg yma.
lv: Žurnāla faili un atkļūdošanas informācija tiks nokopēti uz šo disketi.

source: The information will also be stored in /var/log/installer/ on the installed system.
cy: Caiff y wybodaeth ei gadw hefyd yn /var/log/installer/ ar y system sefydliedig, ac ar ddisgen hyblog os canfuwyd dyfais disgen hyblyg.
lv: Šī informācija tiks saglabāta jaunajā sistēmā /var/log/installer/ mapē.

source: Check the CD-ROM(s) integrity
cy: Gwirio cywirdeb y CD-ROM(au)
lv: CD-ROM integritātes pārbaude

source: Continue installation remotely using SSH
cy: Mynd ymlaen gyda'r rhaniadydd
lv: Turpināt instalāciju attālināti izmantojot SSH

source: Start installer
cy: Ni ellir sefydlu Debian
lv: Palaist isntalatoru

source: Start installer (expert mode)
cy: Gadael yr arddangosiad sefydlydd
lv: Palaist instalatoru (ekspera režīms)

source: Start shell
cy: Cragen rhyngweithiol
lv: Palaist čaulu

source: Network console option:
cy: Dull cyfluniad rhwydwaith:
lv: Tīkla komandrindas parametri:

source: This is the network console for the Debian installer. From here, you may start the Debian installer, or execute an interactive shell.
cy: Dyma consol rhwydwaith i'r gosodwr Debian. O'r fan hon, medrwch ddechrau'r gosodwr Debian, neu gweithredu cragen rhyngweithiol.
lv: Šī ir Debian instalatora tīkla komandrinda. No šejienes jūs varat palaist Debian instalatora galveno izvēlni vai interaktīvu čaulu.

source: To return to this menu, you will need to log in again.
cy: Er mwyn dychwelyd i'r dewislen yma, bydd rhaid i chi logio i mewn eto
lv: Lai atgrieztos uz šo izvēlni, jums būs vēlreiz jāpieslēdzas sistēmai.

source: Generating SSH host key
cy: Creu allwedd host SSH
lv: Ģenerē SSH datora atslēgu

source: Remote installation password:
cy: Gwall sefydlu system sail
lv: Attālinātās instalācijas parole:

source: You need to set a password for remote access to the Debian installer. A malicious or unqualified user with access to the installer can have disastrous results, so you should take care to choose a password that is not easy to guess. It should not be a word found in the dictionary, or a word that could be easily associated with you, like your middle name.
cy: Rhaid i chi osod cyfrinair ar gyfer 'root', cyfrif gweinyddol y system. Gall ddefnyddiwr maleisus neu anghymwys gyda mynediad 'root' gael canlyniadau trychinebus, felly dylwch gymryd ofal i ddewis gyfrinair 'root' nad yw'n hawdd i'w ddyfalu. Ni ddylai fod yn air mewn geiriadur, neu'n air a ellir ei gysyllti'n hawdd a chwi.
lv: Jums jāuzstāda Debian instalatora attālinātās piekļuves parole. Ļaunprātīgs vai nezinošs lietotājs ar piekļuvi šim instalatoram var radīt postošas sekas. Jums būtu jāizvēlas tāda parole, kuru nevar viegli uzminēt. Tam nevajadzētu būt kādam parastam vārdam vai vārdam, ko varētu viegli asociēt ar Jums personiski.

source: This password is used only by the Debian installer, and will be discarded once you finish the installation.
cy: Mae'r cyfrinair hyn i'w ddefnyddio gan y gosodwr Debian, a chaiff ei ddinistrio unwaith i chi orffen y gosodiad
lv: Šo paroli izmantos tikai Debian instalātors un instalācijas beigās tā tiks iznīcināta.

source: Please enter the same remote installation password again to verify that you have typed it correctly.
cy: Os gwelwch yn dda, rhowch yr un cyfrinair 'root' eto er mwyn gwirio eich bod wedi ei deipio'n gywir.
lv: Lūdzu ievadiet to pašu paroli velreiz, lai pārlieciātos, ka esat to ievadījis pareizi.

source: Password mismatch
cy: Cyfrinair annilys
lv: Paroles nesakrīt

source: The two passwords you entered were not the same. Please enter a password again.
cy: Nid oedd y ddau gryfinair y rhoddoch yr yn peth. Ceisiwch eto os gwelwch yn dda.
lv: Jūsu ievadītās paroles nesakrīt, lūdzu ievadiet tās vēlreiz.

source: Start SSH
cy: Dechrau SSH
lv: Palaist SSH

source: To continue the installation, please use an SSH client to connect to the IP address ${ip} and log in as the "installer" user. For example:
cy: I parhau gyda'r gosodiad, defnyddiwch client SSH i gysylltu i'r cyfeiriad IP ${ip} a logiwch i mewn fel y defnyddiwr "installer" e.e.
lv: Lai turpinātu instalāciju, lūdzu lietojiet SSH klientu lai pieslēgtos pie IPadreses ${ip} kā "installer" lietotājs. Piemēram:

source: The fingerprint of this SSH server's host key is: ${fingerprint}
lv: SSH servera saimniekdatora atslēgas nospiedums ir: ${fingerprint}

source: Please check this carefully against the fingerprint reported by your SSH client.
lv: Lūdzu rūpīgi salīdziniet to ar jūsu SSH klienta ziņoto atslēgas nospiedumu.

source: IPv6-in-IPv4
cy: IPv6-yn-IPv4
