Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel2/*.po
Languages: cy, lv

source: usrquota - user disk quota accounting enabled
cy: usrquota - mae cyfrifo cwota disg defnyddiwr wedi ei alluogi
lv: usrquota - ierobežot lietotāja izmantoto diska apjomu

source: grpquota - group disk quota accounting enabled
cy: grpquota - mae cyfrifo cwota disg grŵp wedi ei alluogi
lv: grpquota - ierobežot lietotāju grupas izmantoto diska apjomu

source: user_xattr - support user extended attributes
cy: user_xattr - cefnogi priodweddau ychwanegir gan ddefnyddwyr
lv: user_xattr - atbalstīt lietotāju paplašinātos atribūtus

source: quiet - changing owner and permissions does not return errors
cy: quiet - dyw newid y perchennog a chaniatadau ddim yn dychwelyd gwallau
lv: quiet - īpašnieku un atļauju maiņas neatgriež kļūdu paziņojumus

source: notail - disable packing of files into the file system tree
cy: notail - analluogi pacio ffeiliau i fewn i'r goeden system ffeiliau
lv: notail - atslēgt failu uzkrāšanu failu sistēmas kokā

source: Ext3 journaling file system
cy: System ffeiliau dyddlyfru ext3
lv: Ext3 žurnalējošā failu sistēma

source: Ext4 journaling file system
lv: Ext4 žurnalējošā failu sistēma

source: Go back to the menu and correct this problem?
cy: Dychwelyd i'r ddewislen a chywiro gwallau?
lv: Atgriezties uz galveno izvēlni un izlabot kļūdas?

source: Your boot partition has not been configured with the ext2 or ext3 file system. This is needed by your machine in order to boot. Please go back and use either the ext2 or ext3 file system.
cy: Mae'r rhaniad cychwynol heb ei cyfnewid gyda'r system ffeil ext2 neu ext3. Mae angen hwn ar y peiriant er mwyn iddo gychwyn. Dychwelwch a defnyddiwch naill ai y system ffeil ext2 neu ext3.
lv: Jūsu palaišanas (boot) sadaļa nav nokonfigurēta ar ext2 vai ext3 failu sistēmu. Taču šāda konfigurācija ir nepieciešama, lai jūsu dators palaistos. Lūdzu, atgriezieties un izvēlieties ext2 vai ext3 failu sistēmu.

source: If you do not go back to the partitioning menu and correct this error, the partition will be used as is. This means that you may not be able to boot from your hard disk.
cy: Os nad ydych chi'n dychwelyd i'r ddewislen rhaniadu a chywiro'r gwallau hyn, caiff y rhaniad ei ddefnyddio fel y mae.
lv: Ja neatgriezīsieties uz sadaļu veidošanas izvēlni un neizlabosiet radušās kļūdas, sadaļas tiks izmantotas esošajā konfigurācijā. Tas nozīmē, ka, iespējams, jūs vēlāk nevarēsiet palaist savu datoru no cietā diska.

source: Your boot partition is not located on the first primary partition of your hard disk. This is needed by your machine in order to boot. Please go back and use your first primary partition as a boot partition.
cy: Nid yw'ch rhaniad cychwynol wedi'i leoli ar y brif rhaniad cyntaf o'ch ddisg caled. Mae angen hwn ar eich peiriant er mwyn iddo gychwyn. Dychwelwch a defnyddiwch eich prif rhaniad cyntaf fel rhaniad cychwynol.
lv: Jūsu palaišanas (boot) sadaļa neatrodas uz jūsu cietā diska pirmās primārās sadaļas. Taču tas ir nepieciešams, lai jūsu mašīna palaistos. Lūdzu, atgriezieties un palaišanas sadaļai izvēlieties sava diska pirmo primāro sadaļu.

source: Return to the menu to set the bootable flag?
lv: Atgriezties uz izvēlni, lai uzstādītu sadaļas ielādējamību?

source: The boot partition has not been marked as a bootable partition, even though this is required by your machine in order to boot. You should go back and set the bootable flag for the boot partition.
lv: Jūsu saknes (root) sadaļa nav atzīmēta kā ielādējama sadaļa. Taču tas ir nepieciešams, lai jūsu mašīna sāknētos. Lūdzu atgriezieties un norādiet savu saknes (root) sadaļu kā lādējamu.

source: If you don't correct this, the partition will be used as is and it is likely that the machine cannot boot from its hard disk.
lv: Ja neatgriezīsieties uz sadaļu veidošanas izvēlni un neizlabosiet radušās kļūdas sadaļas tiks izmantotas esošajā konfigurācijā. Visticamāk jūs vēlāk nevarēsiet iesāknēt savu mašīnu.

source: btrfs journaling file system
lv: btrfs žurnalējošā failu sistēma

source: ReiserFS journaling file system
cy: Y system ffeiliau dyddlyfru ReiserFS
lv: ReiserFS žurnalējošā failu sistēma

source: JFS journaling file system
cy: Y system ffeiliau dyddlyfru JFS
lv: JFS žurnalējošā failu sistēma

source: Use unrecommended JFS root file system?
cy: Ni gymhellir defnydd system ffeiliau gwraidd JFS?
lv: Lietot nerekomendēto JFS saknes failu sistēmu?

source: Your root file system is a JFS file system. This can cause problems with the boot loader used by default by this installer.
cy: Mae eich system ffeiliau gwraidd yn system ffeiliau JFS. Fe all hyn achosi problemau gyda'r bŵtlwythydd a ddefnyddir yn rhagosodedig gan y sefydlydd hwn.
lv: Jūsu saknes failu sistēma ir JFS failu sistēma. Tas var radīt problēmas ar instalatora izmantoto noklusēto palaidēju.

source: You should use a small /boot partition with another file system, such as ext3.
cy: Dylwch ddefnyddio rhaniad /boot bychan gyda system ffeiliau arall, megis ext3.
lv: Jums vajadzētu lietot mazu kādas citas failu sistēmas (piemēram, ext3) /boot sadaļu.

source: Use unrecommended JFS /boot file system?
cy: Ni gymhellir defnydd system ffeiliau /boot JFS?
lv: Lietot nerekomendēto JFS /boot failu sistēmu?

source: You have mounted a JFS file system as /boot. This is likely to cause problems with the boot loader used by default by this installer.
cy: Mae eich system ffeiliau gwraidd yn system ffeiliau JFS. Fe all hyn achosi problemau gyda'r bŵtlwythydd a ddefnyddir yn rhagosodedig gan y sefydlydd hwn.
lv: Jūs kā /boot piemontējāt JFS failu sistēmu. Tas visdrīzāk radīs problēmas ar šī instalatora izmantoto noklusēto palaidēju.

source: You should use another file system, such as ext3, for the /boot partition.
cy: Dylwch ddefnyddio system ffeiliau arall, megis ext3, ar gyfer y rhaniad /boot.
lv: Jums /boot sadaļai vajadzētu izmantot citu failu sistēmu, piemēram, ext3.

source: XFS journaling file system
cy: Y system ffeiliau dyddlyfru XFS
lv: XFS žurnalējošā failu sistēma

source: Identical labels for two file systems
lv: Divām failu sistēmām norādītas identiskas etiķetes

source: Two file systems are assigned the same label (${LABEL}): ${PART1} and ${PART2}. Since file system labels are usually used as unique identifiers, this is likely to cause reliability problems later.
lv: Divām failu sistēmām ir piešķirtas vienādas etiķetes (${LABEL}): ${PART1} un ${PART2}. Parasti failu sistēmu etiķetes tiek uzskatītas par unikāliem identifikatoriem. Vienādu etiķešu izmantošana var radīt problēmas šīs sistēmas izmantošanā.

source: Please correct this by changing labels.
lv: Lūdzu, izlabojiet to, mainot etiķetes

source: Identical mount points for two file systems
cy: Pwyntiau clymu unfath ar gyfer dau system ffeiliau
lv: Divām failu sistēmām norādīti identiski montēšanas punkti

source: Two file systems are assigned the same mount point (${MOUNTPOINT}): ${PART1} and ${PART2}.
cy: Mae dau system ffeiliau wedi eu cysylltu i'r un pwynt clymu (${MOUNTPOINT}): ${PART1} a ${PART2}.
lv: Divām failu sistēmām ir norādīts viens un tas pats montēšanas punkts (${MOUNTPOINT}): ${PART1} un ${PART2}.

source: Please correct this by changing mount points.
cy: Cywirwch gan newid pwyntiau clymu os gwelwch yn dda.
lv: Lūdzu, izlabojiet to, mainot montēšanas punktus.

source: No root file system
cy: Dim system ffeiliau gwraidd
lv: Nav saknes failu sistēmas

source: No root file system is defined.
cy: Does dim system ffeiliau gwraidd wedi ei ddiffinio.
lv: Nav norādīta saknes failu sistēma.

source: Please correct this from the partitioning menu.
cy: Os gwelwch yn dda, cywirwch hyn o'r ddewislen rhaniadu.
lv: Lūdzu, izlabojiet to disku dalīšanas izvēlnē.

source: Separate file system not allowed here
cy: Ni chaniateir system ffeil ar wahan yma
lv: Šajā vietā nav pieļaujama atsevišķa failu sistēma

source: You assigned a separate file system to ${MOUNTPOINT}, but in order for the system to start correctly this directory must be on the root file system.
cy: Rhoddoch system ffeil ar wahan i ${MOUNTPOINT}, ond er mwyn i'r system ddechrau yn iawn mae'n rhaid i'r cyfeirlyfr yma fod yn y ffeil system gwraidd.
lv: Jūs nozīmējāt atsevišķu failu sistēmu uz ${MOUNTPOINT}, bet, lai sistēma sāktu strādāt korekti, šai mapei jāatrodas saknes failu sistēmā.

source: Do you want to resume partitioning?
cy: Ydych chi eisiau parhau a'r rhaniadu?
lv: Vai vēlaties turpināt dalīšanu?

source: The attempt to mount a file system with type ${TYPE} in ${DEVICE} at ${MOUNTPOINT} failed.
cy: Methodd y cais i glymu system ffeiliau gyda'r math ${TYPE} yn ${DEVICE} at ${MOUNTPOINT}.
lv: Neizdevās piemontēt ${TYPE} failu sistēmu no ${DEVICE} pie ${MOUNTPOINT}.

source: You may resume partitioning from the partitioning menu.
cy: Cewch parhau gyda rhaniadu o'r dewislen rhaniadu.
lv: Jūs varat turpināt dalīšanu no disku dalīšanas izvēlnes.

source: Use as:
cy: Defnyddio fel:
lv: Lietot kā:

source: Set the clock using NTP?
cy: Gosod y cloc gan ddefnyddio NTP?
lv: Iestatīt pulksteni, izmantojot NTP?

source: The Network Time Protocol (NTP) can be used to set the system's clock. The installation process works best with a correctly set clock.
cy: Gellir defnyddio Protocol Amser Rhwydwaith (NTP) i osod amser y cloc. Mae'r broses gosod yn gweithio orau wrth defnyddio cloc gyda'r amser cywir.
lv: Tīkla laika protokols (Network Time Protocol jeb NTP) var tikt izmantots, lai noregulētu sistēmas pulksteni. Instalēšanas process vislabāk darbojas ar pareizi uzstādītu laiku.

source: NTP server to use:
cy: Gweinydd NTP i'w defnyddio
lv: Izmantojamais NTP serveris:

source: The default NTP server is almost always a good choice, but if you prefer to use another NTP server, you can enter it here.
cy: Mae'r gweinydd rhagosod NTP bron bob amser yn dewis da, ond os oes gwell gennych defnyddio gweinydd NTP arall, mewnosodwch yma.
lv: Noklusētais NTP serveris parasti ir vislabākā izvēle, bet, ja vēlaties izmantot citu NTP serveri, to ir iespējams norādīt šeit.

source: Wait another 30 seconds for hwclock to set the clock?
cy: Arhoswch 30 eiliad arall i hwclock i osod y cloc?
lv: Vai nogaidīt papildu 30 sekundes, kamēr hwclock iestatīs laiku?

source: Setting the hardware clock is taking longer than expected. The 'hwclock' program used to set the clock may have problems talking to the hardware clock.
cy: Mae gosod cloc y caledwedd yn cymryd yn hirach na'r disgwyl. Mae'n bosibl bod y rhaglen 'hwclock' a ddefnyddiwyd i osod y cloc yn cael problem cysylltu gyda chloc y caledwedd.
lv: Aparatūras pulksteņa iestatīšana aizņem vairāk laika nekā gaidīts. 'hwlock' programmai, kas iestata pulksteni, varētu būt problēmas komunikācijā ar aparatūras pulksteni.

source: If you choose to not wait for hwclock to finish setting the clock, this system's clock may not be set correctly.
cy: Os penderfynwch beidio ag aros i hwclock orffen gosod y cloc, mae'n bosibl na fydd cloc y system hwn wedi ei osod yn gywir.
lv: Ja jūs izvēlaties negaidīt, kamēr hwclock pabeigs noregulēt pulksteni, sistēmas laiks varētu palikt nenoregulēts.

source: Proceed with installation to unclean target?
cy: Parhau gyda sefydliad at darged nid yw'n lân?
lv: Turpināt instalēt uz nesakoptu mērķa direktoriju?

source: The target file system contains files from a past installation. These files could cause problems with the installation process, and if you proceed, some of the existing files may be overwritten.
cy: Mae'r system ffeiliau targed yn cynnwys ffeiliau o sefydliad blaenorol. Gall y ffeiliau hyn dorri'r broses sefydlu neu achosi i system wedi torri gael ei sefydlu.
lv: Izvēlētā failu sistēma satur failus no iepriekšējās instalācijas. Šie faili var traucēt instalēšanas procesam un, ja turpināsiet, daļa esošo failu var tikt pārrakstīti.

source: No file system mounted on /target
cy: Dim system ffeiliau wedi ei glymu at /target
lv: Mērķa mapē (/target) nav piemontēta failu sistēma

source: Before the installation can proceed, a root file system must be mounted on /target. The partitioner and formatter should have done this for you.
cy: Cyn gall y sefydliad lwytho, rhaid clymu system ffeiliau gwraidd at /target. Fe ddylai'r rhaniadydd a'r fformatiwr fod wedi gwneud hyn ar eich cyfer.
lv: Pirms instalēšana var turpināties, pie /target jāpiemontē saknes failu sistēma. Disku dalīšanas rīkam vajadzēja izdarīt to jūsu vietā.

source: Not installing to unclean target
cy: Ddim yn sefydlu at darged aflan
lv: Neinstalē uz nesakoptu mērķa direktoriju

source: The installation to the target file system has been canceled. You should go back and erase or format the target file system before proceeding with the install.
cy: Mae'r sefydliad i'r system ffeiliau targed wedi ei ddiddymu, gan fod y system ffeiliau targed yn cynnwys ffeiliau o sefydliad cynt, a all dorri'r proses sefydlu neu achosi i system dorredig gael ei sefydlu. Dylwch dychwelyd a dileu neu fformadu'r system ffeiliau targed cyn mynd ymlaen gyda'r sefydliad.
lv: Instalēšana izvēlētajā failu sistēmā ir atcelta. Pirms turpināt instalēšanu, jums vajadzētu atgriezties un izdzēst vai vēlreiz formatēt izvēlēto failu sistēmu.

source: Cannot install base system
cy: Methwyd sefydlu'r system sail
lv: Neizdevās instalēt bāzes sistēmu

source: The installer cannot figure out how to install the base system. No installable CD-ROM was found and no valid mirror was configured.
cy: Nid yw sefydlydd yn gwybod sut i sefydlu Debian. Ni chanfuwyd CD-ROM sefydliadwy a ni chyfluniwyd drych dilys.
lv: Instalators nespēj noteikt kā instalēt bāzes sistēmu. Nav atrasts instalēšanai izmantojams CD vai nokonfigurēts derīgs spoguļserveris.

source: Debootstrap Error
cy: Gwall Debootstrap
lv: Debootstrap kļūda

source: Failed to determine the codename for the release.
cy: Methwyd cyrchu'r ffeil cyngyfluniad
lv: Neizdevās noskaidrot laidiena kodēto nosaukumu.

source: Failed to install the base system
cy: Methwyd sefydlu'r system sail
lv: Kļūda, instalējot bāzes sistēmu

source: The base system installation into /target/ failed.
cy: Methwyd sefydlu'r system sail i fewn i /target/.
lv: Bāzes sistēmas instalēšana mapē /target/ neizdevās.

source: Base system installation error
cy: Gwall sefydlu system sail
lv: Bāzes sistēmas instalēšanas kļūda

source: The debootstrap program exited with an error (return value ${EXITCODE}).
cy: Gorffenodd y rhaglen debootstrap gyda gwall (gwerth dychwelyd ${EXITCODE}).
lv: debootstrap beidza darbu ar kļūdu (atgrieztā vērība ${EXITCODE}).

source: The debootstrap program exited abnormally.
cy: Gorffenodd y rhaglen debootstrap mewn ffordd anarferol.
lv: debootstrap beidza darbu ar kļūdu.

source: The following error occurred:
cy: Digwyddodd y gwall canlynol:
lv: Notikusi kļūda:

source: Unable to install the selected kernel
cy: Ni ellir sefydlu'r cnewyllyn dewisiedig
lv: Nevaru uzinstalēt izvēlēto kodolu

source: An error was returned while trying to install the kernel into the target system.
cy: Dychwelwyd gwall wrth geisio sefydlu'r cnewyllyn i fewn i'r system targed.
lv: Kļūda, mēģinot uzinstalēt kodolu bāzes sistēmā.

source: Kernel package: '${KERNEL}'.
cy: Pecyn cnewyllyn: '${KERNEL}'.
lv: Kodola pakotne: '${KERNEL}'.

source: none[ Do not translate what's inside the brackets and just put the translation for the word "none" in your language without any brackets. This "none" means "no kernel" ]
cy: dim
lv: nekādu

source: Kernel to install:
cy: Y cnewyllyn i'w sefydlu:
lv: Kādu kodolu instalēt:

source: The list shows the available kernels. Please choose one of them in order to make the system bootable from the hard drive.
cy: Mae'r rhestr yn dangos y cnewyllynau sydd ar gael. Os gwelwch yn dda, dewiswch un ohonyn nhw er galluogi'r system i fŵtio o'r ddisgen galed.
lv: Šie ir pieejamie kodoli. Lūdzu, izvēlieties vienu no tiem, lai sistēma varētu tikt palaista no cietā diska.

source: Continue without installing a kernel?
cy: Parhau heb sefydlu cnewyllyn?
lv: Turpināt bez kodola instalēšanas?

source: No installable kernel was found in the defined APT sources.
cy: Ni chanfuwyd cnewyllyn gellir sefydlu yn y ffynhonellau APT a ddiffiniwyd.
lv: Definētajos APT avotos nav atrasti instalējami kodoli.

source: You may try to continue without a kernel, and manually install your own kernel later. This is only recommended for experts, otherwise you will likely end up with a machine that doesn't boot.
cy: Medrwch ceisio parhau heb cnewyllyn, a gosod cnewyllyn eich hun a llaw nes ymlaen. Arbenigwyr yn unig dylai gwneud hyn, neu mae'n bosibl y bydd gennych peiriant nad sy'n dechrau.
lv: Jūs varat turpināt arī bez kodola, taču tad jums vajadzēs to uzinstalēt vēlāk. Tā rīkoties ir ieteicams tikai ekspertiem, pretējā gadījumā jūs varat iegūt nepalaižamu sistēmu.

source: Cannot install kernel
cy: Ni ellir sefydlu Debian
lv: Kļūda, instalējot kodolu

source: The installer cannot find a suitable kernel package to install.
cy: Ni all y gosodwr ddod o hyn i becyn cnewyllyn cymwys i'w osod.
lv: Instalators nevar atrast piemērotu kodola pakotni, ko instalēt.

source: Unable to install ${PACKAGE}
cy: Methywd sefydlu ${PACKAGE}
lv: Nevar uzinstalēt ${PACKAGE}

source: An error was returned while trying to install the ${PACKAGE} package onto the target system.
cy: Dychwelwyd gwall wrth geisio sefydlu'r precyn ${PACKAGE} yn y system targed.
lv: Kļūda, mēģinot uzinstalēt ${PACKAGE} pakotni izvēlētajā sistēmā.

source: Failed getting Release file ${SUBST0}.
cy: Methwyd cyrchu'r ffeil Release ${SUBST0}.
lv: Kļūda, iegūstot Release failu ${SUBST0}.

source: Failed getting Release signature file ${SUBST0}.
cy: Methwyd cyrchu'r ffeil llofnod Release ${SUBST0}.
lv: Kļūda, iegūstot Release paraksta failu ${SUBST0}.

source: Release file signed by unknown key (key id ${SUBST0})
cy: Mae'r ffeil Release wedi ei lofnodi gan allwedd anysbys (ID allwedd ${SUBST0})
lv: Release fails ir parakstīts ar nezināmu atslēgu (atslēgas id ${SUBST0})

source: Invalid Release file: no valid components.
cy: Ffeil Release annilys: dim cydrannau dilys.
lv: Nederīgs Release fails: tajā nav derīgu komponenšu.

source: Invalid Release file: no entry for ${SUBST0}.
cy: Ffeil Release annilys: dim cofnod ar gyfer ${SUBST0}.
lv: Nederīgs Release fails: nav ${SUBST0} ieraksta.

source: Couldn't retrieve ${SUBST0}. This may be due to a network problem or a bad CD, depending on your installation method.
cy: Methwyd cyrchu ${SUBST0}. Gall hyn fod oherwydd problem rhwydwaith neu CD gwael, yn dibynnu ar eich dull sefydlu.
lv: Nevar iegūt ${SUBST0}. Šādu problēmu atkarībā no instalēšanas metodes var izraisīt problēmas ar tīklu vai bojāts CD.

source: If you are installing from CD-R or CD-RW, burning the CD at a lower speed may help.
cy: Os ydych chi'n sefydlu o CD-R neu CD-RW, efallai gall ysgrifennu'r CD yn arafach helpu.
lv: Ja instalējat no CD-R vai CD-RW, diska ierakstīšana ar lēnāku ātrumu varētu palīdzēt.

source: Debootstrap warning
cy: Gwall Debootstrap
lv: Debootstrap brīdinājums

source: Warning: ${INFO}
cy: Rhybudd: ${INFO}
lv: Brīdinājums: ${INFO}

source: Retrying failed download of ${SUBST0}
cy: Methwyd lawrlwytho ${SUBST0}.
lv: Atkārtota ${SUBST0} lejupielāde nav izdevusies

source: Ignore
cy: dim
lv: Ignorēt

source: Cannot access repository
cy: Methu cael mynediad i'r ystorfa
lv: Nevar piekļūt krātuvei

source: The repository on ${HOST} couldn't be accessed, so its updates will not be made available to you at this time. You should investigate this later.
cy: Ni ellir cael mynediad i'r ystorfa ar ${HOST}, felly ni bydd yr uwchraddiad ar gael i chi ar hyn o bryd. Ymchwiliwch i hwn nes ymlaen.
lv: Nevar piekļūt krātuvei, kas atrodas ${HOST}, tādējādi tā atjauninājumi jums šobrīd nebūs pieejami. Jums vajadzētu vēlāk noskaidrot, kas to izraisa.

source: Commented out entries for ${HOST} have been added to the /etc/apt/sources.list file.
cy: Sylwadau ar cofnodion allan ar ${HOST} wedi'u ychwanegu i'r ffeil rhestr /etc/apt/sources.
lv: ${HOST} izkomentētie ieraksti tika pievienoti /etc/apt/sources.list failam.

source: apt configuration problem
cy: Cyfluniad APT
lv: apt konfigurācijas kļūda

source: An attempt to configure apt to install additional packages from the CD failed.
cy: Mae cais i newid neu i gosod pecynnau ychwanegol o'r CD wedi methu.
lv: Kļūda, mēģinot nokonfigurēt apt, lai instalētu papildu pakotnes no CD.

source: Continue without a network mirror?
cy: Parhau heb drych rhwydwaith?
lv: Turpināt bez tīkla spoguļservera?

source: No network mirror was selected.
cy: Ni ddewiswyd unrhyw ddrych rhwydwaith.
lv: Nav izvēlēts tīkla spoguļserveris.

source: Use restricted software?
cy: Defnyddio meddalwedd cyfyngedig?
lv: Lietot ierobežoto programmatūru?

source: Some non-free software is available in packaged form. Though this software is not a part of the main distribution, standard package management tools can be used to install it. This software has varying licenses which may prevent you from using, modifying, or sharing it.
cy: Mae peth meddalwedd nad sy'n rhad ar gael mewn ffurf pecyn. Er nad yw'r feddalwedd hyn yn rhan o'r brif ddosbarthiad, gellir defnyddio pecyn offer safonol rheolwyr i'w osod. Mae gan y meddalwedd hyn gwahanol trwyddedau a all eich rhwystro rhag ei ddefnyddio, newid neu'i rannu.
lv: Dažas nebrīvās programmas ir pieejamas sapakotā formā. Lai gan šī programmatūra nav galvenās distribūcijas daļa, standarta pakotņu vadības rīkus var izmantot, lai to instalētu. Šai programmatūrai ir dažādas licences, kas var aizliegt jums to lietot, modificēt vai izplatīt.

source: Use software from the "universe" component?
cy: Defnyddiwch meddalwedd o'r "universe"
lv: Lietot programmatūru no "universe" komponentes?

source: Some additional software is available in packaged form. This software is free and, though it is not a part of the main distribution, standard package management tools can be used to install it.
cy: Mae peth meddalwedd ychwanegol ar gael mewn ffurf pecyn. Mae'r meddalwedd hyn yn rhad ac am ddim, er nad yw'n rhan o'r brif ddosbarthiad, gellir defnyddio pecyn offer safonol rheolwyr i'w osod.
lv: Papildu programmatūra ir pieejama sapakotā veidā. Šī programmatūra ir brīva un, lai gan tā nav galvenās distribūcijas daļa, to var instalēt, izmantojot standarta pakotņu vadības rīkus.

source: Use software from the "multiverse" component?
cy: Defnyddiwch meddalwedd o'r "multiverse"
lv: Lietot programmatūru no "multiverse" komponentes?

source: Some non-free software is available in packaged form. Though this software is not a part of the main distribution, standard package management tools can be used to install it. This software has varying licenses and (in some cases) patent restrictions which may prevent you from using, modifying, or sharing it.
cy: Mae peth meddalwedd nad yw'n rhydd wedi ei addasu i weithio efo Debian. Er nad yw'r meddalwedd hwn yn rhan o Debian o gwbl, gellir defnyddio offer safonol Debian i'w sefydlu. Mae gan y meddalwedd hwn drwyddedau gwahanol a all eich rhwystro rhag ei ddefnyddio, ei newid neu ei rhannu ef.
lv: Dažas nebrīvās programmas ir pieejamas sapakotā formā. Lai gan šī programmatūra nav galvenās distribūcijas daļa, to var instalēt, izmantojot standarta pakotņu vadības rīkus. Šai programmatūrai ir dažādas licences, kas var aizliegt jums to lietot, modificēt vai izplatīt.

source: Use software from the "partner" repository?
lv: Izmantot programmatūru no "partneru" repozitorijiem?

source: Some additional software is available from Canonical's "partner" repository. This software is not part of Ubuntu, but is offered by Canonical and the respective vendors as a service to Ubuntu users.
lv: Papildus programmatūra ir pieejama no Canonical "partneru" repozitorija. Šī programmatūra nav daļa no Ubuntu, bet Canonical un partneri to piedāvā kā pakalpojumu Ubuntu lietotājiem.

source: Use backported software?
cy: Defnyddiwch meddalwedd ol-porth
lv: Lietot atpakaļpielāgotu programmatūru?
