Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel2/*.po
Languages: cy, lv

source: Load missing drivers from removable media?
cy: Llwytho gyrryddion rhwydwaith colledig o gyfrwng symudol?
lv: Ielādēt trūkstošos draiverus no medija?

source: A driver for your hardware is not available. You may need to load drivers from removable media, such as a USB stick, or driver floppy.
cy: Nid oes gyrriant i'ch caledwedd ar gael. Mae'n bosibl y bydd angen i chi lwytho gyrriannau o gyfrwng symudol, fel cof bach, neu ddisg hyblyg.
lv: Nav atrasts aparatūrai atbilstošs dzinis. Iespējams šie draiveri ir atsevišķi jāielādē no izņemama medija, piemēram no USB atmiņas vai draiveru disketes.

source: If you have such media available now, insert it, and continue.
cy: Os oes gennych y fath gyfrwng, mewnosodwch nawr, a pharhau.
lv: Ja šāds mēdijs ir jums pieejams, ielieciet to un turpiniet.

source: Load missing firmware from removable media?
cy: Llwytho cadarnwedd rhwydwaith colledig o gyfrwng symudol?
lv: Ielādēt trūkstošo aparātprogrammatūru no mēdija?

source: Some of your hardware needs non-free firmware files to operate. The firmware can be loaded from removable media, such as a USB stick or floppy.
cy: Mae rhan o'r caledwedd angen ffeiliau cadarnwedd nad sy'n rhad i weithio. Gellir llwytho'r cadarnwedd o gyfrwng symudol, fel ddisg hyblyg neu cof bach.
lv: Dažām aparatūras iekārtām ir nepieciešama nebrīvi aparātprogrammatūras faili, lai darbotos. Aparātprogrammatūra var tikt ielādēta no tādiem medijiem kā USB atmiņa vai diskete.

source: The missing firmware files are: ${FILES}
cy: Yn gwirio ffeil: ${FILES}
lv: Trūkstošie aparātprogrammatūras faili: ${FILES}

source: Wireless ESSID for ${iface}:
cy: ESSID Diwifren ar gyfer ${iface}:
lv: Bezvadu tīkla ESSID ierīcei ${iface}:

source: ${iface} is a wireless network interface. Please enter the name (the ESSID) of the wireless network you would like ${iface} to use. If you would like to use any available network, leave this field blank.
cy: Mae ${iface} yn rhyngwyneb rhwydwaith diwifren. Os gwelwch yn dda, rhowch enw (ESSID) y rhwydwaith diwifren hoffech ${iface} ddefnyddio. Os hoffech ddefnyddio unrhyw rhwydwaith sydd ar gael, gadewch y maes hwn yn wag.
lv: ${iface} ir bezvadu tīkla saskarne. Lūdzu, ievadiet tīkla nosaukumu (ESSID), kuram vēlaties ar to pieslēgties. Ja vēlaties izmantot jebkuru pieejamo tīklu, atstājiet šo lauku tukšu.

source: Attempting to find an available wireless network failed.
cy: Methwyd y cais i darganfod rhwydwaith diwifren ar gael.
lv: Neizdevās atrast pieejamu bezvadu tīklu.

source: ${iface} is a wireless network interface. Please enter the name (the ESSID) of the wireless network you would like ${iface} to use. To skip wireless configuration and continue, leave this field blank.
cy: Mae ${iface} yn rhyngwyneb rhwydwaith diwifren. Os gwelwch yn dda, rhowch enw (ESSID) y rhwydwaith diwifren hoffech ${iface} ddefnyddio. I sgipio'r ffurfweddi diwifren a parhau, gadewch y maes hwn yn wag.
lv: ${iface} ir bezvadu tīkla saskarne. Lūdzu, ievadiet tīkla nosaukumu (ESSID), kuram vēlaties ar to pieslēgties. Lai izlaistu bezvadu tīkla konfigurēšanu, atstājiet šo lauku tukšu.

source: WEP key for wireless device ${iface}:
cy: Allwedd WEP ar gyfer y ddyfais diwifren ${iface}:
lv: Bezvadu tīkla WEP atslēga ierīcei ${iface}:

source: If applicable, please enter the WEP security key for the wireless device ${iface}. There are two ways to do this:
cy: Os yw'n briodol, rhowch yr allwedd diogelwch WEP ar gyfer y ddyfais diwifren ${iface} os gwelwch yn dda. Mae dau ffordd i wneud hyn:
lv: Ja tīklā, kam pieslēgsies ${iface}, tiek lietota WEP drošības atslēga, ievadiet to. Ir divi veidi kā to izdarīt:

source: If your WEP key is in the format 'nnnn-nnnn-nn', 'nn:nn:nn:nn:nn:nn:nn:nn', or 'nnnnnnnn', where n is a number, just enter it as it is into this field.
cy: Os mae eich allwedd WEP yn y ffurf 'nnnn-nnn-nn' neu 'nn:nn:nn:nn:nn:nn:nn:nn', lle mae n yn rhif, rhowch e fel y mae yn y maes hwn.
lv: Ja WEP atslēgas formāts ir 'nnnn-nnnn-nn', 'nn:nn:nn:nn:nn:nn:nn:nn', vai 'nnnnnnnn', kur n ir cipars, vienkārši ievadiet to norādītajā laukā.

source: If your WEP key is in the format of a passphrase, prefix it with 's:' (without quotes).
cy: Os mae'ch allwedd WEP mewn ffurf cyfrinair, rhowch 's:' o'i flaen (heb y dyfynnodau).
lv: Ja WEP atslēga ir paroles frāze, pierakstiet tās priekšā 's:' (bez pēdiņām).

source: Of course, if there is no WEP key for your wireless network, leave this field blank.
cy: Wrth gwrs, os nad oes allwedd WEP ar gyfer eich rhwydwaith diwifren, gadwch y maes hwn yn wag.
lv: Protams, ja šim bezvadu tīklam nav WEP atslēgas, atstājiet lauku tukšu.

source: Invalid WEP key
cy: Allwedd WEP annilys
lv: Nederīga WEP atslēga

source: The WEP key '${wepkey}' is invalid. Please refer to the instructions on the next screen carefully on how to enter your WEP key correctly, and try again.
cy: Ma'r allwedd WEP '${wepkey}' yn annilys. Os gwelwch yn dda, darllenwch y cyfarwyddiadau ar y sgrîn nesaf ar sut i fewnosod eich allwedd WEP yn gywir, a cheisiwch eto.
lv: WEP atslēga '${wepkey}' nav derīga. Lūdzu, rūpīgi iepazīstieties ar nākamajā logā redzamo pamācību, kā pareizi ievadīt WEP atslēgu, un tad mēģiniet vēlreiz.

source: Invalid ESSID
cy: ESSID Annilys
lv: Nederīgs ESSID

source: The ESSID "${essid}" is invalid. ESSIDs may only be up to 32 characters, but may contain all kinds of characters.
cy: Mae'r ESSID "${essid}" yn annilys. Rhaid i ESSIDs fod yn 32 nod neu llai, ond gellir cynnwys pob math o nodau.
lv: Jūsu ievadītais ESSID "${essid}" nav derīgs. ESSID var būt dažādu simbolu virkne garumā līdz 32 simboliem.

source: Invalid hostname
cy: Enw gwesteiwr annilys
lv: Nederīgs saimniekdatora nosaukums

source: The name "${hostname}" is invalid.
cy: Mae'r enw "${hostname}" yn annilys.
lv: Nosaukums "${hostname}" nav derīgs.

source: Error
cy: Gwall
lv: Kļūda

source: An error occurred and the network configuration process has been aborted. You may retry it from the installation main menu.
cy: Cafwyd gwall a mae'r broses cyflunio rhwydwaith wedi ei erthylu. Cewch ailgeisio o'r prif ddewislen gosod.
lv: Tīkla konfigurēšanas procesā radās kļūda, tāpēc tas tika pārtraukts. Jūs varat mēģināt konfigurēt tīklu vēlreiz, izmantojot galveno izvēlni.

source: No network interfaces detected
cy: Ni chanfuwyd unrhyw rhyngwyneb rhwydwaith
lv: Nav atrasta neviena tīkla saskarne

source: No network interfaces were found. The installation system was unable to find a network device.
cy: Ni chanfuwyd unrhyw rhyngwynebau rhwydwaith. Methodd y system gosod canfod dyfais rhwydwaith.
lv: Netika atrastas tīkla saskarnes. Instalēšanas sistēmai neizdevās atrast nevienu tīkla ierīci.

source: You may need to load a specific module for your network card, if you have one. For this, go back to the network hardware detection step.
cy: Efallai bydd rhaid i chi lwytho modiwl penodol ar gyfer eith cerdyn rhwydwaith, os oes gennych un. Ar gyfer hyn, dychwelwch i'r cam canfod caledwedd rhwydwaith.
lv: Iespējams, šai tīkla kartei jāielādē kāds papildu modulis. Lai to izdarītu, atgriezieties pie tīkla aparatūras noteikšanas soļa.

source: Kill switch enabled on ${iface}
cy: Swits lladd wedi'i galluogi ar ${iface}
lv: Tīkla kartei ${iface} aktivizēts atslēgšanas slēdzis

source: ${iface} appears to have been disabled by means of a physical "kill switch". If you intend to use this interface, please switch it on before continuing.
cy: Mae'n debyg bod ${iface} wedi'i anablu yn gorfforol gan "kill switch".Os ydych am ddefnyddio'r rhyngwyneb yma, rhowch ymlaen cyn parhau.
lv: Šķiet, ka jūsu tīkla karte ${iface} ir fiziski deaktivizēta, izmantojot atslēgšanas slēdzi. Ja gribat šo karti izmantot, lūdzu, ieslēdziet to, pirms turpināt.

source: Infrastructure (Managed) network
cy: Rhwydwaith is-strwythur (Rheoledig)
lv: Infrastruktūras (pārvaldīts) tīkls

source: Ad-hoc network (Peer to peer)
cy: Rhwydwaith ad-hoc (Cydradd-at-Gydradd)
lv: Ad-hoc (vienādranga) tīkls

source: Wireless network configuration
cy: Cyfluniad rhwydwaith diwifren
lv: Bezvadu tīkla konfigurēšana

source: Searching for wireless access points...
cy: Yn chwilio am bwyntiau mynediad diwifren ...
lv: Meklē bezvadu tīkla piekļuves punktus...

source: <none>
cy: <dim>
lv: <nav atrasts>

source: Wireless ethernet (802.11x)
cy: Ethernet diwifren (802.11x)
lv: Bezvadu tīkls (802.11x)

source: wireless
cy: diwifren
lv: bezvadu

source: USB net
cy: Rhwydwaith USB
lv: USB tīkls

source: Serial-line IP
cy: IP Llinell Cyfresol
lv: Seriālās līnijas IP

source: Parallel-port IP
cy: IP Porth Paralel
lv: Paralēlās pieslēgvietas IP

source: Point-to-Point Protocol
cy: Protocol Pwynt-i-Bwynt
lv: Divpunktu protokols (PPP)

source: ISDN Point-to-Point Protocol
cy: Protocol Pwynt-i-Bwynt ISDN
lv: ISDN divpunktu protokols (PPP)

source: Channel-to-channel
cy: Sianel-i-sianel
lv: Divkanālu

source: Real channel-to-channel
cy: Sianel-i-sianel go iawn
lv: Reāls divkanālu

source: Inter-user communication vehicle
cy: Cerbyd cyfathrebu rhyng-ddefnyddiwr
lv: Starplietotāju komunikācijas līdzeklis (IUCV)

source: Unknown interface
cy: Rhyngwyneb anhysbys
lv: Nezināma saskarne

source: No DHCP client found
cy: Ni chanfuwyd cleient DHCP
lv: DHCP klients nav atrasts

source: No DHCP client was found. This package requires pump or dhcp-client.
cy: Ni chanfuwyd cleient DHCP. Mae'r pecyn yma angen pwmp neu client-dhcp.
lv: DHCP klients netika atrasts. Šai pakotnei nepieciešama pump vai dhcp-client pakotne.

source: The DHCP configuration process has been aborted.
cy: Mae'r broses cyfnewidiol DHCP wedi'i erthylu.
lv: DHCP konfigurēšanas process tika pārtraukts.

source: Continue without a default route?
cy: Parhau heb lwybr rhagosod?
lv: Turpināt bez noklusētā maršruta?

source: The network autoconfiguration was successful. However, no default route was set: the system does not know how to communicate with hosts on the Internet. This will make it impossible to continue with the installation unless you have the first installation CD-ROM, a 'Netinst' CD-ROM, or packages available on the local network.
cy: Roedd y awtogyfluniad rhwydwaith yn llwyddiannus. Fodd bynnag, ni chafodd llwybr rhagosod ei osod: nid yw'r system yn gwybod sut i gyfathrebu a gwesteion ar y Rhyngrwyd. Mi fydd hyn yn ei wneud hi'n amhosib i barhau gyda'r gosodiad os nad oes gennych y CD-ROM gosod cyntaf, CD-ROM 'Netinst', neu becynnau ar gael ar y rhwydwaith leol.
lv: Automātiskā tīkla konfigurēšana pabeigta sekmīgi, taču noklusētais maršruts nav iestatīts. Tādējādi sistēma nezina, kā komunicēt ar citiem datoriem internetā. Instalēšanu nebūs iespējams turpināt, ja vien jums nav pirmā instalēšanas diska, 'Netinst' diska, vai arī pakotņu spoguļservera lokālajā tīklā.

source: If you are unsure, you should not continue without a default route: contact your local network administrator about this problem.
cy: Os ydych yn ansicr, ni ddylech barhau heb lwybr rhagosod: cysylltwch a gweinydd eich rhwydwaith leol ynghylch y broblem hon.
lv: Ja šaubāties, jums nevajadzētu turpināt bez noklusētā maršruta. Lai atrisinātu šo problēmu, sazinieties ar sava tīkla administratoru.

source: Malformed IP address
cy: Cyfieiriad IP annilys
lv: Nekorektas formas IP adrese

source: The IP address you provided is malformed. It should be in the form x.x.x.x where each 'x' is no larger than 255. Please try again.
cy: Mae'r cyfeiriad IP a roddwyd yn annilys. Dylai fod yn y ffurf x.x.x.x lle mae pob 'x' yn rhif nad yw'n fwy na 255. Ceisiwch eto os gwelwch yn dda.
lv: Jūsu ievadītā IP adrese nav korekta. Tai jābūt formā x.x.x.x, kur katrs x ir skaitlis no 0 līdz 255. Lūdzu, mēģiniet vēlreiz.

source: Point-to-point address:
cy: Cyfeiriad pwynt-i-bwynt:
lv: Divpunktu adrese:

source: The point-to-point address is used to determine the other endpoint of the point to point network. Consult your network administrator if you do not know the value. The point-to-point address should be entered as four numbers separated by periods.
cy: Defnyddir y cyfeiriad pwynt-i-bwynt er mwyn dehongli pwynt-ddiwedd arall y rhwydwaith pwynt-i-bwynt. Gofynnwch i weinyddwr eich rhwydwaith os nad ydych yn sicr beth yw'r ateb cywir. Dylid rhoi'r cyfeiriad pwynt-i-bwynt fel pedwar rhif wedi eu gwahannu gan atalnodau.
lv: Divpunktu adrese tiek izmantota, lai noteiktu otru divpunktu tīkla mezglu. Ja nezināt pareizo adresi, sazinieties ar savu tīkla administratoru. Divpunktu adresei jāsastāv no četriem skaitļiem, kurus vienu no otra atdala punkti.

source: Unreachable gateway
cy: Mynedfa anghyraeddadwy
lv: Vārteja nav sasniedzama

source: The gateway address you entered is unreachable.
cy: Mae'r cyfeiriad mynedfa a roddwyd yn anghyraeddadwy.
lv: Jūsu ievadītā vārtejas adrese nav sasniedzama.

source: You may have made an error entering your IP address, netmask and/or gateway.
cy: Efallai gwanethoch gamgymeriad wrth roi eith cyfeiriad IP, masg rhwydwaith, neu fynedfa.
lv: Iespējams, jūs kļūdījāties, ievadot savu IP adresi, tīkla masku vai vārteju.

source: Debian version to install:
cy: Y cnewyllyn i'w osod:
lv: Pieejamās Debian versijas:

source: Debian comes in several flavors. Stable is well-tested and rarely changes. Unstable is untested and frequently changing. Testing is a middle ground, that receives many of the new versions from unstable if they are not too buggy.
cy: Mae Debian yn dod mewn sawl blas. Mae sefydlog wedi ei brofi'n dda ac yn newid yn anaml. Mae ansefydlog heb ei brofi ac yn newid yn aml. Mae profi yn dir canolog, sydd yn derbyn llawer o fersiynau newydd o ansefydlog os nad ydynt yn rhy ddiffygiol.
lv: Debian ir pieejams dažādās versijās. Stabīlā versija ir ļoti labi notestēta un tiek mainīta ļoti reti. Nestabīlā versija ir praktiski netestēta un bieži mainās. Testēšanas versija ir vidējais starp šīm divām versijām, tajā tiek pievienotas jaunas pakas no nestabīlās verijas, ja tajās testēsanas gaita netiek atrastas nopietnas kļūmes.

source: Only flavors available on the selected mirror are listed.
lv: Tikai izvēlētajā spoguļserverī pieejamās versijas ir attēlotas sarakstā.

source: Go back and try a different mirror?
lv: Atgriezties atpakaļ un mēģināt citu spoguļserveri?

source: The specified (default) Debian version (${RELEASE}) is not available from the selected mirror. It is possible to continue and select a different release for your installation, but normally you should go back and select a different mirror that does support the correct version.
lv: Pēc noklusējuma (izvēlētā) Debian versija (${RELEASE}) nav pieejama no izvēlētā spoguļservera. Ir iespējams turpināt un izvēlēties citu versiju, bet parasti vajadzētu atgriezties un izvēlēties citu spoguļserveri, kas ļautu uzstādīt pareizo versiju.

source: Bad archive mirror
cy: Drych archif gwael
lv: Nederīgs arhīva spoguļserveris

source: An error has been detected while trying to use the specified Debian archive mirror.
lv: Kļūda, mēģinot izmantot uzdoto Debian arhīva spoguļserveri

source: Possible reasons for the error are: incorrect mirror specified; mirror is not available (possibly due to an unreliable network connection); mirror is broken (for example because an invalid Release file was found); mirror does not support the correct Debian version.
lv: Iespējamie kļūmes iemesli: nepareizi uzdots spoguļserveris; spoguļserveris nav pieejams (iespējams dēļ nestabila Interneta savienojuma); spoguļserveris ir bojāts (piemēram satur nepareizu Release failu) vai arī spoguļserveris nesatur pareizo Debian versiju.

source: Additional details may be available in /var/log/syslog or on virtual console 4.
lv: Papildus informāciju var atrast /var/log/syslog failā vai uz ceturtās virtuālās konsoles.

source: Please check the specified mirror or try a different one.
lv: Lūdzu pārbaudiet norādīto spoguļserveri, vai izvēlieties citu

source: oldstable
lv: vecā stabīlā

source: stable
cy: sefydlog
lv: stabīlā

source: testing
cy: profi
lv: testēšanas

source: unstable
cy: ansefydlog
lv: nestabīlā

source: Debian archive mirror directory:
cy: Cyfeiriadur drych archif Debian:
lv: Debian arhīva spoguļa mape:

source: Please enter the directory in which the mirror of the Debian archive is located.
cy: Os gwelwch yn dda, mewnosodwch y cyfeiriadur mae'r drych archif Debian wedi ei leoli ynddi.
lv: Lūdzu ievadiet mapi, kurā atrodas Debian spogulis.

source: FTP proxy information (blank for none):
cy: Manylion dirprwy FTP (gwag os does dim):
lv: FTP starpniekservera informācija (atstāt tukšu, ja tāda nav):

source: If you need to use a FTP proxy to access the outside world, enter the proxy information here. Otherwise, leave this blank.
cy: Os ydych angen defnyddio dirprwy FTP er mwyn cyrchu'r byd allanol, rhowch y manylion dirprwy yma. Os na, gadewch hwn yn wag.
lv: Ja jums jālieto FTP starpniekserveris, lai piekļūtu ārpasaulei, ievadiet šeit informāciju par to. Pretējā gadījumā atstājiet šo lauku tukšu.

source: US[ Default value for ftp]
cy: GB
lv: LV

source: Protocol for file downloads:
cy: Y protocol ar gyfer lawrlwytho ffeiliau:
lv: Protokols failu lejupielādēšanai:

source: Please select the protocol to be used for downloading files. If unsure, select "http"; it is less prone to problems involving firewalls.
cy: Os gwelwch yn dda, dewiswch y protocol lawrlwytho ffeiliau. Os ydych yn ansicr, dewiswch "http" gan ei fod yn cael llai o broblemau gyda muriau tân.
lv: Lūdzu, izvēlieties lejupielādes protokolu. Ja neesat droši, izvēlieties "http" - šim protokolam ir mazāk problēmu ar ugunsmūriem.

source: Retry
cy: Ailgeisio
lv: Mēģināt vēlreiz

source: Change mirror
cy: Newid drych
lv: Nomainīt spoguļserveri

source: Downloading a file failed:
cy: Lawrlwytho ffeil wedi methu:
lv: Faila lejupielāde neizdevās:

source: The installer failed to download a file from the mirror. This may be a problem with your network, or with the mirror. You can choose to retry the download, select a different mirror, or cancel and choose another installation method.
cy: Methodd y gosodwr lawrlwytho ffeil o'r drych. Fe all hyn fod oherwydd problem gyda'ch rhwydwaith, neu gyda'r drych. Gallwch ddewis i ailgeisio'r lawrlwythiad, ddewis drych arall, neu ddiddymu a dewis dull gosod arall.
lv: Instalatoram neizdevās lejupielādēt failu no spoguļservera. Tā varētu būt tīkla vai spoguļservera problēma. Varat mēģināt vēlreiz, izvēlēties citu spoguļserveri vai atcelt lejupielādi un izvēlieties citu instalēšanas metodi.

source: Failed to copy file from CD-ROM. Retry?
cy: Methwyd copïo ffeil o'r CDROM. Ailgychwyn?
lv: Nokopēt failu no CD-ROM neizdevās. Mēģināt vēlreiz?

source: There was a problem reading data from the CD-ROM. Please make sure it is in the drive. If retrying does not work, you should check the integrity of your CD-ROM.
cy: Roedd problem wrth ddarllen data o'r CDROM. Os gwelwch yn dda, sicrhewch ei fod yn y gyrriant. Os nad yw ailgeisio yn gweithio, dylwch wirio cywirdeb eich CDROM.
lv: Kļūme, lasot datus no CD-ROM - pārliecinieties, ka disks ir dzinī. Ja arī atkārtots mēģinājums nolasīt datus nav sekmīgs, pārbaudiet CD-ROM integritāti.

source: Scanning removable media
cy: Sganio cyfrwng symudol
lv: Pārbaudu mēdiju

source: Cannot read removable media, or no drivers found.
cy: Methu darllen cyfrwng symudol, neu ni chanfuwyd unrhyw gyrriannau.
lv: Neizdevās nolasīt datus no mēdija, vai arī dziņi nav atrasti

source: There was a problem reading data from the removable media. Please make sure that the right media is present. If you continue to have trouble, your removable media might be bad.
cy: Roedd problem wrth ddarllen data o'r gyfrwng symudol. Os gwelwch yn dda, sicrhewch fod y ddisg cywir yn y gyrriant. Os parhewch i gael trafferth, efallai bod nam ar y cyfrwng symudol.
lv: Notika kļūme mēginot nolasīt datus no mēdija. Lūdzu pārliecinieties vai ir ievietots pareizais mēdijs. Iespejams, ka šīs mēdijs ir bojāts.

source: Device in use
cy: Dyfais mewn defnydd:
lv: Ierīce tiek izmantota

source: No modifications can be made to the device ${DEVICE} for the following reasons:
cy: Ni ellir gwneud newidiadau i'r ddyfais ${DEVICE} am y rhesymau canlynol
lv: Ierīcē ${DEVICE} nav iespējams veikt izmaiņas, jo:

source: Partition in use
cy: Rhaniad mewn defnydd:
lv: Sadaļa tiek izmantota

source: No modifications can be made to the partition #${PARTITION} of device ${DEVICE} for the following reasons:
cy: Ni ellir gwneud newidiadau i'r rhaniad #${PARTITION} o ddyfais ${DEVICE} am y rhesymau canlynol:
lv: Ierīces ${DEVICE} sadaļā #${PARTITION} nav iespējams veikt izmaiņas, jo:

source: Continue with the installation?
cy: Parhau gyda'r gosodiad?
lv: Turpināt instalēšanu?

source: No partition table changes and no creation of file systems have been planned.
cy: Nid oes newidiadau i'r tabl rhaniadau na chread o systemau ffeil wedi eu cynllunio.
lv: Nav plānotas ne izmaiņas sadaļu tabulā, ne jaunu failu sistēmu izveide.

source: If you plan on using already created file systems, be aware that existing files may prevent the successful installation of the base system.
cy: Os ydych yn bwriadu defnyddio systemau ffeil sydd wedi eu creu eisioes, sylwer gall ffeiliau sy'n bodoli eisioes rhwystro sefydliad llwyddiannus y system sail.
lv: Ja plānojat izmantot esošās failu sistēmas, atcerieties, ka esošie faili var traucēt sekmīgai bāzes sistēmas instalēšanai.

source: The following partitions are going to be formatted:
cy: Caiff y rhaniadau canlynol eu fformadu:
lv: Tiks formatētas šādas sadaļas:

source: partition #${PARTITION} of ${DEVICE} as ${TYPE}
cy: rhaniad #${PARTITION} o ${DEVICE} fel ${TYPE}
lv: sadaļa #${PARTITION} uz ${DEVICE} kā ${TYPE}

source: ${DEVICE} as ${TYPE}
cy: ${DEVICE} fel ${TYPE}
lv: ${DEVICE} kā ${TYPE}

source: The partition tables of the following devices are changed:
cy: Mae tablau rhaniad y dyfeisiau canlynol wedi newid:
lv: Šādu ierīču sadaļu tabulas ir izmainītas:

source: What to do with this device:
cy: Beth i'w wneud gyda'r ddyfais yma:
lv: Ko darīt ar šo ierīci:

source: How to use this free space:
cy: Sut i ddefnyddio'r gofod rhydd hwn:
lv: Kā izmantot šo brīvo vietu:

source: Partition settings:
cy: Gosodiadau rhaniad:
lv: Sadaļas iestatījumi:

source: You are editing partition #${PARTITION} of ${DEVICE}. ${OTHERINFO} ${DESTROYED}
cy: Rydych chi'n golygu rhaniad #${PARTITION} o ${DEVICE} . ${OTHERINFO} ${DESTROYED}
lv: Jūs labojat ${DEVICE} sadaļu #${PARTITION}. ${OTHERINFO} ${DESTROYED}

source: This partition is formatted with the ${FILESYSTEM}.
cy: Mae'r rhaniad hwn wedi ei fformadu gyda'r ${FILESYSTEM}.
lv: Šī sadaļa ir formatēta ${FILESYSTEM} failu sistēmas formātā.

source: No existing file system was detected in this partition.
cy: Ni chafodd system ffeil sy'n bodoli ei ganfod yn y rhaniad hwn.
lv: Šajā sadaļā failu sistēma nav atrasta.

source: All data in it WILL BE DESTROYED!
cy: Caiff yr holl ddata ynddo EI DDINISTRIO!
lv: Visi dati tajā TIKS IZNĪCINĀTI!

source: The partition starts from ${FROMCHS} and ends at ${TOCHS}.
cy: Mae'r rhaniad yn dechrau o ${FROMCHS} ac yn gorffen ar ${TOCHS}.
lv: Sadaļa sākas ${FROMCHS} un beidzas ${TOCHS}.

source: The free space starts from ${FROMCHS} and ends at ${TOCHS}.
cy: Mae'r gofod rhydd yn dechrau o ${FROMCHS} ac yn gorffen yn ${TOCHS}.
lv: Brīvā diska vieta sākas ${FROMCHS} un beidzas ${TOCHS}.

source: Show Cylinder/Head/Sector information
cy: Dangos manylion Silindr/Pen/Sector
lv: Parādīt informāciju par cilindriem/galviņām/sektoriem.

source: Done setting up the partition
cy: Gorffenwyd paratoi'r rhaniad
lv: Sadaļa sagatavota

source: Dump partition info in %s
cy: Tomenu manylion rhaniad yn %s
lv: Saglabāt sadaļu informāciju %s

source: Failed to partition the selected disk
cy: Methwyd rhaniadu'r ddisg a ddewiswyd
lv: Neizdevās sadalīt izvēlēto disku
