Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel2/*.po
Languages: cy, lv

source: Installation step failed
cy: Cam gosod wedi methu.
lv: Instalēšanas soli neizdevās izpildīt

source: An installation step failed. You can try to run the failing item again from the menu, or skip it and choose something else. The failing step is: ${ITEM}
cy: Cam gosod wedi methu. Gallwch geisio rhedeg yr eitem sy'n methu eto o'r ddewislen, neu ei hepgor a dewis rhywbeth arall. Y cam sy'n methu yw: ${ITEM}
lv: Neizdevās izpildīt instalēšanas soli. Jūs varat mēģināt atkārtot to, izmantojot izvēlni, vai arī izlaist šo soli un izvēlēties ko citu. Solis, ko neizdevās izpildīt, ir: ${ITEM}

source: Choose an installation step:
cy: Dewiswch cam gosod:
lv: Izvēlieties instalēšanas soli:

source: This installation step depends on one or more other steps that have not yet been performed.
cy: Mae'r cam gosod yma yn ddibynnu ar gam neu camau arall nad ydynt wedi eu cyflawni eto.
lv: Šī instalēšanas soļa izpilde ir atkarīga no citu instalēšanas soļu izpildes, kas vēl nav veikti.

source: Interactive shell
cy: Cragen rhyngweithiol
lv: Interaktīvā čaula

source: After this message, you will be running "ash", a Bourne-shell clone.
cy: Ar ôl y neges hon, fe fyddwch yn rhedeg "ash", copi o chragen-Bourne.
lv: Pēc šī paziņojuma jūsu rīcībā būs "ash", Bourne čaulas (sh) klons.

source: The root file system is a RAM disk. The hard disk file systems are mounted on "/target". The editor available to you is nano. It's very small and easy to figure out. To get an idea of what Unix utilities are available to you, use the "help" command.
cy: Disg RAM yw'r system ffeil gwraidd. Mae systemau ffeil y ddisg caled wedi eu gosod ar "/target". Nano yw'r golygydd sydd ar gael. Mae'n fach iawn ac yn hawdd i'w ddefnyddio. Er mwyn cael syniad o ba gwasanaethau Unix sydd ar gael, defnyddiwch y gorchymyn "help".
lv: Saknes failu sistēma ir RAM disks. Cieto disku failu sistēmas ir piemontētas pie "/target". Jums pieejamais teksta redaktors ir nano; tas ir ļoti mazs un viegli apgūstams. Lai noskaidrotu, kādas vēl Unix utilītas ir pieejamas, lietojiet komandu "help".

source: Use the "exit" command to return to the installation menu.
cy: Defnyddiwch y gorchymyn "exit" i ddychwelyd i'r ddewislen gosod.
lv: Lietojiet komandu "exit", lai atgrieztos pie instalēšanas izvēlnes.

source: Exit installer
lv: Iziet no instalatora

source: Are you sure you want to exit now?
cy: A ydych yn siwr eich bod am adael nawr?
lv: Vai tiešām vēlaties iziet?

source: If you have not finished the install, your system may be left in an unusable state.
cy: Os nad ydych wedi gorffen y gosodiad, gall eich system gael ei adael mewn cyflwr annefnyddiol.
lv: Ja vēl neesat pabeiguši instalēšanu, jūsu sistēma var palikt nelietojamā stāvoklī.

source: Terminal plugin not available
cy: Nid yw'r terfynell blygio ar gael
lv: Komandrindas spraudnis nav pieejams

source: This build of the debian-installer requires the terminal plugin in order to display a shell. Unfortunately, this plugin is currently unavailable.
cy: Mae'r fersiwn hwn o'r gosodwr-debian angen y derfynell blygio er mwynarddangos cragen. Yn anffodus, nid yw'r blygio hyn ar gael ar hyn o bryd.
lv: Šai debian-installer versijai ir nepieciešams komandrindas spraudnis, lai attēlotu komandrindu. Diemžēl, tas nav pieejams.

source: It should be available after reaching the "Loading additional components" installation step.
cy: Dylai fod ar gael ar ol cyrraedd y cam gosod.
lv: Tas varētu kļūt pieejams pēc papildus komponenšu ielādes uzstādīšanas soļa.

source: Alternatively, you can open a shell by pressing Ctrl+Alt+F2. Use Alt+F5 to get back to the installer.
cy: Neu, gallwch agor cragen drwy wasgu Ctrl+Alt+F2. Defnyddiwch Alt+F5i ddychwelyd i'r gosodwr.
lv: Tāpat jūs varat piekļūt komandrindai nospiežot Ctrl+Alt+F2. Lietojiet taustiņu kombināciju Alt+F5, lai atgrieztos instalēšanas procesā.

source: Installer components to load:
cy: Cydrannau gosodydd i'w llwytho:
lv: Ielādējamās instalatora komponentes:

source: All components of the installer needed to complete the install will be loaded automatically and are not listed here. Some other (optional) installer components are shown below. They are probably not necessary, but may be interesting to some users.
cy: Bydd yr holl cydrannau o'r gosodwr sydd eu hangen i gwblhau'r gosodiad yn caeleu llwytho'n awtomatig a ni rhestrir nhw yma. Gweler isod cydrannau gosodwreraill (dewisol). Efallai nad ydynt yn angenrheidiol, ond efallai byddanto diddordeb i rhai defnyddwyr.
lv: Instalēšanas procesa pabeigšanai nepieciešamās instalatora komponentes tiks automātiski ielādētas un nav šeit uzrādītas. Citas (neobligātas) instalatora komponentes ir redzamas zemāk. Tās, visticamāk, nav nepieciešamas, bet varētu būt dažiem lietotājiem interesantas.

source: Note that if you select a component that requires others, those components will also be loaded.
cy: Sylwch os ddewiswch cydran sy'n dibynnu ar eraill, caiff y cydrannau hynny eu llwytho hefyd.
lv: Ņemiet vērā: ja jūs izvēlēsities komponenti, kurai ir nepieciešamas citas, tās arī tiks automātiski ielādētas.

source: To save memory, only components that are certainly needed for an install are selected by default. The other installer components are not all necessary for a basic install, but you may need some of them, especially certain kernel modules, so look through the list carefully and select the components you need.
cy: Er mwyn arbed cof, ond cydrannau sydd yn angenrheidiol ar gyfer gosodiad sy'n cael eu llwytho'n rhagosodedig. Nid yw'r holl cydrannau gosodwr a restrir yn angenrheidiol ar gyfer gosodiad sylfaenol, ond efallai bydd angen rhai ohonynt arnoch, yn enwedig rhai modylau cnewyllyn, felly edrychwch drwy'r rhestr yn ofalus a dewiswch y cydrannau byddwch eu angen.
lv: Lai taupītu atmiņu, pēc noklusējuma ir izvēlētas tikai tās komponentes, kas noteikti nepieciešamas instalēšanai. Pārējās instalatora komponentes pamata instalācijā nav nepieciešamas, taču jums kādas no tām varētu būt vajadzīgas. It īpaši tas attiecas uz dažiem kodola moduļiem. Rūpīgi pārskatiet komponenšu sarakstu un izvēlieties sev vajadzīgās.

source: Failed to load installer component
cy: Llwytho cydran gosodwr wedi methu
lv: Neizdevās ielādēt instalatora komponenti

source: Loading ${PACKAGE} failed for unknown reasons. Aborting.
cy: Llwytho ${PACKAGE} wedi methu am resymau anhysbys. Yn erthylu.
lv: Moduļa ${PACKAGE} ielāde nezināmu iemeslu dēļ nav izdevusies. Pārtrauc darbu.

source: Continue the install without loading kernel modules?
cy: Parhau gyda'r gosod heb lwytho modylau cnewyllyn?
lv: Turpināt instalēšanu, neielādējot kodola moduļus?

source: No kernel modules were found. This probably is due to a mismatch between the kernel used by this version of the installer and the kernel version available in the archive.
cy: Ni chanfuwyd unrhyw fodylau cnewyllyn. Mae'n debyg fod hyn oherwydd nad yw fersiwn y cnewyllyn a ddefnyddir gan y fersiwn hyn o'r gosodwr yn cyfateb a fersiwn y cnewyllyn sydd yn yr archif.
lv: Kodola moduļi nav atrasti. Iespējamais iemesls ir instalatora izmantotās un arhīvā pieejamās kodola versiju nesakritība.

source: If you're installing from a mirror, you can work around this problem by choosing to install a different version of Debian. The install will probably fail to work if you continue without kernel modules.
cy: Os ydych chi'n gosod o ddrych, gallwch weithio o gwmpas y broblem hon gan ddewis i osod fersiwn gwahanol o Debian. Mae'n debygol bydd y sefydliad yn methu gweithio os ydych chi'n parhau heb fodylau cnewyllyn.
lv: Ja instalējat no spoguļservera, jūs šo problēmu varat apiet, izvēloties instalēt citu Debian versiju. Ja turpināsiet bez kodola moduļiem, instalēšana visdrīzāk nebūs sekmīga.

source: System locale:
lv: Sistēmas lokalizācija:

source: Select the default locale for the installed system.
lv: Lūdzu, ievadiet šīs sistēmas lokalizāciju

source: Additional locales:
lv: Papildus lokalizācijas

source: Based on your previous choices, the default locale currently selected for the installed system is '${LOCALE}'.
lv: Balstoties uz iepriekš izdarītajām izvēlēm, šobrīd lokalizācija instalējamajā sistēmā ir '${LOCALE}'.

source: If you wish to use a different default or to also have other locales available, you may choose additional locales to be installed. If you are unsure it is best to just use the selected default.
lv: Ja jūs vēlaties izvēlēties citu noklusējuma vērtību vai lai būtu pieejamas arī citas lokalizācijas, jūs varat izvēlēties uzstādīt papildus lokalizācijas. Ja jūs neesat pārliecināti, vienkārši apstipriniet jau iezīmēto izvēli.

source: locale
lv: lokalizācija

source: A locale determines character encoding and contains information on for example currency, date format and alphabetical sort order.
lv: Lokalizācija nosaka burtu kodējumu un satur papildus informāciju, piemēram par izmantoto valūtu, datuma formātu un to kādā secībā burti atrodas alfabētā.

source: Type of keyboard:
cy: Math o bysellfwrdd:
lv: Klaviatūras tips:

source: Please choose the type of keyboard to configure.
cy: Dewiswch y math o ddyfais bysellfwrdd i'w cyfnewidio, os gwelwch yn dda.
lv: Lūdzu izvēlieties konfigurējamās klaviatūras tipu.

source: No keyboard to configure
cy: Dim bysellfwrdd i'w gyfnewidio.
lv: Klaviatūra nav atrasta - nekonfigurējam

source: Do not configure keyboard; keep kernel keymap
cy: Peidio cyfnewidio bysellfwrdd; cadw allweddell cnewyllyn
lv: Lietot kodola taustiņkarti (keymap), nekonfigurēt to

source: PC-style (AT or PS-2 connector) keyboard
cy: Bysellfwrdd steil-PC (AT neu cyswllt PS-2)
lv: PC stila (AT vai PS-2 savienojuma) klaviatūra

source: Atari keyboard
cy: Bysellfwrdd Atari
lv: Atari klaviatūra

source: Amiga keyboard
cy: Bysellfwrdd Amiga
lv: Amiga klaviatūra

source: Acorn keyboard
cy: Bysellfwrdd Acorn
lv: Acorn klaviatūra

source: Mac keyboard
cy: Bysellfwrdd Mac
lv: Mac klaviatūra

source: Sun keyboard
cy: Bysellfwrdd Sun
lv: Sun klaviatūra

source: USB keyboard
cy: Bysellfwrdd USB
lv: USB klaviatūra

source: DEC keyboard
cy: Bysellfwrdd DEC
lv: DEC klaviatūra

source: HP HIL keyboard
cy: Bysellfwrdd HP HIL
lv: HP HIL klaviatūra

source: Keyboard model:
lv: Klaviatūras modelis:

source: Please select the model of the keyboard of this machine.
lv: Lūdzu izvēlieties šī datora klaviatūras modeli.

source: No temporary switch
lv: Bez īslaicīgā slēdža

source: Both Logo keys
lv: Abas Logo pogas

source: Method for temporarily toggling between national and Latin input:
lv: Īslaicīgi pārslēgt start nacionālo un Latīņu režīmu:

source: When the keyboard is in national mode and one wants to type only a few Latin letters, it might be more appropriate to switch temporarily to Latin mode. The keyboard remains in that mode as long as the chosen key is kept pressed. That key may also be used to input national letters when the keyboard is in Latin mode.
lv: Kad klaviatūra ir nacionālajā režīmā un ir nepieciešams uzrakstīt dažus burtus Latīņu režīmā, var izmantot īslaicīgo slēdzi. Klaviatūra darbojas Latīņu režīmā tikai tik ilgi, kamēr slēdža poga tiek turēta nospiestā stāvoklī. Šī funkcija darbojas arī otrādāk - īslaicīgi pārslēdzot izklājumu uz nacionālo režīmu no Latīņu režīma.

source: You can disable this feature by choosing "No temporary switch".
lv: Šo funkciju var izslēgt izvēloties "Bez īslaicīgā slēdža ".

source: The default for the keyboard layout
lv: Klaviatūras izklājuma noklusējuma vērtība

source: No AltGr key
lv: Bez AltGr pogas

source: Keypad Enter key
lv: Ciparu klaviatūras Enter

source: Both Alt keys
lv: Abi Alt

source: Key to function as AltGr:
lv: Poga, kas kalpos kā AltGr:

source: With some keyboard layouts, AltGr is a modifier key used to input some characters, primarily ones that are unusual for the language of the keyboard layout, such as foreign currency symbols and accented letters. These are often printed as an extra symbol on keys.
lv: Dažos klaviatūras izklājumos AltGr tiek lietota kā modifikācijas poga, lai ievadītu dažus burtus, parasti tie neparastie burti un simboli, kā piemēram ārzemju valūtu simboli un akcentēties burti (piemēram, latviešu burti ar garumzīmēm). Bieži tie tiek attēloti uz klaviatūras kā papildus simboli uz pogām.

source: No compose key
lv: Bez compose pogas

source: Compose key:
lv: Compose poga:

source: The Compose key (known also as Multi_key) causes the computer to interpret the next few keystrokes as a combination in order to produce a character not found on the keyboard.
lv: Compose poga (arī pazī

source: On the text console the Compose key does not work in Unicode mode. If not in Unicode mode, regardless of what you choose here, you can always also use the Control+period combination as a Compose key.
lv: Teksta konsolē Compose poga nestādā Unicode režīmā. Ārpus Unicode režīma (neatkarīgi no šeit izvēlētā režīma) vienmēr var izmantot Control+punkts kombināciju kā Compose pogu.

source: Load CD-ROM drivers from removable media?
cy: Llwytho gyrryddion CD-ROM o gyfrwng symudol?
lv: Ielādēt CD-ROM dziņus no mēdija?

source: No common CD-ROM drive was detected.
cy: Ni chanfuwyd gyrriant CD-ROM cyffredin.
lv: Parastā tipa CD-ROM dzinis nav noteikts.

source: You may need to load additional CD-ROM drivers from removable media, such as a driver floppy. If you have such media available now, insert it, and continue. Otherwise, you will be given the option to manually select CD-ROM modules.
cy: Efallai bydd angen i chi lwytho gyrryddion CD-ROM ychwanegol o gyfrwng symudol fel gyrrwr hyblyg. Os oes gennych y fath ddisg nawr, rhowch yn y gyrriant a pharhau. Fel arall, cewch y cyfle i ddewis modylau CD-ROM â llaw.
lv: Iespējams, ka ir nepieciešams ielādēt papildus moduļus, lai piekļūtu CD-ROM ierīcei. Ja jums ir sagatavota atbilstošs medijs, tad ievietojiet to un turpiniet. Citādāk, jums tiks dota iespēja manuāli izvēlēties CD-ROM moduļus.

source: Manually select a CD-ROM module and device?
cy: Dewis modiwl a dyfais CD-ROM â llaw?
lv: Izvēlēties CD-ROM moduli un ierīci manuāli?

source: Your CD-ROM drive may be an old Mitsumi or another non-IDE, non-SCSI CD-ROM drive. In that case you should choose which module to load and the device to use. If you don't know which module and device are needed, look for some documentation or try a network installation instead of a CD-ROM installation.
cy: Efallai fod eich CD-ROM yn un Mitsumi hen, neu un arall nid yw'n IDE na SCSI. Yn yr achos hynny, dewiswch pa fodiwl i lwytho a'r dyfais i ddefnyddio. Os nad ydych chi'n gwybod pa fodiwl a dyfais sydd angen, chwiliwch am ddogfeniaeth neu ceisiwch gosodiad rhywdwaith yn hytrach na gosodiad CD-ROM.
lv: Iespējams, ka CD-ROM dzinis ir vecs Mitsumi vai kāds cits ne-IDE un ne-SCSI CD-ROM dzinis. Šajā gadījumā jums vajadzētu izvēlēties, kādu moduli ielādēt un kādu ierīces failu lietot. Ja jūs šos parametrus nezināt, meklējiet tos dokumentācijā vai mēģiniet instalēt sistēmu no tīkla.

source: Retry mounting the CD-ROM?
cy: Ceisio gosod y CD-ROM eto?
lv: Mēģināt piemontēt CD-ROM vēlreiz?

source: Your installation CD-ROM couldn't be mounted. This probably means that the CD-ROM was not in the drive. If so you can insert it and try again.
cy: Ni fedrwyd gosod eich CD-ROM gosod. Mwy na thebyg golyga hyn nad oedd y CD-ROM yn y gyrriant. Os felly, gallwch ei fewnosod a cheisio eto.
lv: Nevarēja piemontēt jūsu instalēšanas CD-ROM. Tas nozīmē, ka visticamāk tas neatrodas dzinī. Ja tā, ielieciet to un mēģiniet vēlreiz.

source: Module needed for accessing the CD-ROM:
cy: Y modiwl angenrheidiol ar gyfer cyrchu'r CD-ROM:
lv: Modulis, kas nepieciešams, lai piekļūtu CD-ROM:

source: The automatic detection didn't find a CD-ROM drive. You can try to load a specific module if you have an unusual CD-ROM drive (that is neither IDE nor SCSI).
cy: Ni chanfyddodd y canfod awtomatig yrriant CD-ROM. Gallwch geisio llwytho modiwl penodol os oes gennych yrriant CD-ROM anarferol (nid yw'n un IDE na SCSI).
lv: Automātiskais noteikšanas process nespēja atrast jūsu CD-ROM dzini. Jūs varat mēģināt ielādēt specifisku moduli, ja dzinis ir netipisks (ne IDE, ne SCSI ierīce).

source: Device file for accessing the CD-ROM:
cy: Y ffeil dyfais ar gyfer cyrchu'r CD-ROM:
lv: CD-ROM ierīces fails:

source: In order to access your CD-ROM drive, please enter the device file that should be used. Non-standard CD-ROM drives use non-standard device files (such as /dev/mcdx).
cy: Er mwyn cyrchu'ch gyrriant CD-ROM, mewnosodwch y ffeil dyfais dylid defnyddio. Mae gyrriannau CD-ROM ansafonnol yn defnyddio ffeiliau dyfais ansafonnol (megis /dev/mcdx).
lv: Lai piekļūtu jūsu CD-ROM dzinim, ievadiet izmantojamo ierīces failu. Nestandarta CD-ROM dziņi lieto nestandarta ierīču failus (piemēram, /dev/mcdx).

source: You may switch to the shell on the second terminal (ALT+F2) to check the available devices in /dev with "ls /dev". You can return to this screen by pressing ALT+F1.
cy: Cewch newid i'r gragen ar yr ail derfynell (ALT+F2) er mwyn gwirio'r dyfeisiau sydd ar gael yn /dev gyda "ls /dev/". Gallwch ddychwelyd i'r sgrîn yma gan wasgu ALT+F1.
lv: Jūs varat pārslēgties uz otro termināli (ALT+F2), lai pārbaudītu pieejamās ierīces /dev direktorijā ar komandu "ls /dev". Pēc tam jūs varat atgriezties pie šī ekrāna, nospiežot ALT+F1.

source: CD-ROM detected
cy: Canfuwyd CD-ROM
lv: Noteikts CD-ROM

source: The CD-ROM autodetection was successful. A CD-ROM drive has been found and it currently contains the CD ${cdname}. The installation will now continue.
cy: Roedd y canfod CD-ROM awtomatig yn llwyddiannus. Canfuwyd gyrriant CD-ROM a ac ar hyn o bryd mae'n cynnwys y CD ${cdname}. Fe fydd y gosodiad yn awr yn parhau.
lv: CD-ROM automātiskā noteikšana ir bijusi sekmīga. CD-ROM dzinis ir atrasts un satur CD ar vārdu ${cdname}. Instalēšanu var turpināt.

source: Incorrect CD-ROM detected
cy: Canfuwyd CD-ROM anghywir
lv: Noteikts nepareizs CD-ROM

source: The CD-ROM drive contains a CD which cannot be used for installation.
cy: Mae'r gyrriant CD-ROM yn cynnwys CD na ellir ei ddefnyddio ar gyfer gosodiad.
lv: CD-ROM dzinī ir CD, kuru šai instalēšanai izmantot nevar.

source: Please insert a suitable CD to continue with the installation.
cy: Mewnosodwch CD addas i barhau â'r gosodiad.
lv: Lūdzu, ievietojiet piemērotu CD, lai turpinātu instalēšanu.

source: Error reading Release file
cy: Gwall wrth ddarllen y ffeil Release
lv: Kļūda, nolasot Release failu

source: The CD-ROM does not seem to contain a valid 'Release' file, or that file could not be read correctly.
cy: Nid yw'r CD-ROM yn cynnwys ffeil Release cymwys, neu ni ellir darllen y ffeil yn gywir.
lv: Šajā CD nav derīga 'Release' faila, vai arī šo failu nevar korekti nolasīt.

source: You may try to repeat CD-ROM detection but, even if it does succeed the second time, you may experience problems later in the installation.
cy: Gallwch ceisio ailwneud canfod CD-ROM ond, os yw'n llwyddiannus yr eildro,efallai y cewch problemau nes ymlaen yn y gosodiad.
lv: Jūs varat atkārtot CD-ROM noteikšanu, taču, pat ja otrajā reizē tas tiks atrasts, ir iespējamas problēmas turpmākajā instalēšanas gaitā.

source: Detect and mount CD-ROM
cy: Canfod a gosod CD-ROM
lv: Noteikt un piemontēt CD-ROM

source: no ethernet card
cy: dim cerdyn ethernet
lv: nav ethernet tīkla kartes

source: none of the above
cy: dim o'r uchod
lv: neviens no augstāk minētajiem

source: Driver needed by your Ethernet card:
cy: Y gyrrydd sydd angen ar eich cerdyn Ethernet:
lv: Jūsu Ethernet kartei nepieciešamais draiveris:

source: No Ethernet card was detected. If you know the name of the driver needed by your Ethernet card, you can select it from the list.
cy: Ni chanfuwyd cerdyn Ethernet. Os ydych yn gwybod enw'r gyrrydd sydd angen ar eich cerdyn Ethernet, gallwch ei ddewis o'r rhestr.
lv: Ethernet karte netika atrasta. Ja jūs zināt jūsu Ethernet kartei nepieciešamā draivera nosaukumu, varat to izvēlēties no saraksta.

source: Ethernet card not found
cy: Ni chanfuwyd cerdyn Ethernet
lv: Ethernet tīkla karte nav atrasta

source: No Ethernet card was found on the system.
cy: Ni chanfuwyd cerdyn Ethernet ar y system.
lv: Sistēmā netika atrasta neviena Ethernet tīkla karte.

source: continue with no disk drive
cy: parhau heb gyrriant ddisg
lv: turpināt bez diska dziņa

source: Driver needed for your disk drive:
cy: Gyrriant eich disg:
lv: Jūsu diskdzinim vajadzīgais draiveris:

source: No disk drive was detected. If you know the name of the driver needed by your disk drive, you can select it from the list.
cy: Ni chanfuwyd gyrriant ddisg. Os ydych yn gwybod enw'r gyrriant sydd angen ar eich gyrriant ddisg, gallwch ei ddewis o'r rhestr.
lv: Nav atrasts neviens diskdzinis. Ja jūs zināt jūsu diskdzinim vajadzīgā draivera nosaukumu, varat to izvēlēties no saraksta.

source: No partitionable media
cy: Dim cyfrwng rhaniadwy
lv: Nav disku, ko dalīt

source: No partitionable media were found.
cy: Ni chanfuwyd unrhyw gyfrwng rhaniadwy.
lv: Netika atrasts neviens disks, ko varētu sadalīt.

source: Please check that a hard disk is attached to this machine.
cy: Gwiriwch fod ddisg caled wedi ei gysylltu i'r peiriant hwn, os gwelwch yn dda.
lv: Lūdzu, pārliecinieties, ka šim datoram ir pievienots cietais disks.

source: Modules to load:
cy: Modylau i'w llwytho:
lv: Ielādējamie moduļi:

source: The following Linux kernel modules were detected as matching your hardware. If you know some are unnecessary, or cause problems, you can choose not to load them. If you're unsure, you should leave them all selected.
cy: Ymddengys fod y modylau cnewyllyn Linux canlynol yn cydfynd a'ch caledwedd. Gallwch ddewis peidio llwytho rhai os ydych yn ymwybodol nad ydynt yn angenrheidiol, neu eu bod nhw'n achosi problemau. Os ydych yn ansicr, dylech eu gadael nhw i gyd wedi eu dewis.
lv: Šie ir Linux kodola moduļi, kas tika noteikti kā atbilstoši jūsu aparatūrai. Ja jūs zināt, ka daži no tiem nav nepieciešami vai var izraisīt problēmas, varat norādīt, lai tie netiktu ielādēti. Bet, ja šaubāties, atstājiet visus ieslēgtus.

source: Start PC card services?
cy: Cychwyn gwasanaethau cerdyn PC?
lv: Palaist PC karšu pakalpojumus?

source: Please choose whether PC card services should be started in order to allow the use of PCMCIA cards.
cy: Dewiswch a ddylid dechrau gwasanaethau cerdyn PC er mwyn galluogi'rdefnydd o gardiau PCMCIA.
lv: Lūdzu, izvēlieties, vai palaist PC karšu pakalpojumus, lai atļautu PCMCIA karšu lietošanu.

source: PCMCIA resource range options:
cy: Opsiynnau amrediad adnodd PCMCIA:
lv: PCMCIA resursu diapazona opcijas:

source: Some PCMCIA hardware needs special resource configuration options in order to work, and can cause the computer to freeze otherwise. For example, some Dell laptops need "exclude port 0x800-0x8ff" to be specified here. These options will be added to /etc/pcmcia/config.opts. See the installation manual or the PCMCIA HOWTO for more information.
cy: Mae rhai caledwedd PCMCIA angen opsiynnau cyfluniad adnodd arbennig er mwyn gweithio, a gall achosi i'r gyfrifiadur rhewi fel arall. Er enghraifft, mae rhai gliniaduron Dell angen "exclude port 0x800-0x8ff" wedi ei benodi yma. Caiff yr opsiynnau yma eu ychwanegu i'r ffeil /etc/pcmcia/config.opts. Gweler y llawlyfr gosod neu'r HOWTO PCMCIA am fwy o wybodaeth.
lv: Dažām PCMCIA kartēm ir nepieciešamas īpašas konfigurācijas opcijas, citādi tās var 'uzkārt' sistēmu. Piemēram, dažiem Dell portatīvajiem datoriem šeit nepieciešams norādīt "exclude port 0x800-0x8ff". Šīs opcijas tiks pievienotas /etc/pcmcia/config.opts. Skatiet instalēšanas rokasgrāmatu vai PCMCIA HOWTO, lai uzzinātu vairāk par šo jautājumu.

source: For most hardware, you do not need to specify anything here.
cy: Nid oes angen penodi unrhywbeth yma ar gyfer y rhan fwyaf o galedwedd.
lv: Lielākai daļai aparatūras te nekas nav jānorāda.

source: Error while running '${CMD_LINE_PARAM}'
cy: Gwall wrth rhedeg '${CMD_LINE_PARAM}'
lv: Kļūda, palaižot '${CMD_LINE_PARAM}'
