Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel3/*.po
Languages: lv

source: The RAID${LEVEL} array will consist of both active and spare devices. The active devices are those used, while the spare devices will only be used if one or more of the active devices fail. A minimum of ${MINIMUM} active devices is required.
lv: RAID${LEVEL} masīvs sastāvēs no aktīvām un rezerves sadaļām. Aktīvās sadaļas tiek lietotas, bet rezerves sadaļas tiks lietotas tikai tad, ja viena vai vairākas aktīvās sadaļas nespēs darboties. Vismaz ${MINIMUM} aktīvās sadaļas ir nepieciešamas.

source: Active devices for the RAID${LEVEL} array:
lv: Aktīvās ierīces RAID${LEVEL} masīvam:

source: Spare devices for the RAID${LEVEL} array:
lv: Brīvās ierīces RAID${LEVEL} masīvam:

source: Please choose which partitions will be used as spare devices. You may choose up to ${COUNT} partitions. If you choose less than ${COUNT} devices, the remaining partitions will be added to the array as "missing". You will be able to add them to the array later.
lv: Lūdzu, izvēlieties, kuras sadaļas tiks izmantotas kā rezerves sadaļas. Jūs varat izvēlēties ne vairāk kā ${COUNT} sadaļas. Ja Jūs izvēlēsieties mazāk nekā ${COUNT} ierīces, palikušās sadaļas tiks pievienotas masīvam kā "iztrūkstošas". Jūs varēsiet tās pievienot arī vēlāk.

source: Layout of the RAID10 array:
lv: Izkārtojums programmatūras RAID10 ierīcei:

source: Software RAID device to be deleted:
lv: Dzēšamā programmatūras RAID

source: Deleting a software RAID device will stop it and clear the superblock of all its components.
lv: Programmatūras RAID ierīces dzēšana apstādinās to un dzēsīs visu tās visu komponentu superbloku.

source: Please note this will not immediately allow you to reuse the partitions or devices in a new software RAID device. The array will however be unusable after the deletion.
lv: Piezīme: šī darbība neatļaus uzreiz izmantot šīs sadaļas jaunai programmatūras RAID ierīcei, taču šis masīvs pēc dzēšanas būs nelietojams.

source: No software RAID devices available
lv: Programmatūras RAID ierīce nav atrastas

source: No software RAID devices are available for deletion.
lv: Programmatūras RAID ierīces dzēšanai nav atrastas.

source: Really delete this software RAID device?
lv: Tiešām dzēst šo programmatūras RAID ierīci?

source: Please confirm whether you really want to delete the following software RAID device:
lv: Lūdzu, apstipriniet, ka jūs tiešām vēlaties dzēst šo programmatūras RAID ierīci:

source: Failed to delete the software RAID device
lv: Neizdevās izdzēst programmatūras RAID ierīci

source: There was an error deleting the software RAID device. It may be in use.
lv: Notikusi kļūda, dzēšot programmatūras RAID ierīci. Iespējams, ka tā šobrīd tiek izmantota.

source: Write the changes to the storage devices and configure RAID?
lv: Saglabāt izmaiņas datu nesējā un konfigurēt RAID?

source: Before RAID can be configured, the changes have to be written to the storage devices. These changes cannot be undone.
lv: Pirms konfigurēt RAID, veiktās izmaiņas jāsaglabā datu nesējā. Šīs izmaiņas nevarēs atcelt.

source: When RAID is configured, no additional changes to the partitions in the disks containing physical volumes are allowed. Please convince yourself that you are satisfied with the current partitioning scheme in these disks.
lv: Kad RAID ir nokonfigurēts, vairs nevar veikt nekādas papildu izmaiņas sadaļu struktūrā. Lūdzu, pārliecinieties, ka jūs apmierina esošā sadaļu struktūra.

source: Keep current partition layout and configure RAID?
lv: Saglabāt esošo sadaļu izkārtojumu un konfigurēt RAID?

source: RAID configuration failure
lv: RAID konfigurēšanas kļūda

source: RAID configuration has been aborted.
lv: RAID konfigurēšana tika pārtraukta.

source: physical volume for RAID
lv: RAID fiziskais sējums

source: Remove existing software RAID partitions?
lv: Dzēst esošās programmatūras RAID sadaļas?

source: The selected device contains partitions used for software RAID devices. The following devices and partitions are about to be removed:
lv: Izvēlētā ierīce jau satur šādu programmatūras RAID sējumus, kas tiks dzēsti:

source: Software RAID devices about to be removed: ${REMOVED_DEVICES}
lv: Programmatūras RAID iekārtas, kas tiks aizvāktas: ${REMOVED_DEVICES}

source: Partitions used by these RAID devices: ${REMOVED_PARTITIONS}
lv: Sadaļas, ko lieto šīs iekārtas: ${REMOVED_PARTITIONS}

source: Note that this will also permanently erase any data currently on the software RAID devices.
lv: Piezīme: šī darbība uz visiem laikiem izdzēsīs visu informāciju uz šiem RAID sējumiem.

source: Unallocated physical volumes:
lv: Neizmantotie fiziskie sējumi:

source: Volume groups:
lv: Sējumu grupas:

source: Uses physical volume:
lv: Lieto fizisko sējumu:

source: Provides logical volume:
lv: Veido loģisko sējumu:

source: none[ Do not translate what's inside the brackets and just put the translation for the word "none" in your language without any brackets. This "none" relates to "Physical Volumes:" ]
lv: nav sējumu

source: none[ Do not translate what's inside the brackets and just put the translation for the word "none" in your language without any brackets. This "none" relates to "Volume Groups:" ]
lv: nav grupu

source: PV
lv: FS

source: In use by LVM volume group ${VG}
lv: Tiek lietota LVM sējumu grupā ${VG}

source: Create volume group
lv: Izveidot sējumu grupu

source: Delete volume group
lv: Dzēst sējumu grupu

source: Extend volume group
lv: Paplašināt sējumu grupu

source: Reduce volume group
lv: Sašaurināt sējumu grupu

source: Write the changes to disks and configure LVM?
lv: Saglabāt izmaiņas diskā un konfigurēt LVM?

source: After the Logical Volume Manager is configured, no additional changes to the partitioning scheme of disks containing physical volumes are allowed during the installation. Please decide if you are satisfied with the current partitioning scheme before continuing.
lv: Kad Logical Volume Manager konfigurēšana pabeigta, vairs nevar ieviest izmaiņas to disku sadalījumos, kas satur fiziskos sējumus. Lūdzu, pārliecinieties, ka pašreizējie disku sadalījumi ir jums pa prātam, pirms turpināt instalāciju.

source: Keep current partition layout and configure LVM?
lv: Vai saglabāt pašreizējo sadaļu izkārtojumu un konfigurēt LVM?

source: After the Logical Volume Manager is configured, no additional changes to the partitions in the disks containing physical volumes are allowed. Please decide if you are satisfied with the current partitioning scheme in these disks before continuing.
lv: Papildu izmaiņas cietā diska sadaļās pēc Logical Volume Manager konfigurēšanas vairs nevarēs veikt. Pirms turpināt, pārliecinieties, ka jūs apmierina pašreizējais sadaļu izkārtojums.

source: LVM configuration failure
lv: LVM konfigurēšanas kļūda

source: Logical Volume Manager configuration has been aborted.
lv: Logical Volume Manager konfigurēšana tika pārtraukta.

source: physical volume for LVM
lv: LVM fiziskais sējums

source: Summary of current LVM configuration:
lv: Pašreizējās LVM konfigurācijas kopsavilkums:

source: Free Physical Volumes: ${FREE_PVS} Used Physical Volumes: ${USED_PVS} Volume Groups: ${VGS} Logical Volumes: ${LVS}
lv: Brīvie fiziskie sējumi: ${FREE_PVS} Lietotie fiziskie sējumi: ${USED_PVS} Sējumu grupas: ${VGS} Loģiskie sējumi: ${LVS}

source: Current LVM configuration:
lv: Pašreizējā LVM konfigurācija:

source: No physical volumes were selected. The creation of a new volume group has been aborted.
lv: Neviens fiziskais sējums netika izvēlēts. Jaunas sējumu grupas izveide tika pārtraukta.

source: No name for the volume group has been entered. Please enter a name.
lv: Sējumu grupas nosaukums netika ievadīts. Lūdzu, ievadiet nosaukumu.

source: The selected volume group name is already in use. Please choose a different name.
lv: Izvēlētais sējumu grupas nosaukums jau tiek izmantots. Lūdzu, izvēlieties citu nosaukumu.

source: The selected volume group name overlaps with an existing device name. Please choose a different name.
lv: Izvēlētais sējumu grupas nosaukums pārklājas ar eksistējošas ierīces nosaukumu. Lūdzu, izvēlieties citu nosaukumu.

source: The volume group ${VG} could not be created.
lv: Neizdevās izveidot sējumu grupu ${VG}.

source: No physical volumes were selected. Extension of the volume group has been aborted.
lv: Neviens fiziskais sējums netika izvēlēts. Sējumu grupas paplašināšana tika pārtraukta.

source: Devices to remove from the volume group:
lv: Ierīces, ko izņemt no sējumu grupas:

source: Please select the devices you wish to remove from the volume group.
lv: Lūdzu, izvēlieties ierīci, kuru jūs vēlaties izņemt no sējumu grupas.

source: No physical volumes were selected. Reduction of the volume group was aborted.
lv: Neviens fiziskais sējums netika izvēlēts. Sējumu grupas sašaurināšana tika pārtraukta.

source: Error while initializing physical volume
lv: Kļūda, inicializējot fizisko sējumu

source: The physical volume ${PV} could not be initialized.
lv: Neizdevās inicializēt fizisko sējumu ${PV}.

source: Invalid logical volume or volume group name
lv: Nederīgs loģiskā sējuma vai sējumu grupas nosaukums

source: The selected device already contains the following LVM logical volumes, volume groups and physical volumes which are about to be removed:
lv: Izvēlētā ierīce jau satur šādus LVM loģiskos sējumus, sējumu grupas un fiziskos sējumus, kas tiks aizvākti:

source: Logical volume(s) to be removed: ${LVTARGETS}
lv: Aizvācamie loģiskie sējumi: ${LVTARGETS}

source: Volume group(s) to be removed: ${VGTARGETS}
lv: Aizvācamās sējumu grupas: ${VGTARGETS}

source: Physical volume(s) to be removed: ${PVTARGETS}
lv: Aizvācamie fiziskie sējumi: ${PVTARGETS}

source: Unable to automatically remove LVM data
lv: Nevar automātiski izņemt LVM datus

source: Because the volume group(s) on the selected device also consist of physical volumes on other devices, it is not considered safe to remove its LVM data automatically. If you wish to use this device for partitioning, please remove its LVM data first.
lv: Sakarā ar to, ka sējumu grupas izvēlētajā ierīcē satur fiziskus sējumus citās ierīcēs, nav droši izņemt LVM datus automātiski. Ja jūs vēlaties izmantot šo ierīci dalīšanai, lūdzu, vispirms izņemiet tās LVM datus.

source: Logical Volume Management
lv: Loģisko Sējumu Vadība (LVM)

source: A common situation for system administrators is to find that some disk partition (usually the most important one) is short on space, while some other partition is underused. The Logical Volume Manager (LVM) can help with this.
lv: Biežas situācija sistēmu administrēšanā ir kad viena no diska sadaļām (parasti tā svarīgākā) ir pārpildīta, kamēr citas ir tukšas. LVM var palīdzēt risināt šo problēmu.

source: LVM allows combining disk or partition devices ("physical volumes") to form a virtual disk ("volume group"), which can then be divided into virtual partitions ("logical volumes"). Volume groups and logical volumes may span several physical disks. New physical volumes may be added to a volume group at any time, and logical volumes can be resized up to the amount of unallocated space in the volume group.
lv: LVM atļauj apvienot diskus vai to sadaļas ("fiziskie sējumi") lai izveidotu virtuālu disku ("sējumu grupu"), no kuras var izdalīt vairākas virtuālas sadaļas ("loģiskie sējumi"). Sējumu grupas un loģiskie sējumi var atrasties uz vairākiem fiziskajiem diskiem. Jebkurā brīdī var pievienot jaunus fiziskos sējumus sējumu grupām un tāpat var palielināt loģisko sējumu izmēru izmantojot brīvo vietu sējumu grupā.

source: The items on the LVM configuration menu can be used to edit volume groups and logical volumes. After you return to the main partition manager screen, logical volumes will be displayed in the same way as ordinary partitions, and should be treated as such.
lv: LVM konfigurācijas izvēlnes ļauj izveidot sējumu grupas un loģiskos sējumus. Pēc atgriešanās galvenajā sadaļu veidošanas izvēlnē loģiskie sējumi parādīsies kā vienkāršas sadaļas un tā tos arī vajadzētu izmantot.

source: Name of the volume group for the new system:
lv: Jaunās sistēmas sējumu grupas nosaukums:

source: This happened because the selected recipe does not contain any partition that can be created on LVM volumes.
lv: Šī kļūda notika, jo izvēlētā recepte nesatur sadaļas, kas varētu tikt izveidotas uz LVM sējumiem.

source: Continue installation without /boot partition?
lv: Turpināt instalāciju bez /boot sadaļas?

source: The recipe you selected does not contain a separate partition for /boot. This is normally needed to allow you to boot the system when using LVM.
lv: Izvēlētā recepte nesatur atsevišķu /boot sadaļu. Parasti tā ir nepieciešama, lai varētu ielādēt sistēmu, izmantojot LVM.

source: You can choose to ignore this warning, but that may result in a failure to reboot the system after the installation is completed.
lv: Jūs varat ignorēt šo brīdinājumu, taču tas visticamāk izraisīs sistēmas palaišanas problēmas pēc instalēšanas beigām.

source: The volume group name used to automatically partition using LVM is already in use. Lowering the priority for configuration questions will allow you to specify an alternative name.
lv: Automātiskajā LVM dalīšanā izmantotais sējumu grupas vārds jau tiek izmantots. Samazinot konfigurēšanas jautājumu prioritāti, jums parādīsies iespēja ievadīt alternatīvu sējumu grupas vārdu.

source: Unexpected error while creating volume group
lv: Neparedzēta kļūda, veidojot sējumu grupu

source: Autopartitioning using LVM failed because an error occurred while creating the volume group.
lv: Automātiskā LVM dalīšana neizdevās, jo notika kļūda, veidojot sējumu grupu.

source: Multiple disks (%s)
lv: Vairāki diski (%s)

source: Non-existing physical volume
lv: Neeksistējošs fiziskais sējums

source: A volume group definition contains a reference to a non-existing physical volume.
lv: Sējumu grupas apraksts satur atsauci uz neeksistējošu fizisko sejumu.

source: Please check that all devices are properly connected. Alternatively, please check the automatic partitioning recipe.
lv: Lūdzu pārbaudies, ka visas iekārtas ir pievienotas vai arī pārbaudiet automatiskās dalīšanas recepti.

source: No physical volume defined in volume group
lv: Sējumu grupā nav noteikti fiziskie sējumi

source: The automatic partitioning recipe contains the definition of a volume group that does not contain any physical volume.
lv: Automātiskā dalīšanas recepte satur tādas sējumu grupas aprakstu, kas nesatur nevienu fizisko sējumu.

source: Please check the automatic partitioning recipe.
lv: Lūdzu pārbaudiet automātiskās dalīšanas recepti.

source: Error while setting up RAID
lv: Kļūda uzstādot RAID

source: An unexpected error occurred while setting up a preseeded RAID configuration.
lv: Negaidīta kļūda uzstādot iepriekškonfigurētu RAID konfigurāciju

source: Not enough RAID partitions specified
lv: Norādīts nepietiekošs RAID sadaļu daudzums

source: There are not enough RAID partitions specified for your preseeded configuration. You need at least 3 devices for a RAID5 array.
lv: Jūsu priekšizvēlētajai konfigurācijai nav pieejams pietiekošs daudzums brīvu RAID sadaļu. RAID5 massīvam ir vajadzīgas vismaz 3 ierīces.

source: physical volume for encryption
lv: šifrējamais fiziskais sējums

source: Loopback (loop-AES)
lv: Atgriezeniskā cilpa (loop-AES)

source: Device-mapper (dm-crypt)
lv: Ierīču saistītājs (dm-crypt)

source: not active
lv: nav aktīva

source: Encryption method:
lv: Šifrēšanas metode:

source: Encryption method for this partition:
lv: Šīs sadaļas šifrēšanas metode:

source: Changing the encryption method will set other encryption-related fields to their default values for the new encryption method.
lv: Šifrēšanas metodes maiņa uzstādīs visus pārējos ar šifrēšanu saistītos uzstādījumus uz noklusētajām vērtībām jaunizvēlētajai šifrēšanas metodei.

source: Encryption:
lv: Šifrēšana:

source: Encryption for this partition:
lv: Šīs sadaļas šifrēšana:

source: Key size:
lv: Atslēgas izmērs:

source: Key size for this partition:
lv: Šīs sadaļas šifrēšanas atslēgas izmērs:

source: IV algorithm:
lv: IV algoritms:

source: Initialization vector generation algorithm for this partition:
lv: Inicializācijas vektora ģenerēšanas algoritms šai sadaļai:

source: Different algorithms exist to derive the initialization vector for each sector. This choice influences the encryption security. Normally, there is no reason to change this from the recommended default, except for compatibility with older systems.
lv: Eksistē dažādi algoritmi inicializācijas vektora izvēlei katram sektoram. Šī izvēle ietekmē šifrēšanas drošības līmeni. Parasti mainīt šo izvēli nav ieteicams, izņemot gadījumus, kad nepieciešams nodrošināt savietojamību ar vecākām sistēmām.

source: Encryption key:
lv: Šifrēšanas atslēga:

source: Type of encryption key for this partition:
lv: Šīs sadaļas šifrēšanas atslēgas tips:

source: Encryption key hash:
lv: Atslēgas jaucējsumma:

source: Type of encryption key hash for this partition:
lv: Šīs sadaļas šifrēšanas jaucējfunkcijas summas tips:

source: The encryption key is derived from the passphrase by applying a one-way hash function to it. Normally, there is no reason to change this from the recommended default and doing so in the wrong way can reduce the encryption strength.
lv: Šifrēšanas atslēga tiek iegūta no paroles, tai pielietojot vienvirziena jaucējfunkciju. Parasti nav pamata mainīt šīs izvēlnes rekomendēto noklusēto vērtību, jo, izdarot to nekorektā veidā, var vājināt šifrēšanas spēku.

source: Erase data:
lv: Dzēst datus:

source: Erase data on this partition
lv: Dzēst datus no šīs sadaļas

source: Really erase the data on ${DEVICE}?
lv: Tiešām dzēst datus no ${DEVICE}?

source: The data on ${DEVICE} will be overwritten with random data. It can no longer be recovered after this step has completed. This is the last opportunity to abort the erase.
lv: Dati uz ierīces ${DEVICE} tiks pārrakstīti ar gadījuma datiem. Pēc šī soļa veikšanas nekāda informācija no šīs ierīces vairs nevarēs tikt atjaunota. Šī ir pēdējā iespēja pārtraukt dzēšanu.

source: Erasing data on ${DEVICE}
lv: Datu dzēšana no ${DEVICE}

source: Erasing data on ${DEVICE} failed
lv: Datu dzēšana no ${DEVICE} neizdevās

source: An error occurred trying to erase the data on ${DEVICE}. The data has not been erased.
lv: Kļūda, dzēšot datus no ${DEVICE} ierīces. Dati nav pilnībā izdzēsti.

source: Setting up encryption...
lv: Uzstādu šifrēšanu...

source: Configure encrypted volumes
lv: Konfigurēt šifrētos sējumus

source: No partitions to encrypt
lv: Nav šifrējamu sadaļu

source: No partitions have been selected for encryption.
lv: Nav izvēlētas sadaļas šifrēšanai.

source: Required programs missing
lv: Trūkst nepieciešamās programmas

source: This build of debian-installer does not include one or more programs that are required for partman-crypto to function correctly.
lv: Šajā debian instalatora versijā nav iekļautas programmas, kas ir nepieciešamas, lai partman-crypto darbotos korekti.

source: Required encryption options missing
lv: Nav norādītas nepieciešamās šifrēšanas opcijas

source: The encryption options for ${DEVICE} are incomplete. Please return to the partition menu and select all required options.
lv: ${DEVICE} šifrēšanas opcijas ir nepilnīgas. Lūdzu, atgriezieties uz disku dalīšanas izvēlni un norādiet nepieciešamās opcijas.

source: missing
lv: trūkst

source: In use as physical volume for encrypted volume ${DEV}
lv: Tiek lietota kā šifrētā sējuma ${DEV} fiziskais sējums.

source: Encryption package installation failure
lv: Kļūda, instalējot šifrēšanas pakotni

source: The kernel module package ${PACKAGE} could not be found or an error occurred during its installation.
lv: Kodola moduļa pakotne ${PACKAGE} nav atrasta, vai arī ir radusies kļūda tās instalēšanas procesā.

source: It is likely that there will be problems setting up encrypted partitions when the system is rebooted. You may be able to correct this by installing the required package(s) later on.
lv: Sistēmas pārlaišanas laikā, kad tā mēģinās iestatīt šifrētās sadaļas, iespējamas problēmas. Varbūt jūs varēsiet tās atrisināt, vēlāk uzinstalējot nepieciešamās pakotnes.

source: Write the changes to disk and configure encrypted volumes?
lv: Saglabāt izmaiņas diskā un konfigurēt šifrētos sējumus?

source: Before encrypted volumes can be configured, the current partitioning scheme has to be written to disk. These changes cannot be undone.
lv: Pirms konfigurēt šifrētos sējumus, pašreizējais sadaļu izkārtojums ir jāsaglabā diskā. Šīs izmaiņas vairs nevarēs atcelt.

source: After the encrypted volumes have been configured, no additional changes to the partitions on the disks containing encrypted volumes are allowed. Please decide if you are satisfied with the current partitioning scheme for these disks before continuing.
lv: Konfigurējot šifrētos sējumus, izmaiņas esošajās fizisko sējumu sadaļās vairs nav atļautas. Pirms turpiniet, lūdzu, pārliecinieties, ka jūs apmierina pašreizējais sadaļu izkārtojums.

source: Keep current partition layout and configure encrypted volumes?
lv: Saglabāt esošo sadaļu izkārtojumu un konfigurēt šifrētos sējumus?

source: Configuration of encrypted volumes failed
lv: Kļūda, konfigurējot šifrētos sējumus

source: An error occurred while configuring encrypted volumes.
lv: Radusies kļūda, konfigurējot šifrētos sējumus.

source: The configuration has been aborted.
lv: Konfigurēšana tika pārtraukta.

source: Initialisation of encrypted volume failed
lv: Šifrēto sējumu inicializācija neizdevās

source: An error occurred while setting up encrypted volumes.
lv: Radusies kļūda, Iestatot šifrētos sējumus.

source: Passphrase
lv: Parole

source: Keyfile (GnuPG)
lv: Atslēgas fails (GnuPG)

source: Random key
lv: Nejauša atslēga

source: Unsafe swap space detected
lv: Atrasta nedroša maiņvieta

source: An unsafe swap space has been detected.
lv: Jūsu sistēmā ir atrasta nedroša maiņvieta.

source: This is a fatal error since sensitive data could be written out to disk unencrypted. This would allow someone with access to the disk to recover parts of the encryption key or passphrase.
lv: Šī ir fatāla kļūda, jo svarīgus datus var nešifrētus izkopēt no diska. Tas varētu ļaut kādam ar piekļuvi diskam atgūt daļas no šifrēšanas atslēgas vai paroles.

source: Please disable the swap space (e.g. by running swapoff) or configure an encrypted swap space and then run setup of encrypted volumes again. This program will now abort.
lv: Lūdzu, atslēdziet maiņvietas izmantošanu (piem. izpildot swapoff) vai nokonfigurējiet maiņvietas šifrēšanu un vēlreiz izpildiet šifrēto sējumu iestatīšanu. Šī programma tagad pārtrauks savu darbību.

source: Encryption passphrase:
lv: Šifrēšanas parole:

source: You need to choose a passphrase to encrypt ${DEVICE}.
lv: Jums jāizvēlas ${DEVICE} šifrēšanas parole.

source: The overall strength of the encryption depends strongly on this passphrase, so you should take care to choose a passphrase that is not easy to guess. It should not be a word or sentence found in dictionaries, or a phrase that could be easily associated with you.
lv: Šifrēšanas kopējā drošība lielā mērā ir atkarīga no šī paroles, tāpēc jums vajadzētu rūpīgi izvēlēties šo paroli tādu, lai to nevarētu viegli uzminēt. Tam nevajadzētu būt vārdnīcās atrodamam vārdam vai frāzei, ko varētu viegli saistīt ar jums personiski.

source: A good passphrase will contain a mixture of letters, numbers and punctuation. Passphrases are recommended to have a length of 20 or more characters.
lv: Laba parole sastāvēs no burtu, ciparu un dažādu simbolu kombinācijas. Parolei būtu jābūt vismaz 20 simbolus garai.

source: Re-enter passphrase to verify:
lv: Ievadiet paroli vēlreiz:
