Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel3/*.po
Languages: lv

source: Please insert one of the official Debian CD-ROMs into the drive before continuing.
lv: Pirms turpināt, lūdzu ielieciet diskierīcē vienu no oficiālajiem Debian kompaktdiskiem.

source: Failed to mount CD-ROM
lv: Nevarēja piemontēt CD-ROM

source: The CD-ROM ${CDROM} could not be mounted correctly. Please check the media and cables, and try it again.
lv: CD-ROM ${CDROM} neizdevās piemontēt. Lūdzu, pārbaudiet disku un savienojošos kabeļus un mēģiniet vēlreiz.

source: No valid Debian CD-ROM
lv: Nav atrasts neviens korekts Debian CD

source: The CD-ROM you have inserted is not a valid Debian CD-ROM. Please change the disk.
lv: CD, ko jūs ielikāt, nav Debian CD. Lūdzu nomainiet CD.

source: Failed to open checksum file
lv: Nevarēja atvērt kontrolsummas failu

source: Opening the MD5 file on the CD-ROM failed. This file contains the checksums of the files located on the CD-ROM.
lv: Nevarēja atvērt MD5 failu uz CD-ROM. Šajā failā atrodas visu uz CD-ROM esošo failu kontrolsummas.

source: Integrity test successful
lv: Integritātes tests sekmīgi pabeigts

source: The CD-ROM integrity test was successful. The CD-ROM is valid.
lv: CD-ROM integritātes pārbaude sekmīgi pabeigta. Šis kompaktdisks ir derīgs.

source: Integrity test failed
lv: Integritātes tests neizdevās

source: The ${FILE} file failed the MD5 checksum verification. Your CD-ROM or this file may have been corrupted.
lv: Fails ${FILE} neizturēja MD5 kontrolsummas pārbaudi. Jūsu CD-ROM vai šis fails varētu būt bojāti.

source: Check the integrity of another CD-ROM?
lv: Pārbaudīt cita CD-ROM integritāti?

source: Insert Debian boot CD-ROM
lv: Ielieciet Debian ielādes CD

source: Please make sure you have inserted the Debian boot CD-ROM to continue with the installation.
lv: Lūdzu ielieciet Debian ielādes CD, lai turpinātu instalāciju.

source: Checking CD-ROM integrity
lv: Pārbauda CD-ROM integritāti

source: Checking file: ${FILE}
lv: Pārbauda failu: ${FILE}

source: Install the system
lv: Instalēt sistēmu

source: Installing the system...
lv: Instalē bāzes sistēmu...

source: Copying data to disk...
lv: Kopē datus uz disku...

source: Cleaning up network settings...
lv: Satīra tīkla iestatījumus ...

source: Removing packages specific to the live system...
lv: Noņiem pakas specifiskas dzīvajai sistēmai ...

source: Reconfiguring X.org...
lv: Pārkonfigurē X.org...

source: normal
lv: normāla

source: live
lv: dzīvā

source: Type of installation:
lv: Izvēlieties uzstādīšanas veidu:

source: The live system can be installed to hard disk using one of the following options.
lv: Dzīvā sistēma var tikt uzstādīta uz cietā diska sekojošos veidos

source: If you choose 'normal', the system will be installed as a regular system. If you choose 'live', the installed system will continue to act as a live system but it can then be launched directly from the hard disk.
lv: Izvēloties 'normālo' uzstādīšanas veidu dzīvā sistēma tiks pārveidota par normālu sistēmu instalācijas gaitā. Izvēloties 'dzīvo' uzstādīšanas veidu, sistēma turpinās darboties kā dzīvā sistēma, bet tikai varēs būt palaista no cietā diska.

source: Kernel version mismatch
lv: Kodola versijas nesakrīt

source: Live system kernel and installer kernel don't match
lv: Kodola versijas dzīvajā sistēmā un instalātorā nesakrīt

source: The installer can only be used if the kernel versions of the live system (${LIVE_KERNEL}) and of the installer (${DI_KERNEL}) are the same.
lv: Instalātors var tikt izmantots tikai tad, ja dzīvās sistēmas kodola versija (${LIVE_KERNEL}) sakrīt ar instalātora kodola versiju (${DI_KERNEL}).

source: Please reboot with the correct kernel (${DI_KERNEL}).
lv: Lūdzu pārstartējiet sistēmu par pareizo kodolu (${DI_KERNEL}).

source: If you do not go back to the partitioning menu and correct this error, the partition will be used as is. This means that you may not be able to boot from your hard disk.
lv: Ja neatgriezīsieties uz sadaļu veidošanas izvēlni un neizlabosiet radušās kļūdas, tad sadaļas tiks izmanotas esošajā konfigurācijā. Tas nozīme, ka iespējams jūs vēlāk nevarēsiet iesaknēt savu mašīnu.

source: UFS file system
lv: UFS failu sistēma

source: Display configuration details
lv: Parādīt informāciju par konfigurāciju

source: Create logical volume
lv: Veidot loģisko sējumu

source: Delete logical volume
lv: Dzēst loģisko sējumu

source: Finish
lv: Beigt

source: An error occurred while writing the changes to the disks.
lv: Notika kļūda, rakstot izmaiņas diskos.

source: You can select one or more devices.
lv: Jūs varat izvēlēties vienu vai vairākas ierīces.

source: No physical volumes selected
lv: Neviens fiziskais sējums netika izvēlēts

source: Logical volume name:
lv: Loģiskā sējuma nosaukums:

source: Please enter the name you would like to use for the new logical volume.
lv: Ievadiet nosaukumu, ko dot jaunajam loģiskajam sējumam

source: No logical volume name entered
lv: Loģiskā sējuma nosaukums nav ievadīts

source: Error while creating a new logical volume
lv: Kļūda, veidojot jaunu loģisko sējumu

source: Logical volume size:
lv: Loģiskā sējuma izmērs:

source: Please enter the size of the new logical volume. The size may be entered in the following formats: 10K (Kilobytes), 10M (Megabytes), 10G (Gigabytes), 10T (Terabytes). The default unit is Megabytes.
lv: Ievadiet jaunā loģiskā sējuma izmēru. To var ievadīt šādos veidos: 10K (Kilobaiti), 10M (Megabaiti), 10G (Gigabaiti), 10T (Terabaiti). Noklusētā vienība ir megabaiti.

source: Unable to create a new logical volume (${LV}) on ${VG} with the new size ${SIZE}.
lv: Nevaru izveidot jaunu loģisko sējumu (${LV}) uz ${VG} ar izmēru ${SIZE}.

source: No logical volume found
lv: Loģiskie sējumi nav atrasti

source: Logical volume:
lv: Loģiskais sējums:

source: Please select the logical volume to delete.
lv: Lūdzu, izvēlieties, kuru loģisko sējumu dzēst.

source: in VG ${VG}
lv: Sējumu grupā ${VG}

source: Error while deleting the logical volume
lv: Kļūda, dzēšot loģisko sējumu

source: No usable physical volumes found
lv: Nav atrasti lietojami fiziskie sējumi

source: Please choose a different name.
lv: Lūdzu, izvēlieties citu nosaukumu.

source: Remove existing logical volume data?
lv: Dzēst esošo loģisko sējumu datus?

source: Note that this will also permanently erase any data currently on the logical volumes.
lv: Atcerieties, ka šī darbība arī izdzēsīs jebkurus datus, kas šobrīd atrodas loģiskajos sējumos.

source: Multidisk (MD) not available
lv: Atbalsts daudzdiskiem (MD) nav pieejams

source: The current kernel doesn't seem to support multidisk devices. This should be solved by loading the needed modules.
lv: Šis kodols neatbalsta daudzdisku ierīces. Ir iespējams, ka to var atrisināt, ielādējot attiecīgus moduļus.

source: Create MD device
lv: Izveidot MD ierīci

source: Delete MD device
lv: Dzēst MD ierīci

source: Multidisk configuration actions
lv: Daudzdisku konfigurēšanas darbības

source: This is the Multidisk (MD) and software RAID configuration menu.
lv: Šī ir daudzdisku (MD) un programmatūras RAID konfigurēšanas izvēlne.

source: Please select one of the proposed actions to configure multidisk devices.
lv: Lūdzu, izvēlieties vienu no šīm darbībām, lai konfigurētu daudzdisku ierīci.

source: No RAID partitions available
lv: RAID sadaļas nav atrastas

source: No unused partitions of the type "Linux RAID Autodetect" are available. Please create such a partition, or delete an already used multidisk device to free its partitions.
lv: Nav atrastas neaizņemtas "Linux·RAID·Autodetect" tipa sadaļas. Lūdzu, izveidojiet šādu sadaļu vai dzēsiet jau izveidotu daudzdisku ierīci, lai atbrīvotu tajā iekļautās sadaļas.

source: If you have such partitions, they might contain actual file systems, and are therefore not available for use by this configuration utility.
lv: Ja jums ir šādas sadaļas, tās varētu jau saturēt failu sistēmas, un tāpēc tās nav pieejamas apstrādei ar šo konfigurēšanas rīku.

source: Not enough RAID partitions available
lv: Nepietiekošs RAID sadaļu skaits

source: There are not enough RAID partitions available for your selected configuration. You have ${NUM_PART} RAID partitions available but your configuration requires ${REQUIRED} partitions.
lv: Jūsu izvēlētajai konfigurācijai nav pieejams pietiekošs skaits brīvu RAID sadaļu. Jums ir ${NUM_PART} brīvas RAID sadaļas, bet jūsu izvēlētā konfigurācijai nepieciešama(-s) ${REQUIRED} brīvu sadaļu(-as).

source: Multidisk device type:
lv: Daudzdisku ierīces tips:

source: Please choose the type of the multidisk device to be created.
lv: Lūdzu, izvēlieties, kāda tipa daudzdisku ierīci izveidot.

source: Active devices for the RAID0 multidisk device:
lv: Aktīvās ierīces RAID0 daudzdisku ierīcei:

source: You have chosen to create a RAID0 array. Please choose the active devices in this array.
lv: Jūs izvēlējāties izveidot RAID0 masīvu. Lūdzu, izvēlieties šī masīva aktīvās ierīces.

source: Number of active devices for the RAID${LEVEL} array:
lv: Aktīvo ierīču skaits RAID${LEVEL} masīvam:

source: The RAID${LEVEL} array will consist of both active and spare partitions. The active partitions are those used, while the spare devices will only be used if one or more of the active devices fail. A minimum of ${MINIMUM} active devices is required.
lv: RAID${LEVEL} masīvs sastāv no aktīvām un rezerves sadaļām. Aktīvās sadaļas tiek lietotas, bet rezerves sadaļas tiks lietotas tikai tad, ja viena vai vairākas aktīvās sadaļas nespēs darboties. Vismaz ${MINIMUM} aktīvās sadaļas ir nepieciešamas.

source: NOTE: this setting cannot be changed later.
lv: PIEZĪME: šo iestādni vēlāk nevarēs mainīt.

source: Active devices for the RAID${LEVEL} multidisk device:
lv: Aktīvās ierīces RAID${LEVEL} daudzdisku ierīcei:

source: You have chosen to create a RAID${LEVEL} array with ${COUNT} active devices.
lv: Jūs esat izvēlējušies izveidot RAID${LEVEL} masīvu ar ${COUNT} aktīvām ierīcēm.

source: Please choose which partitions are active devices. You must select exactly ${COUNT} partitions.
lv: Lūdzu, izvēlieties, kuras sadaļas būs aktīvās ierīces. Jums ir jāizvēlas tieši ${COUNT} sadaļas.

source: Number of spare devices for the RAID${LEVEL} array:
lv: Brīvo ierīču skaits RAID${LEVEL} masīvam:

source: Spare devices for the RAID${LEVEL} multidisk device:
lv: Rezerves ierīces RAID${LEVEL} masīvam:

source: You have chosen to create a RAID${LEVEL} array with ${COUNT} spare devices.
lv: Jūs esat izvēlējušies izveidot RAID${LEVEL} masīvu ar ${COUNT} rezerves ierīcēm.

source: Please choose which partitions will be used as spare devices. You may choose up to ${COUNT} partitions. If you choose less than ${COUNT} devices, the remaining partitions will be added to the array as "missing". You will be able to add them later to the array.
lv: Lūdzu, izvēlieties, kuras sadaļas tiks izmantotas kā rezerves sadaļas. Jūs varat izvēlēties ne vairāk kā ${COUNT} sadaļas. Ja Jūs izvēlēsieties mazāk nekā ${COUNT} ierīces, palikušās sadaļas tiks pievienotas masīvam kā 'iztrūkstošas'. Jūs varēsiet tās pievienot arī vēlāk.

source: Layout of the RAID10 multidisk device:
lv: Izkārtojums RAID10 daudzdisku ierīcei:

source: The layout must be n, o, or f (arrangement of the copies) followed by a number (number of copies of each chunk). The number must be smaller or equal to the number of active devices.
lv: Izkārtojumam jābūt n, o vai f (kopiju izvietojums) kam seko skaitlis (katra gabala kopiju skaits). Skaitlim jābūt mazākam vai vienādam ar aktīvo iekārtu skaitu.

source: The letter is the arrangement of the copies: n - near copies: Multiple copies of one data block are at similar offsets in different devices. f - far copies: Multiple copies have very different offsets o - offset copies: Rather than the chunks being duplicated within a stripe, whole stripes are duplicated but are rotated by one device so duplicate blocks are on different devices.
lv: Burts ir kopiju izvietojums: n - near copies - tuvās kopijas: Viena datu gabala kopijas ir izvietotas līdzīgās nobīdēs dažādās iekārtās. f - far copies - tālās kopijas: Kopijām var būt dažādas nobīdes o - offset copies - nobīdīdas kopijas: Tā vietā, lai kopētu gabalus no svītras, veselas svītras tiek kopētas, bet gabali tiek rotēti par vienu, lai gabalu kopijas atrastos uz dažādām iekārām.

source: Multidisk device to be deleted:
lv: Dzēšamā daudzdisku ierīce:

source: Deleting a multidisk device will stop it and clear the superblock of all its components.
lv: Daudzdisku ierīces dzēšana apstādinās to un dzēsīs visu tās visu komponentu superbloku.

source: Please note this will not immediately allow you to reuse the partitions or devices in a new multidisk device. The array will however be unusable after the deletion.
lv: Piezīme: šī darbība neatļaus uzreiz izmantot šīs sadaļas jaunai daudzdisku ierīcei, taču šis masīvs pēc dzēšanas būs nelietojams.

source: If you select a device for deletion, you will get some information about it and you will be given the option of aborting this operation.
lv: Ja jūs izvēlēsities dzēst kādu ierīci, jums tiks sniegta informācija par šo ierīci un iespēja atcelt dzēšanas darbību.

source: No multidisk devices available
lv: Daudzdisku ierīces nav pieejamas

source: No multidisk devices are available for deletion.
lv: Daudzdisku ierīces dzēšanai nav atrastas.

source: Really delete this multidisk device?
lv: Tiešām dzēst šo daudzdisku ierīci?

source: Please confirm whether you really want to delete the following multidisk device:
lv: Lūdzu, apstipriniet, ka jūs tiešām vēlaties dzēst šo daudzdisku ierīci:

source: Device: ${DEVICE} Type: ${TYPE} Component devices:
lv: Ierīce: ${DEVICE} Tips: ${TYPE} Komponenšu ierīces:

source: Failed to delete the multidisk device
lv: Neizdevās izdzēst daudzdisku ierīci

source: There was an error deleting the multidisk device. It may be in use.
lv: Notikusi kļūda, dzēšot daudzdisku ierīci. Iespējams, ka tā šobrīd tiek izmantota.

source: Activate existing volume groups?
lv: Aktivēt eksistējošas sējumu grupas?

source: ${COUNT} existing volume groups have been found. Please indicate whether you want to activate them.
lv: ${COUNT} sējumu grupas tika atrastas. Vai vajadzētu tās aktivizēt?

source: Modify volume groups (VG)
lv: Modificēt sējumu grupas (VG)

source: Modify logical volumes (LV)
lv: Modificēt loģiskos sējumus (LV)

source: Leave
lv: Beigt

source: LVM configuration action:
lv: LVM konfigurēšanas darbības:

source: This is the Logical Volume Manager configuration menu.
lv: Šī ir Logical Volume Manager konfigurēšanas izvēlne.

source: Create volume groups
lv: Izveidot sējumu grupas

source: Delete volume groups
lv: Dzēst sējumu grupas

source: Extend volume groups
lv: Paplašināt sējumu grupas

source: Reduce volume groups
lv: Sašaurināt sējumu grupas

source: Volume groups configuration action:
lv: Sējumu grupu konfigurēšanas darbības:

source: Create logical volumes
lv: Veidot loģiskos sējumus

source: Delete logical volumes
lv: Dzēst loģiskos sējumus

source: Logical volumes configuration action:
lv: Loģisko sējumu konfigurēšanas darbības:

source: Devices for the new volume group:
lv: Ierīces jaunai sējumu grupai:

source: Please select the devices for the new volume group.
lv: Lūdzu, izvēlieties, kuras ierīces iekļaut jaunajā sējumu grupā.

source: Volume group name:
lv: Sējumu grupas nosaukums:

source: Please enter the name you would like to use for the new volume group.
lv: Lūdzu, ievadiet jaunās sējumu grupas nosaukumu.

source: No physical volumes were selected. The creation of a new volume group was aborted.
lv: Neviens fiziskais sējums netika izvēlēts. Jaunas sējumu grupas izveide pārtraukta.

source: No volume group name entered
lv: Sējumu grupas nosaukums nav ievadīts

source: No name for the volume group has been entered. Please enter a name.
lv: Sējumu grupas nosaukums netika ievadīts. Lūdzu, ievadiet nosaukumu.

source: Volume group name already in use
lv: Šāds sējumu grupas nosaukums jau tiek lietots

source: The selected volume group name is already in use. Please choose another name.
lv: Cita sējumu grupa jau ir šādi nosaukta. Lūdzu, izvēlieties citu nosaukumu.

source: Volume group name overlaps with device name
lv: Sējumu grupas nosaukums pārklājas ar ierīces nosaukumu

source: The selected volume group name overlaps with an existing device name. Please choose another name.
lv: Izvēlētais sējumu grupas vārds pārklājas ar eksistējošas ierīces nosaukumu. Lūdzu, izvēlieties citu nosaukumu.

source: Volume group to delete:
lv: Dzēst sējumu grupu:

source: Please select the volume group you wish to delete.
lv: Lūdzu, izvēlieties, kuru sējumu grupu jūs vēlaties dzēst.

source: No volume group found
lv: Nav sējumu grupu

source: No volume group has been found.
lv: Neviena sējumu grupa nav atrasta.

source: The volume group may have already been deleted.
lv: Šī sējumu grupa jau ir izdzēsta.

source: Really delete the volume group?
lv: Tiešām dzēst sējumu grupu?

source: Please confirm the ${VG} volume group removal.
lv: Lūdzu, apstipriniet sējumu grupas ${VG} dzēšanu.

source: Error while deleting volume group
lv: Kļūda, dzēšot sējumu grupu

source: The selected volume group could not be deleted. One or more logical volumes may currently be in use.
lv: Izvēlēto sējumu grupu nevar izdzēst. Iespējams, viens vai vairāki tās loģiskie sējumi pašlaik ir piemontēti.

source: No volume group can be deleted.
lv: Nav sējumu grupu, ko varētu izdzēst.

source: Volume group to extend:
lv: Paplašināt sējumu grupu:

source: Please select the volume group you wish to extend.
lv: Lūdzu, izvēlieties, kuru sējumu grupu jūs vēlaties paplašināt.

source: Devices to add to the volume group:
lv: Ierīces, ko pievienot sējumu grupai:

source: Please select the devices you wish to add to the volume group.
lv: Lūdzu, izvēlieties ierīces, ko jūs gribat pievienot sējumu grupai.

source: No physical volumes were selected. Extension of the volume group was aborted.
lv: Neviens fiziskais sējums netika izvēlēts. Sējumu grupas paplašināšana tika pārtraukta.

source: Error while extending volume group
lv: Kļūda, paplašinot sējumu grupu

source: The physical volume ${PARTITION} could not be added to the selected volume group.
lv: Fiziskais sējums ${PARTITION} nevar tikt pievienots izvēlētajai sējumu grupai.

source: No volume group can be reduced.
lv: Neviena sējumu grupa nevar tikt sašaurināta.

source: Volume group to reduce:
lv: Sašaurināt sējumu grupu:

source: Please select the volume group you wish to reduce.
lv: Lūdzu, izvēlieties, kuru sējumu grupu jūs vēlaties sašaurināt.

source: Device to remove from volume group:
lv: Ierīce, ko izņemt no grupas:

source: Please select the device you wish to remove from the volume group.
lv: Lūdzu, izvēlieties ierīci, kuru jūs vēlaties izņemt no grupas.

source: Error while reducing volume group
lv: Kļūda, sašaurinot sējumu grupu

source: The selected volume group (${VG}) could not be reduced. There is only one physical volume attached. Please delete the volume group instead.
lv: Šī sējumu grupa (${VG}) nevar tikt sašaurināta, jo sastāv tikai no viena fiziskā sējuma. Sašaurināšanas vietā šo grupu var izdzēst.

source: The physical volume ${PARTITION} could not be removed from the selected volume group.
lv: Fiziskais sējums ${PARTITION} nevar tikt pievienots izvēlētajai sējumu grupai.

source: No volume groups were found for creating a new logical volume. Please create more physical volumes and volume groups.
lv: Sējumu grupas, kuras ir nepieciešamas loģisko sējumu izveidei, nav atrastas. Vispirms izveidojiet fiziskos sējumus un sējumu grupas.

source: No free volume groups were found for creating a new logical volume. Please create more physical volumes and volume groups, or reduce an existing volume group.
lv: Brīvas sējumu grupas nav atrastas. Lūdzu, izveidojiet papildu fiziskos sējumus un sējumu grupas, vai arī sašauriniet kādu esošo sējumu grupu.

source: Volume group:
lv: Sējuma grupa:

source: Please select the volume group where the new logical volume should be created.
lv: Lūdzu, izvēlieties sējumu grupu, kurā izveidot jauno loģisko sējumu.

source: No name for the logical volume has been entered. Please enter a name.
lv: Loģiskajam sējumam netika norādīts nosaukums. Lūdzu, ievadiet to.

source: The name ${LV} is already in use by another logical volume on the same volume group (${VG}).
lv: Nosaukums ${LV} jau tiek lietots šajā sējumu grupā (${VG}).

source: No volume group has been found for deleting a logical volume.
lv: Sējumu grupas nav atrastas loģiskā sējuma dzēšanai.

source: Please select the volume group which contains the logical volume to be deleted.
lv: Lūdzu, izvēlieties sējumu grupu, kas satur dzēšamo loģisko sējumu.

source: No logical volume has been found. Please create a logical volume first.
lv: Te nav loģisko sējumu. Lūdzu, vispirms izveidojiet tos.

source: Please select the logical volume to be deleted on ${VG}.
lv: Lūdzu, izvēlieties, kuru loģisko sējumu dzēst no ${VG}.

source: The logical volume (${LV}) on ${VG} could not be deleted.
lv: Loģisko sējumu (${LV}) uz ${VG} neizdevās dzēst.

source: No physical volumes (i.e. partitions) were found in your system. All physical volumes may already be in use. You may also need to load some required kernel modules or re-partition the hard drives.
lv: Jūsu sistēmā netika atrasti fiziskie sējumi (t.i. sadaļas). Iespējams, visi fiziskie sējumi jau tiek lietoti, vai arī jāielādē papildu kodola moduļi, vai jāpārdala cietie diski.

source: Logical Volume Manager not available
lv: Logical Volume Manager nav pieejams

source: The current kernel doesn't support the Logical Volume Manager. You may need to load the lvm-mod module.
lv: Pašreizējais kodols neatbalsta Logical Volume Manager. Iespējams, jums vajadzētu ielādēt lvm-mod moduli.

source: Software RAID device
lv: Programmatūras RAID ierīce

source: Configure software RAID
lv: Konfigurēt programmatūras RAID

source: In use by software RAID device ${DEVICE}
lv: Lieto programmatūras RAID ${DEVICE}

source: Software RAID not available
lv: Programmatūras RAID nav pieejams

source: The current kernel doesn't seem to support software RAID (MD) devices. This should be solved by loading the necessary modules.
lv: Šis kodols neatbalsta programmatūras RAID iekārtas. Ir iespējams, ka to var atrisināt, ielādējot attiecīgus moduļus.

source: Software RAID configuration actions
lv: Programmatūras RAID konfigurēšanas darbības:

source: This is the software RAID (or MD, "multiple device") configuration menu.
lv: Šī ir programmatūras RAID (vai MD, jeb daudzdisku) konfigurēšanas izvēlne.

source: Please select one of the proposed actions to configure software RAID.
lv: Lūdzu, izvēlieties vienu no šīm darbībām, lai konfigurētu programmatūras RAID.

source: Software RAID device type:
lv: Programmatūras RAID ierīces tips:

source: Please choose the type of the software RAID device to be created.
lv: Lūdzu, izvēlieties, kāda tipa programmatūras RAID ierīci izveidot.

source: No unused partitions of the type "Linux RAID Autodetect" are available. Please create such a partition, or delete an already used software RAID device to free its partitions.
lv: Nav atrastas neaizņemtas "Linux·RAID·Autodetect" tipa sadaļas. Lūdzu, izveidojiet šādu sadaļu vai dzēsiet jau izveidotu programmatūras RAID ierīci, lai atbrīvotu tajā iekļautās sadaļas.

source: Active devices for the RAID0 array:
lv: Aktīvo ierīču skaits RAID0 masīvam:
