Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel3/*.po
Languages: lv

source: Please enter the same passphrase again to verify that you have typed it correctly.
lv: Lūdzu, ievadiet to pašu paroli vēlreiz, lai pārliecinātos, ka jūs to ievadījāt pareizi.

source: Passphrase input error
lv: Paroles ievades kļūda

source: The two passphrases you entered were not the same. Please try again.
lv: Jūsu ievadītās paroles atšķiras. Lūdzu, mēģiniet vēlreiz.

source: Empty passphrase
lv: Tukša parole

source: You entered an empty passphrase, which is not allowed. Please choose a non-empty passphrase.
lv: Jūs ievadījāt tukšu paroli, kas nav atļauts. Lūdzu, ievadiet netukšu paroli.

source: Use weak passphrase?
lv: Izmantot nedrošu paroli?

source: You entered a passphrase that consists of less than ${MINIMUM} characters, which is considered too weak. You should choose a stronger passphrase.
lv: Jūs ievadījāt paroli, kas sastāv no mazāka simbolu skaita, nekā būtu nepieciešams (${MINIMUM}). Tas nav droši, tāpēc jums vajadzētu izvēlēties drošāku paroli.

source: The encryption key for ${DEVICE} is now being created.
lv: Tiek veidota ${DEVICE} šifrēšanas atslēga.

source: Key data has been created successfully.
lv: Atslēgas dati veiksmīgi izveidoti.

source: Keyfile creation failure
lv: Atslēgas faila izveide nav izdevusies

source: An error occurred while creating the keyfile.
lv: Veidojot atslēgas failu, radusies kļūda.

source: Encryption configuration failure
lv: Šifrēšanas konfigurēšana neizdevās

source: You have selected the root file system to be stored on an encrypted partition. This feature requires a separate /boot partition on which the kernel and initrd can be stored.
lv: Jūs izvēlējāties novietot saknes failu sistēmu uz šifrētas sadaļas. Lai lietotu šādu sistēmu, ir nepieciešams izveidot /boot sadaļu, uz kuras glabātos kodols un initrd.

source: You should go back and setup a /boot partition.
lv: Jums vajadzētu atgriezties un izveidot /boot sadaļu.

source: You have selected the /boot file system to be stored on an encrypted partition. This is not possible because the boot loader would be unable to load the kernel and initrd. Continuing now would result in an installation that cannot be used.
lv: Jūs izvēlējāties novietot /boot failu sistēmu uz šifrētas sadaļas. Tas nav iespējams, jo palaidējs nespēs ielādēt kodolu un sākuma initrd sistēmu. Šādas konfigurācijas saglabāšana novedīs pie nelietojamas instalācijas.

source: You should go back and choose a non-encrypted partition for the /boot file system.
lv: Lūdzu, atgriezieties un izvēlieties nešifrētu sadaļu /boot failu sistēmai.

source: Are you sure you want to use a random key?
lv: Vai tiešam vēlaties izmantot patvaļīgu atslēgu?

source: You have chosen a random key type for ${DEVICE} but requested the partitioner to create a file system on it.
lv: Jūs izvēlējāties patvaļīgu atslēgas tipu ${DEVICE}, bet norādījāt instalatoram izveidot uz tās failu sistēmu.

source: Using a random key type means that the partition data is going to be destroyed upon each reboot. This should only be used for swap partitions.
lv: Patvaļīga atslēgas tipa izmantošana nozīmē, ka, katrreiz pārlaižot sistēmu, visi šīs sadaļas dati tiks iznīcināti. Šādu tipu vajadzētu lietot tikai maiņvietas sadaļai.

source: Failed to download crypto components
lv: Kļūda, lejuplādējot kriptogrāfijas komponentus

source: An error occurred trying to download additional crypto components.
lv: Mēģinot lejuplādēt papildu kriptogrāfiskos komponentus, radusies kļūda.

source: Proceed to install crypto components despite insufficient memory?
lv: Turpināt kriptogrāfisko komponenšu instalāciju, neskatoties uz atmiņas nepietiekamību?

source: There does not seem to be sufficient memory available to install additional crypto components. If you choose to go ahead and continue anyway, the installation process could fail.
lv: Atmiņas apjoms nav pietiekošs, lai uzinstalētu papildus kriptogrāfiskās komponentes. Ja jūs izvēlēsieties tomēr turpināt to instalāciju, instalēšanas process var beigties kļūdaini.

source: Create encrypted volumes
lv: Izveidot šifrētos sējumus

source: Encryption configuration actions
lv: Šifrēšanas konfigurēšanas darbības

source: This menu allows you to configure encrypted volumes.
lv: Šī izvelne ļaus jums izveidot šifrētos sējumus.

source: Devices to encrypt:
lv: Šifrējamās iekārtas:

source: Please select the devices to be encrypted.
lv: Lūdzu, izvēlieties, kuras iekārtas šifrēt.

source: No devices selected
lv: Neviena iekārta nav izvēlēta

source: No devices were selected for encryption.
lv: Nav izvēlētas iekārtas šifrēšanai.

source: Guided - use entire disk and set up encrypted LVM
lv: Vadītā - lietot visu disku un uzstādīt šifrētu LVM

source: Enter random characters
lv: Ievadiet patvaļīgas rakstzīmes

source: You can help speed up the process by entering random characters on the keyboard, or just wait until enough key data has been collected (which can take a long time).
lv: Jūs varat paātrināt šo procesu ievadot no klaviatūras patvaļīgus simbolus vai arī pagaidiet kamēr tiks savākts pietiekams daudzums patvaļīgu datu (tas var prasīt ilgu laiku).

source: Enter random characters or make random movements with the mouse
lv: Ievadiet patvaļīgus simbolus vai veiciet patvaļīgas kustības ar peli

source: You can help speed up the process by entering random characters on the keyboard or by making random movements with the mouse.
lv: Jūs varat paātrināt šo procesu ievadot no klaviatūras patvaļīgus simbolus vai veicot patvaļīgas kustības ar peli.
