Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel3/*.po
Languages: lv

source: Do not change the boot/kernel font
lv: Nemainīt ielādes/kodola fontu

source: . Arabic
lv: . Arābu

source: # Armenian
lv: # Armēņu

source: # Cyrillic - KOI8-R and KOI8-U
lv: # Kirilica - KOI8-R un KOI8-U

source: # Cyrillic - non-Slavic languages
lv: # Kirilica - ne-slāvu valodas

source: # Cyrillic - Slavic languages (also Bosnian and Serbian Latin)
lv: # Kirilica - slāvu valodas (ieskaitot Bosniešu un Serbu)

source: . Ethiopic
lv: . Etiopiešu

source: # Georgian
lv: # Gruzīņu

source: # Greek
lv: # Grieķu

source: # Hebrew
lv: # Ēbreju

source: # Lao
lv: # Laosas

source: # Latin1 and Latin5 - western Europe and Turkic languages
lv: # Latin1 un Latin5 - austrumeiropas un turku valodas

source: # Latin2 - central Europe and Romanian
lv: # Latin2 - centrāleiropas un rumāņu

source: # Latin3 and Latin8 - Chichewa; Esperanto; Irish; Maltese and Welsh
lv: # Latin3 un Latin8 - Čičeva, Esperanot, Īru, Maltas un Velsiešu

source: # Latin7 - Lithuanian; Latvian; Maori and Marshallese
lv: # Latin7 - Latviešu, Lietuviešu, Maori un Maršalu salu

source: . Latin - Vietnamese
lv: . Latin - Vjetnamiešu

source: # Thai
lv: # Taizemes

source: . Combined - Latin; Slavic Cyrillic; Hebrew; basic Arabic
lv: . Apvienotā - Latīņu, Slāvu Kirilica, Ēbreju un pamata Arābu

source: . Combined - Latin; Slavic Cyrillic; Greek
lv: . Apvienotā - Latīņu, Slāvu Kirilica, Grieķu

source: . Combined - Latin; Slavic and non-Slavic Cyrillic
lv: . Apvienotā - Latīņu, Slāvu un ne-slāvu Kirilica

source: Character set to support:
lv: Atbalstāmā rakstzīmju kopa:

source: Please choose the character set that should be supported by the console font.
lv: Izvēlieties rakstzīmju kopu, kuru konsoles fontiem vajadzētu atbalstīt.

source: If you don't use a framebuffer, the choices that start with "." will reduce the number of available colors on the console.
lv: Ja jūs neizmantojat kadru buferi, izvēles, kas sākas ar "." samazinās pieejamo krāsu skaitu konsolē.

source: Font for the console:
lv: Konsoles fonts:

source: "VGA" has a traditional appearance and has medium coverage of international scripts. "Fixed" has a simplistic appearance and has better coverage of international scripts. "Terminus" may help to reduce eye fatigue, though some symbols have a similar aspect which may be a problem for programmers.
lv: "VGA" ir tradicionāls izskats un ir vidējs starptautisko skriptu nodrošinājums. "Fixed" ir vienkāršāks izskats un ir labāks starptautisko skriptu nodrošinājums. "Terminus" var samazināt acu nogurumu, bet dažiem simboliem ir līdzīgs izskats, kas var būt problemātiski programmētājiem.

source: If you prefer a bold version of the Terminus font, choose either TerminusBold (if you use a framebuffer) or TerminusBoldVGA (otherwise).
lv: Ja vēlaties treknu Terminus fontu versiju, izvēlieties vai nu TerminusBold (ja izmantojat kadru buferi) vai TerminusBoldVGA (citādi).

source: Font size:
lv: Fonta izmērs:

source: Encoding to use on the console:
lv: Konsolē izmantojamais kodējums:

source: Keep the current keyboard layout in the configuration file?
lv: Saglabāt konfigurācijas failā esošo klaviatūras izklājumu?

source: The current keyboard layout in the configuration file /etc/default/keyboard is defined as XKBLAYOUT="${XKBLAYOUT}" and XKBVARIANT="${XKBVARIANT}".
lv: Šī brīža klaviatūras izklājums ir noteikts konfigurācijas failā /etc/default/keyboard kā XKBLAYOUT="${XKBLAYOUT}" un XKBVARIANT="${XKBVARIANT}".

source: Please choose whether you want to keep it. If you choose this option, no questions about the keyboard layout will be asked and the current configuration will be preserved.
lv: Izvēlieties vai to saglabāt. Izvēloties šo iespēju tālākie jautājumi par klaviatūras konfigurāciju tiks izlaisti un esošā konfigurācija tiks saglabāta nemainīga.

source: Keep default keyboard layout (${XKBLAYOUTVARIANT})?
lv: Saglabāt esošo klaviatūras izklājumu (${XKBLAYOUTVARIANT})?

source: The default value for the keyboard layout is XKBLAYOUT="${XKBLAYOUT}" and XKBVARIANT="${XKBVARIANT}". This default value is based on the currently defined language/region and the settings in /etc/X11/xorg.conf.
lv: Klaviatūras izklājums pēc noklusējuma ir XKBLAYOUT="${XKBLAYOUT}" un XKBVARIANT="${XKBVARIANT}". Šī vērtība ir balstīta uz izvēlēto valodu, reģionu un uz uzstādījumiem failā /etc/X11/xorg.conf.

source: Please choose whether you want to keep it. If you choose this option, no questions about the keyboard layout will be asked.
lv: Lūdzu, izvēlieties vai saglabāt esošo konfigurāciju. Izvēloties šo iespēju, papildus jautājumi par klaviatūras izklājumu tiks izlaisti.

source: Keep current keyboard options in the configuration file?
lv: Saglabāt pašreizējos klaviatūras uzstādījumus konfigurācijas failā?

source: The current keyboard options in the configuration file /etc/default/keyboard are defined as XKBOPTIONS="${XKBOPTIONS}".
lv: Šī brīža klaviatūras uzstādījumi ir definēti konfigurācijas failā /etc/default/keyboard kā XKBOPTIONS="${XKBOPTIONS}".

source: If you choose to keep these options, no questions about the keyboard options will be asked.
lv: Izvēloties saglabāt šos uzstādījumus pārējie jautājumi par uzstādījumiem tiks izlaisti.

source: Keep default keyboard options (${XKBOPTIONS})?
lv: Saglabāt esošos klaviatūras uzstādījumus (${XKBOPTIONS})?

source: The default value for the options of the keyboard layout is XKBOPTIONS="${XKBOPTIONS}". It is based on the currently defined language/region and the settings in /etc/X11/xorg.conf.
lv: Pašreizējā klaviatūras izklājuma noklusējuma uzstādījumi ir XKBOPTIONS="${XKBOPTIONS}". Tie ir bāzēti uz pašreiz izvēlēto valodu, reģionu un uzstādījumiem failā /etc/X11/xorg.conf.

source: If you choose to keep it, no questions about the keyboard options will be asked.
lv: Izvēloties to saglabāt pārējie jautājumi par uzstādījumiem tiks izlaisti.

source: Use Control+Alt+Backspace to terminate the X server?
lv: Lietot Control+Alt+Backspace lai nogalinātu X serveri?

source: By default the combination Control+Alt+Backspace does nothing. If you want it can be used to terminate the X server.
lv: Pēc noklusējuma pogu kombinācijai Control+Alt+Backspace nav nekādas ietekmes, taču ir iespējams atjaunot tās iepriekšējo funkciju - X servera piespiedu nogalināšanu.

source: Do you intend to use FireWire Ethernet?
lv: Vai plānojat lietot FireWire Ethernet?

source: No Ethernet card was detected, but a FireWire interface is present. It's possible, though unlikely, that with the right FireWire hardware connected to it, this could be your primary Ethernet interface.
lv: Ethernet karte nav atrasta, taču ir FireWire saskarne. Iespējams, kaut gan maz ticams, ka, ja pieslēgta pareizā FireWire aparatūra, šī varētu būt jūsu galvenā tīkla karte.

source: Additional parameters for module ${MODULE}:
lv: Papildu parametri modulim ${MODULE}:

source: The module ${MODULE} failed to load. You may need to pass parameters to the module to make it work; this is common with older hardware. These parameters are often I/O port and IRQ numbers that vary from machine to machine and cannot be determined from the hardware. An example string looks something like "irq=7 io=0x220"
lv: Moduļa ${MODULE} ielāde neizdevās. Iespējams, šim modulim jānorāda parametri, lai tas darbotos (tas ir tipiski vecai aparatūrai). Šie parametri parasti ir I/O porti un IRQ numuri, tie ir specifiski katram datoram un nav automātiski nosakāmi. Piemēram, "irq=7 io=0x220"

source: If you don't know what to enter, consult your documentation, or leave it blank to not load the module.
lv: Ja nezināt, ko ievadīt, konsultējieties ar pieejamo dokumentāciju, vai neievadiet neko, lai atteiktos no moduļa ielādes.

source: Detect virtual driver disks from hardware manufacturer
lv: Noteikt virtuālo disku draiverus

source: Load drivers from internal virtual driver disk?
lv: Ielādēt dziņus no iekšējā virtuālā dziņu diska?

source: Installing on this hardware may require some drivers provided by the manufacturer to be loaded from the built-in driver injection disk.
lv: Uzstādīšana uz šīs aparatūras var pieprasīt papildus dziņu uzstādīšanu no ražotāja izmantojot iebūvēto dziņu diska funkciju.

source: Architecture not supported
lv: Arhitektūra nav atbalstīta

source: The specified Debian archive mirror does not seem to support your architecture. Please try a different mirror.
lv: Šis Debian arhīva spoguļserveris neatbalsta jūsu datora arhitektūru. Lūdzu izmēģiniet citu serveri.

source: RAID%s device #%s
lv: RAID%s ierīce #%s

source: Encrypted volume (%s)
lv: Šifrēts sējums (%s)

source: Serial ATA RAID %s (%s)
lv: Seriālā ATA RAID %s (%s)

source: Serial ATA RAID %s (partition #%s)
lv: Serial ATA RAID %s (sadaļa #%s)

source: Multipath %s (WWID %s)
lv: Daudzceļu %s (WWID %s)

source: Multipath %s (partition #%s)
lv: Daudzceļu %s (sadaļa #%s)

source: Loopback (loop%s)
lv: Atgriezeniskā cilpa (cilpa%s)

source: Unsupported initrd generator
lv: Neatbalstīts initrd veidotājs

source: The package ${GENERATOR} that was selected to generate the initrd is not supported.
lv: Pakotne ${GENERATOR}, kas izvēlēta initrd veidošanai, nav atbalstīta.

source: generic: include all available drivers
lv: vispārējais: iekļaut visus pieejamos draiverus

source: targeted: only include drivers needed for this system
lv: specifiskais: iekļaut tikai šai sistēmai nepieciešamos draiverus

source: Drivers to include in the initrd:
lv: Draiveri iekļaušanai initrd:

source: The primary function of an initrd is to allow the kernel to mount the root file system. It therefore needs to contain all drivers and supporting programs required to do that.
lv: Initrd galvenā funkcija ir ļaut kodolam piekļūt saknes failu sistēmai. Līdz ar to tajā jāiekļauj visi draiveri un programmas, kas nepieciešamas lai to izdarītu.

source: A generic initrd is much larger than a targeted one and may even be so large that some boot loaders are unable to load it but has the advantage that it can be used to boot the target system on almost any hardware. With the smaller targeted initrd there is a very small chance that not all needed drivers are included.
lv: Vispārējais initrd ir daudz lielāks par specifisko initrd un var pat kļūt tik liels, ka daži saknētāji nespej to ielādēt. Taču vispārējā initrd priekšrocība ir tā, ka to var izmantot sistēmas ielādei uz praktiski jabkādas aparatūŗas. Ar mazāku, specifisku initrd pastāv iespējamība ka ne visi nepieciešamie dziņi tiks iekļauti.

source: security updates (from ${SEC_HOST})
lv: drošības atjauninājumi (no ${SEC_HOST})

source: volatile updates (from ${VOL_HOST})
lv: nepastāvīgie atjauninājumi (no ${VOL_HOST})

source: Services to use:
lv: Izmantojamie pakalpojumi:

source: Debian has two services that provide updates to releases: security and volatile.
lv: Debian ir divi pakalpojumi, kuri nodrošina atjauninājumus laidieniem: drošības un nepastāvīgie atjauninājumi.

source: Security updates help to keep your system secured against attacks. Enabling this service is strongly recommended.
lv: Drošības atjauninājumi palīdz aizsargāt jūsu sistēmu pret uzbrukumiem. Šī pakalpojuma aktivizēšana ir stingri rekomendēta.

source: Volatile updates provide more current versions for software that changes relatively frequently and where not having the latest version could reduce the usability of the software. An example is the virus signatures for a virus scanner. This service is only available for stable and oldstable releases.
lv: Nepastāvīgie jauninājumi piegādā jaunākās versijas programmām, kas mainās diezgan bieži un jaunākās versijas neesamība varētu samazināt tās lietojamību. Piemēram, vīrusu ķērāju datubāzes. Šis serviss ir pieejams tikai stabilajam un vec-stabilajam laidienam.

source: No boot loader installed
lv: Palaidējs nav uzinstalēts

source: No boot loader has been installed, either because you chose not to or because your specific architecture doesn't support a boot loader yet.
lv: Palaidējs nav uzinstalēts. Tas ir noticis tāpēc, ka jūs izvēlējāties to neinstalēt, vai arī jūsu datora arhitektūra pagaidām neatbalsta palaidēju.

source: You will need to boot manually with the ${KERNEL} kernel on partition ${BOOT} and ${ROOT} passed as a kernel argument.
lv: Jums būs jāpalaiž sistēma manuāli ar ${KERNEL} kodolu uz ${BOOT} sadaļas un ievadot ${ROOT} kā kodola argumentu.

source: Install the GRUB boot loader to the Serial ATA RAID disk?
lv: Instalēt GRUB palaidēju uz Serial ATA RAID diska?

source: Installation of GRUB on Serial ATA RAID is experimental.
lv: GRUB instalēšana uz Serial ATA RAID ierīcēm ir eksperimentāla.

source: GRUB is always installed to the master boot record (MBR) of the Serial ATA RAID disk. It is also assumed that disk is listed as the first hard disk in the boot order defined in the system's BIOS setup.
lv: GRUB vienmēr tiek instalēts uz Serial ATA RAID diska master boot record (MBR). Tiek pieņemts, ka šis disks sistēmas BIOSā ir norādīts kā pirmais palaišanas disks.

source: The GRUB root device is: ${GRUBROOT}.
lv: GRUB saknes ierīce ir: ${GRUBROOT}.

source: An error occurred while setting up GRUB for your Serial ATA RAID disk.
lv: Kļūda, iestatot GRUB uz jūsu Serial ATA RAID diska.

source: The GRUB installation has been aborted.
lv: GRUB instalēšana tika pārtraukta.

source: Install the GRUB boot loader to the multipath device?
lv: Instalēt GRUB palaidēju uz daudzceļu iekārtas?

source: Installation of GRUB on multipath is experimental.
lv: GRUP instalēšanas atbalsts uz daudzceļu iekārtām ir eksperimentāls.

source: GRUB is always installed to the master boot record (MBR) of the multipath device. It is also assumed that the WWID of this device is selected as boot device in the system's FibreChannel adapter BIOS.
lv: GRUB vienmēr tiek instalēts uz daudzceļu iekārtas master boot record (MBR). Tiek pieņemts, ka šī diska WWID ir norādīts kā pirmais palaišanas disks sistēmas FiberChannel adaptera BIOSā.

source: An error occurred while setting up GRUB for the multipath device.
lv: Gadījās kļūda, uzstādot GRUB uz jūsu daudzceļu iekārtas.

source: ${disc}: Master Boot Record
lv: ${disc}: Galvenais palaišanas ieraksts

source: ${part}: new Debian partition
lv: ${part}: jaunā Debian sadaļa

source: Other choice (Advanced)
lv: Citas iespējas (paplašināti)

source: LILO installation target:
lv: Instalēt LILO uz:

source: The LILO program needs to be installed to make your new system bootable. By installing it onto your disk's Master Boot Record, LILO will take complete control of the boot process, but if you want to use a different boot manager, just install LILO on the new Debian partition instead.
lv: Lai varētu ielādēt savu jauno sistēmu, nepieciešams uzinstalēt palaidēju LILO. Instalējot LILO uz galvenā palaišanas ieraksta (MBR), tas pilnībā pārņems palaišanas procesu. Ja vēlaties izmantot citu palaidēju, tad instalējiet LILO jaunās Debian sadaļas sākumā.

source: If unsure, install LILO into the Master Boot Record.
lv: Ja neesat pārliecināti, instalējiet LILO uz galvenā palaišanas ieraksta (MBR).

source: ${disc}: software RAID array
lv: ${disc}: programmatūras RAID masīvs

source: The LILO program needs to be installed to make your new system bootable. You may choose to install it onto a software RAID array or another device.
lv: LILO programma ir jāinstalē, lai jūsu jauno sistēmu varētu palaist. Jūs varat to instalēt uz programmatūras RAID vai kādas citas ierīces.

source: Please enter the device name of the partition or disk onto which LILO should be installed, such as /dev/hda or /dev/sda1.
lv: Lūdzu, ievadiet sadaļas vai diska ierīces nosaukumu, uz kuras vajadzētu uzinstalēt LILO (piemēram, /dev/hda vai /dev/sda1).

source: Invalid partition name
lv: Nederīgs sadaļas nosaukums

source: The path ${path} does not represent a partition or hard disk device. Please try again.
lv: Norādītais ceļš ${path} nav disks vai sadaļa. Lūdzu, mēģiniet vēlreiz.

source: Installing LILO...
lv: Instalē LILO...

source: Activating partition ${bootdev}
lv: Aktivizē sadaļu ${bootdev}

source: Creating lilo.conf
lv: Veido lilo.conf

source: Installing the LILO package
lv: Instalē LILO pakotni

source: Running LILO for ${bootdev}
lv: Palaiž LILO ${bootdev}

source: LILO configured to use a serial console
lv: LILO ir konfigurēts, lai izmantotu seriālo konsoli

source: LILO is configured to use serial port ${PORT} as the console. ${PORT_SPEED}
lv: LILO ir konfigurēts, lai izmantotu seriālo portu ${PORT} kā konsoli. ${PORT_SPEED}

source: The serial port speed is set to ${SPEED}.
lv: Seriālā porta ātrums iestatīts uz ${SPEED}.

source: Would you like to make this partition active?
lv: Vai vēlaties padarīt šo sadaļu aktīvu?

source: You have chosen to install LILO on a partition that is not the active one. If this partition is not marked active, then LILO will not be loaded by the boot loader. This may cause you to be unable to boot into the system that is being installed.
lv: Jūs izvēlējāties instalēt LILO uz neaktīvas sadaļas. Ja šī sadaļa netiks aktivizēta, LILO netiks ielādēta. Tas var izraisīt nespēju palaist jūsu jauno sistēmu.

source: You should make this partition active unless you have another boot loader that will allow you to access your new Linux installation.
lv: Jums vajadzētu padarīt šo sadaļu aktīvu, ja vien jūs neplānojat izmantot kādu citu palaidēju, kas spētu ielādēt jūsu jauno Linux sistēmu.

source: LILO installation failed. Continue anyway?
lv: LILO instalēšana bija nesekmīga. Tomēr turpināt?

source: The lilo package failed to install into /target/. Installing LILO as a boot loader is a required step. The install problem might however be unrelated to LILO, so continuing the installation may be possible.
lv: Lilo pakotnes instalēšana bija nesekmīga. LILO kā palaidēja instalēšana ir nepieciešams solis. Taču instalēšanas problēma varētu būt nesaistīta ar LILO, tāpēc ir iespējams, ka sistēmas instalēšanu var pabeigt sekmīgi.

source: LILO installation failed
lv: LILO instalēšana nesekmīga

source: Running "/sbin/lilo" failed with error code "${ERRCODE}".
lv: "/sbin/lilo" izpildīšana beidzās ar kļūdu "${ERRCODE}".

source: Install the LILO boot loader on a hard disk
lv: LILO palaidēja instalēšana uz cietā diska

source: No partitions found
lv: Nav atrastas sadaļas

source: The installer could not find any partitions, so you will not be able to mount a root file system. This may be caused by the kernel failing to detect your hard disk drive or failing to read the partition table, or the disk may be unpartitioned. If you wish, you may investigate this from a shell in the installer environment.
lv: Instalators neatrada nekādas diska sadaļas un līdz ar to pievienot saknes failu sistēmu nav iespējams. Šī kļūme varētu būt izskaidrojama ar to, ka kodols nespēja noteikt cieto disku vai notika kļūda sadaļu tabulas nolasīšanā, vai arī disks nav sadalīts sadaļās. Jūs varat izpētīt situāciju instalatora vides komandrindā.

source: No such device
lv: Šādas ierīces nav

source: The device you entered for your root file system (${DEVICE}) does not exist. Please try again.
lv: Ierīce, ko jūs norādījāt savai saknes failu sistēmai (${DEVICE}), neeksistē. Lūdzu, mēģiniet vēlreiz.

source: Mount failed
lv: Montēšana neizdevās

source: An error occurred while mounting the device you entered for your root file system (${DEVICE}) on /target.
lv: Montējot ierīci (${DEVICE}), ko norādījāt kā savu saknes failu sistēmu, radusies kļūda.

source: Please check the syslog for more information.
lv: Lai iegūtu papildu informāciju, lūdzu, apskatiet syslog.

source: Rescue operation failed
lv: Glābšanas darbības neizdevās

source: The rescue operation '${OPERATION}' failed with exit code ${CODE}.
lv: Glābšanas darbība '${OPERATION}' bija nesekmīga ar izejas kļūdu ${CODE}.

source: Error running shell in /target
lv: Kļūda, izpildot čaulu uz /target

source: A shell (${SHELL}) was found on your root file system (${DEVICE}), but an error occurred while running it.
lv: Uz jūsu saknes failu sistēmas (${DEVICE}) tika atrasta čaula (${SHELL}), taču, to izpildot, radās kļūda.

source: No shell found in /target
lv: Uz /target nav atrasta čaula

source: No usable shell was found on your root file system (${DEVICE}).
lv: Uz jūsu saknes failu sistēmas (${DEVICE}) netika atrasta neviena lietojama čaula.

source: Detecting hardware to find hard drives
lv: Nosaka aparatūru, lai sameklētu cietos diskus

source: Searching drives for an installer ISO image
lv: Diskos meklē instalatora ISO attēlu

source: Mounting ${DRIVE}...
lv: Montē ${DRIVE}...

source: Scanning ${DRIVE} (in ${DIRECTORY})...
lv: Skenē ${DRIVE} (${DIRECTORY})...

source: Do full disk search for installer ISO image?
lv: Veikt pilnu pārmeklēšanu, lai atrastu instalatora ISO attēlu?

source: The quick scan for installer ISO images, which looks only in common places, did not find an installer ISO image. It's possible that a more thorough search will find the ISO image, but it may take a long time.
lv: Ātra ISO attēlu pārmeklēšana parastajās vietās nedeva rezultātus. Ir iespējams, ka dziļāka meklēšana atradīs šo ISO attēlu, taču tas var aizņemt krietni vairāk laika.

source: Failed to find an installer ISO image
lv: Kļūda, meklējot instalatora ISO attēlu

source: No installer ISO images were found. If you downloaded the ISO image, it may have a bad filename (not ending in ".iso"), or it may be on a file system that could not be mounted.
lv: Instalatora ISO attēls nav atrasts. Ja jūs lejupielādējāt instalatora ISO attēlu, tam varētu būt nepareizs faila vārds (tāds, kas nebeidzas ar ".iso"), vai arī tas varētu būt uz nepiemontētas failu sistēmas.

source: While one or more possible ISO images were found, they could not be mounted. The ISO image you downloaded may be corrupt.
lv: Tika atrasti viens vai vairāki ISO attēli tika atrasti, bet tos neizdevās piemontēt. Iespējams, ka šie attēli ir bojāti.

source: No installer ISO image found
lv: Nav atrasts instalatora ISO attēls

source: While one or more possible ISO images were found, they did not look like valid installer ISO images.
lv: Lai gan viens vai vairāki iespējamie ISO attēli tika atrasti, tie neizskatījās pēc derīgiem instalatora ISO attēliem.

source: Successfully mounted ${SUITE} installer ISO image
lv: Sekmīgi piemontēts ${SUITE} instalatora ISO attēls

source: The ISO file ${FILENAME} on ${DEVICE} (${SUITE}) will be used as the installation ISO image.
lv: ISO fails ${FILENAME} no ${DEVICE} diska (${SUITE}) tiks lietots kā instalēšanas ISO attēls.

source: Web server started, but network not running
lv: Tīmekļa serveris ir palaists, bet tīkls nedarbojas

source: A simple web server has been started on this computer to serve log files and debug info. However, the network is not set up yet. The web server will be left running, and will be accessible once the network is configured.
lv: Lai piedāvātu žurnālu ierakstus un atkļūdošanas informāciju, uz šīs mašīnas ir palaists vienkāršs tīmekļa serveris, taču tīkls vēl nav uzstādīts. Tīmekļa serveris turpinās darboties un būs pieejams, līdzko tiks nokonfigurēts tīkls.

source: Web server started
lv: Tīmekļa serveris darbojas

source: A simple web server has been started on this computer to serve log files and debug info. An index of all the available log files can be found at http://${ADDRESS}/
lv: Uz šīs mašīnas ir palaists vienkāršs tīmekļa serveris, kas piedāvā žurnālu failus un atkļūdošanas informāciju. Visu pieejamo žurnāla ierakstu failu saraksts ir ieejams šeit: http://${ADDRESS}/

source: Check CD-ROM integrity?
lv: Pārbaudīt CD-ROM integritāti?

source: Warning: this check depends on your hardware and may take some time.
lv: Uzmanību: šis tests ir atkarīgs no jūsu aparatūras un var aizņemt ievērojamu laiku.

source: Insert a Debian CD-ROM
lv: Ielieciet Debian kompaktdisku
