Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/administrivia.po
Languages: es, zh_cn

source: Administrivia
es: Información administrativa
zh_cn: 文案

source: About This Document
es: Acerca de este documento
zh_cn: 关于本文档

source: This manual was created for Sarge's debian-installer, based on the Woody installation manual for boot-floppies, which was based on earlier Debian installation manuals, and on the Progeny distribution manual which was released under GPL in 2003.
es: Este manual fue creado para el instalador de Debian Sarge, basándose en el manual de instalación de Woody para el sistema «boot-floppies», que se basaba a su vez en los manuales de instalación de versiones previas de Debian, y basándose también en el manual de instalación de la distribución Progeny, publicado bajo los términos de la licencia GPL el año 2003.
zh_cn: 本手册是为 Sarge 版 debian-installer 创建，基于 Woody 版的软盘安装手册，而那份手册又是基于更早版本的 Debian 安装手册和 2003 年 GPL 协议下的 Progeny 分发手册。

source: This document is written in DocBook XML. Output formats are generated by various programs using information from the <classname>docbook-xml</classname> and <classname>docbook-xsl</classname> packages.
es: Este documento está escrito en DocBook XML. Los formatos de salida han sido generados por distintos programas utilizando la información de los paquetes <classname>docbook-xml</classname> y <classname>docbook-xsl</classname>.
zh_cn: 本文档以 DocBook XML 写成。很多程序可以使用 <classname>docbook-xml</classname> 和 <classname>docbook-xsl</classname> 包中的信息生成各种输出格式。

source: In order to increase the maintainability of this document, we use a number of XML features, such as entities and profiling attributes. These play a role akin to variables and conditionals in programming languages. The XML source to this document contains information for each different architecture &mdash; profiling attributes are used to isolate certain bits of text as architecture-specific.
es: Se usan algunas de las funcionalidades de XML, como pueden ser las entidades o atributos de perfil, para poder mantener adecuadamente este documento. Éstos desempeñan un papel similar al de las variables y los condicionales en los lenguajes de programación. Las fuentes en XML de este documento contienen la información necesaria para cada una de las arquitecturas y se utilizan atributos de perfil para aislar algunas partes del texto que son específicas de cada arquitectura.
zh_cn: 为了提升本文档的可维护性，我们使用了一些 XML 的特性，比如 entities 和 profiling 属性。它们充当类似于编程语言中变量与条件的角色。本文档的 XML 源文件包含了各种硬件体系的信息 &mdash; profiling 属性用于分开体系相关的文档碎片。

source: Translators can use this paragraph to acknowledge the people responsible for the translation of the manual. Translation teams are advised to just mention the coordinator and maybe major contributors and thank everybody else in a phrase like "all translators and reviewers from the translation team for {your language} at {your l10n mailinglist}". See build/lang-options/README on how to enable this paragraph. Its condition is "about-langteam".
es: La traducción de este documento ha sido posible gracias a la colaboración y trabajo de Javier Fernández-Sanguino Peña, Rubén Porras, Rudy Godoy, David Moreno Garza, Bruno Barrera, Igor Támara, Omar Campagne Polaino, así como las contribuciones en traducción y revisión de los miembros del equipo de traducción a español de Debian (<email>debian-l10n-spanish@lists.debian.org</email>).
zh_cn: Debian 安装手册简体中文版翻译项目由 Carlos Z.F. Liu 发起组织，参加翻译和校对的人员有(按字母和拼音排列)：Carlos Liu、Huaxia Zhao、Kov Tchai、Ming Hua、szjungle、wide288、胡海星、吴鲁加、解彦博、肖盛文。在此表示感谢！另外，附录中的 GPL 简体中文版取自：<ulink url="http://gnu.freehostingguru.com/gpl/">http://gnu.freehostingguru.com/gpl/</ulink>。

source: Contributing to This Document
es: Cómo contribuir a este documento
zh_cn: 帮助本文档

source: If you have problems or suggestions regarding this document, you should probably submit them as a bug report against the package <classname>installation-guide</classname>. See the <classname>reportbug</classname> package or read the online documentation of the <ulink url="&url-bts;">Debian Bug Tracking System</ulink>. It would be nice if you could check the <ulink url="&url-bts;installation-guide">open bugs against installation-guide</ulink> to see whether your problem has already been reported. If so, you can supply additional corroboration or helpful information to <email><replaceable>XXXX</replaceable>@bugs.debian.org</email>, where <replaceable>XXXX</replaceable> is the number for the already-reported bug.
es: Si tiene problemas o sugerencias relacionadas con este documento, debería enviar un informe de errata dirigido al paquete <classname>installation-guide</classname>. Por favor, utilice el paquete <classname>reportbug</classname> o lea la documentación en línea del <ulink url="&url-bts;">Sistema de seguimiento de fallos de Debian</ulink>. Sería conveniente que revisara primero la <ulink url="&url-bts;installation-guide">lista de erratas abiertas reportadas contra el paquete installation-guide</ulink> para ver si su problema ya ha sido reportado. Si es así, usted puede proporcionar información adicional enviando un correo a <email><replaceable>XXXX</replaceable>@bugs.debian.org</email>, donde <replaceable>XXXX</replaceable> es el número asignado a la errata.
zh_cn: 对于本文档，如果您有问题或者建议，该提交关于 <classname>installation-guide</classname> 包的 bug 报告。参见 <classname>reportbug</classname> 包或者阅读 <ulink url="&url-bts;">Debian Bug Tracking System</ulink> 的在线文档。良好的习惯是先检查 <ulink url="&url-bts;installation-guide">关于 debian-installer-manual 处于 open 状态的 bug</ulink>，了解您遇到的问题是否已经被其他人报告。如果有，您可以提供确认或者帮助信息到 <email><replaceable>XXXX</replaceable>@bugs.debian.org</email>, 其中 <replaceable>XXXX</replaceable> 代表已报告的 bug 号码。

source: Better yet, get a copy of the DocBook source for this document, and produce patches against it. The DocBook source can be found at the <ulink url="&url-d-i-websvn;">debian-installer WebSVN</ulink>. If you're not familiar with DocBook, don't worry: there is a simple cheatsheet in the manuals directory that will get you started. It's like html, but oriented towards the meaning of the text rather than the presentation. Patches submitted to the debian-boot mailing list (see below) are welcomed. For instructions on how to check out the sources via SVN, see <ulink url="&url-d-i-readme;">README</ulink> from the source root directory.
es: Mejor aún, obtenga una copia de las fuentes en DocBook de este documento, y proporcione parches basándose en éste. Puede obtener las fuentes en DocBook con el <ulink url="&url-d-i-websvn;">visor web de SVN del instalador de Debian</ulink>. No se preocupe si no está familiarizado con DocBook, existe una hoja introductoria en el directorio «manuals» que le puede servir para empezar a trabajar. El formato DocBook es parecido a HTML, pero está más orientado al significado del texto que a la presentación. Se agradece cualquier parche que pueda enviar a la lista de correo de debian-boot (consulte más abajo). Para leer las instrucciones de cómo descargar las fuentes a través de SVN, lea el fichero <ulink url="&url-d-i-readme;">README</ulink> disponible en el directorio raíz.
zh_cn: 更佳的途径是取得一份本文档的 DocBook 源文件拷贝，给它打一个补丁。DocBook 的源文件位于 <ulink url="&url-d-i-websvn;">debian-installer WebSVN</ulink>。如果您不熟悉 DocBook，别发愁：在 manuals 目录下有一个简单的 cheatsheet 文件，可以帮您起步。它像 html 文件，但更侧重于文字的含义而不是显示。欢迎将补丁提交到 debian-boot 邮件列表(见下)。关于如何从 SVN 检出(check out)源文件，请参考源文件目录中的 <ulink url="&url-d-i-readme;">README</ulink> 。

source: Please do <emphasis>not</emphasis> contact the authors of this document directly. There is also a discussion list for &d-i;, which includes discussions of this manual. The mailing list is <email>debian-boot@lists.debian.org</email>. Instructions for subscribing to this list can be found at the <ulink url="&url-debian-lists-subscribe;">Debian Mailing List Subscription</ulink> page; or you can browse the <ulink url="&url-debian-list-archives;">Debian Mailing List Archives</ulink> online.
es: Por favor <emphasis>no</emphasis> contacte directamente con los autores de este documento. Existe una lista de discusión para el &d-i; en la que también se tratan los contenidos de este manual. La lista de correo es <email>debian-boot@lists.debian.org</email>. Puede obtener las instrucciones de cómo suscribirse a esta lista en las páginas de <ulink url="&url-debian-lists-subscribe;">subscripción a las listas de correo de Debian</ulink>. Vd. también puede leer, si lo desea, los <ulink url="&url-debian-list-archives;">archivos de las listas de correo</ulink> en línea.
zh_cn: 请<emphasis>勿</emphasis>直接联系本文档的作者。还有一个关于 &d-i; 的邮件列表，包含本手册的讨论。这个邮件列表是 <email>debian-boot@lists.debian.org</email>。订阅此邮件列表的指引在 <ulink url="&url-debian-lists-subscribe;">Debian Mailing List Subscription</ulink> 页面；您也可以在线浏览 <ulink url="&url-debian-list-archives;">Debian Mailing List Archives</ulink> 。

source: Major Contributions
es: Contribuciones importantes
zh_cn: 主要贡献人员

source: This document was originally written by Bruce Perens, Sven Rudolph, Igor Grobman, James Treacy, and Adam Di Carlo. Sebastian Ley wrote the Installation Howto.
es: Bruce Perens, Sven Rudolph, Igor Grobman, James Treacy y Adam Di Carlo escribieron la primera versión de documento. Sebastian Ley escribió el CÓMO de instalación.
zh_cn: 本文档最初由 Bruce Perens、Sven Rudolph、Igor Grobman、James Treacy 和 Adam Di Carlo 撰写。Sebastian Ley 撰写了 Installation Howto。

source: Miroslav Kuře has documented a lot of the new functionality in Sarge's debian-installer. Frans Pop was the main editor and release manager during the Etch, Lenny and Squeeze releases.
es: Miroslav Kuře ha documentado muchas de las nuevas funciones del instalador de Sarge. Frans Pop ha sido el editor principal y responsable de publicación de las distribuciones Etch, Lenny y Squeeze.
zh_cn: Miroslav Kuře 为 Sarge 版 debian-installer 里面的很多新功能编写了文档。Frans Pop 曾经是 Etch、 Lenny 和 Squeeze 发布版的主要编辑和版本经理。

source: Many, many Debian users and developers contributed to this document. Particular note must be made of Michael Schmitz (m68k support), Frank Neumann (original author of the <ulink url="&url-m68k-old-amiga-install;">Amiga install manual</ulink>), Arto Astala, Eric Delaunay/Ben Collins (SPARC information), Tapio Lehtonen, and Stéphane Bortzmeyer for numerous edits and text. We have to thank Pascal Le Bail for useful information about booting from USB memory sticks.
es: Muchos, muchos usuarios y desarrolladores de Debian han contribuido a este documento. Queremos agradecer de forma particular las numerosas revisiones y textos proporcionados por Michael Schmitz (compatibilidad con m68k), Frank Neumann (autor original del <ulink url="&url-m68k-old-amiga-install;">Manual de instalación en Amiga</ulink>), Arto Astala, Eric Delaunay y Ben Collins (información sobre SPARC), Tapio Lehtonen, y Stéphane Bortzmeyer. De igual manera queremos agradecer a Pascal Le Bail la valiosa información de cómo arrancar un sistema utilizando memorias USB.
zh_cn: 有许许多多的 Debian 用户和开发人员为本文档做出了贡献。特别要感谢 Michael Schmitz (m68k 支持)、Frank Neumann (<ulink url="&url-m68k-old-amiga-install;">Amiga 安装手册</ulink>的最初作者)、Arto Astala、Eric Delaunay/Ben Collins (SPARC 信息)、Tapio Lehtonen 和 Stéphane Bortzmeyer 做了大量的编辑和文字处理。我们还要感谢 Pascal Le Bail 提供了从 U 盘上引导的相关信息。

source: Extremely helpful text and information was found in Jim Mintha's HOWTO for network booting (no URL available), the <ulink url="&url-debian-faq;">Debian FAQ</ulink>, the <ulink url="&url-m68k-faq;">Linux/m68k FAQ</ulink>, the <ulink url="&url-sparc-linux-faq;">Linux for SPARC Processors FAQ</ulink>, the <ulink url="&url-alpha-faq;">Linux/Alpha FAQ</ulink>, amongst others. The maintainers of these freely available and rich sources of information must be recognized.
es: Hemos encontrado extremadamente útil los textos y la información disponibles, entre otros, en el CÓMO de arranque del sistema a través de la red escrito por Jim Mintha (no hay sitio web disponible), las <ulink url="&url-debian-faq;">PUF de Debian</ulink>, las <ulink url="&url-m68k-faq;">PUF de Linux/m68k</ulink>, las <ulink url="&url-sparc-linux-faq;">PUF de Linux en procesadores SPARC</ulink>, o las <ulink url="&url-alpha-faq;">PUF de Linux en Alpha</ulink>, entre otros. Queremos desde aquí reconocer el trabajo de los desarrolladores de estas fuentes libres de información tan valiosas.
zh_cn: 我们还从下列文档中获得了非常有用的文稿和信息，它们是 Jim Mintha's 的网络启动 HOWTO(没有有效的 URL)、<ulink url="&url-debian-faq;">Debian FAQ</ulink>、<ulink url="&url-m68k-faq;">Linux/m68k FAQ</ulink>、<ulink url="&url-sparc-linux-faq;">Linux for SPARC Processors FAQ</ulink>、<ulink url="&url-alpha-faq;">Linux/Alpha FAQ</ulink>，以及其他。这些文档的维护者们提供了丰富的信息源必须要说明。

source: The section on chrooted installations in this manual (<xref linkend="linux-upgrade"/>) was derived in part from documents copyright Karsten M. Self.
es: La sección en este manual de instalaciones en entornos de chroot (<xref linkend="linux-upgrade"/>) se ha basado en parte de documentos sobre los que Karsten M. Self tiene derechos de copia.
zh_cn: 本手册中有关 chroot 安装的内容(<xref linkend="linux-upgrade"/>)来源于 Karsten M. Self 所有版权的部分文档。

source: The section on installations over plip in this manual (<xref linkend="plip"/>) was based on the <ulink url="&url-plip-install-howto;">PLIP-Install-HOWTO</ulink> by Gilles Lamiral.
es: La sección en este manual que cubre las instalaciones a través plip (<xref linkend="plip"/>) está basada en el <ulink url="&url-plip-install-howto;">PLIP-Install-HOWTO</ulink> de Gilles Lamiral.
zh_cn: 手册里面的使用 plip 安装一节 (<xref linkend="plip"/>) 基于 Gilles Lamiral 的 <ulink url="&url-plip-install-howto;">PLIP-Install-HOWTO</ulink>。

source: Trademark Acknowledgement
es: Reconocimiento de las marcas registradas
zh_cn: 商标确认

source: All trademarks are property of their respective trademark owners.
es: Todas las marcas registradas son propiedad de sus respectivos dueños.
zh_cn: 所有商标的所有权归各自的商标所有者。
