Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/boot-installer.po
Languages: pt

source: Check that there is a device node for your CD-ROM drive under <filename>/dev/</filename>. In the example above, this would be <filename>/dev/hdc</filename>. There should also be a <filename>/dev/cdrom</filename>.
pt: Verifique se existe um nó de dispositivo para o seu leitor de CD-ROMs sob <filename>/dev/</filename>. No exemplo acima, isto será <filename>/dev/hdc</filename>. Deve também existir um <filename>/dev/cdrom</filename>.

source: Use the <command>mount</command> command to check if the CD-ROM is already mounted; if not, try mounting it manually: <informalexample><screen> $ mount /dev/<replaceable>hdc</replaceable> /cdrom </screen></informalexample> Check if there are any error messages after that command.
pt: Utilize o comando <command>mount</command> para verificar se o CD-ROM já está montado; caso não esteja, tente montá-lo manualmente: <informalexample><screen> $ mount /dev/<replaceable>hdc</replaceable> /cdrom </screen></informalexample> Verifique se existe alguma mensagem de erro após este comando.

source: Check if DMA is currently enabled: <informalexample><screen> $ cd /proc/<replaceable>ide</replaceable>/<replaceable>hdc</replaceable> $ grep using_dma settings using_dma 1 0 1 rw </screen></informalexample> A <quote>1</quote> in the first column after <literal>using_dma</literal> means it is enabled. If it is, try disabling it: <informalexample><screen> $ echo -n "using_dma:0" >settings </screen></informalexample> Make sure that you are in the directory for the device that corresponds to your CD-ROM drive.
pt: Veja se o DMA está actualmente activado: <informalexample><screen> $ cd /proc/<replaceable>ide</replaceable>/<replaceable>hdc</replaceable> $ grep using_dma settings using_dma 1 0 1 rw </screen></informalexample> Um <quote>1</quote> na primeira coluna após <literal>using_dma</literal> significa que está activado. Se estiver, tente desabilitá-lo: <informalexample><screen> $ echo -n "using_dma:0" >settings </screen></informalexample> Assegure-se que está no directório para o dispositivo que corresponde ao seu leitor de CD-ROMs.

source: If there are any problems during the installation, try checking the integrity of the CD-ROM using the option near the bottom of the installer's main menu. This option can also be used as a general test if the CD-ROM can be read reliably.
pt: Se existirem quaisquer problemas durante a instalação, tente verificar a integridade do CD-ROM utilizando a opção perto do fundo no menu principal do instalador. Esta opção também pode ser utilizada como um teste para verificar se o CD-ROM pode ser lido com fiabilidade.

source: Floppy Disk Reliability
pt: Disquetes de confiança

source: The biggest problem for people using floppy disks to install &debian; seems to be floppy disk reliability.
pt: O maior problema para as pessoas que utilizam disquetes para instalar &debian; parece ser a confiança na duração das disquetes.

source: The boot floppy is the floppy with the worst problems, because it is read by the hardware directly, before Linux boots. Often, the hardware doesn't read as reliably as the Linux floppy disk driver, and may just stop without printing an error message if it reads incorrect data. There can also be failures in the driver floppies, most of which indicate themselves with a flood of messages about disk I/O errors.
pt: A disquete de arranque é a disquete com os piores problemas, porque é lida directamente pelo hardware, antes do arranque do Linux. Frequentemente o hardware não lê de uma forma confiável como o driver de disquetes Linux, e em caso de ler dados incorrectos pode simplesmente parar sem mostrar mensagens de erro. Podem também existir falhas na drive de disquetes, na maioria dos casos são indicadas por muitas mensagens de erros I/O.

source: If you are having the installation stall at a particular floppy, the first thing you should do is write the image to a <emphasis>different</emphasis> floppy and see if that solves the problem. Simply reformatting the old floppy may not be sufficient, even if it appears that the floppy was reformatted and written with no errors. It is sometimes useful to try writing the floppy on a different system.
pt: Se está a enfrentar paragens da instalação numa disquete em particular, a primeira coisa que deve fazer é gravar imagem para uma disquete <emphasis>diferente</emphasis>. Simplesmente re-formatar a disquete antiga poderá não ser suficiente, mesmo que parece que a disquete foi re-formatada e escrita sem erros. Por vezes é útil tentar escrever a disquete num sistema diferente.

source: One user reports he had to write the images to floppy <emphasis>three</emphasis> times before one worked, and then everything was fine with the third floppy.
pt: Um utilizador reportou que teve de gravar a imagem para a disquetes <emphasis>três</emphasis> vezes antes de funcionar, e após isso tudo ficou bem com a terceira disquete.

source: Normally you should not have to download a floppy image again, but if you are experiencing problems it is always useful to verify that the images were downloaded correctly by verifying their md5sums.
pt: Normalmente não deve ter de fazer novamente o download da imagem da disquete, mas se está a ter problemas é sempre útil verificar que foi feito correctamente o download das imagens verificando o seu md5sum.

source: Other users have reported that simply rebooting a few times with the same floppy in the floppy drive can lead to a successful boot. This is all due to buggy hardware or firmware floppy drivers.
pt: Outros utilizadores reportaram que simplesmente reiniciando algumas vezes com a mesma disquete na drive de disquetes levou a um arranque bem sucedido. Tudo isto está relacionado com os erros do hardware ou os drivers de disquetes.

source: Boot Configuration
pt: Configuração de arranque

source: If you have problems and the kernel hangs during the boot process, doesn't recognize peripherals you actually have, or drives are not recognized properly, the first thing to check is the boot parameters, as discussed in <xref linkend="boot-parms"/>.
pt: Se tiver dificuldade e o kernel parar durante o processo de arranque, não reconhece periféricos que tem, ou os drivers não são reconhecidos devidamente, a primeira coisa a verificar são os parâmetros de arranque, como foi visto na <xref linkend="boot-parms"/>.

source: Often, problems can be solved by removing add-ons and peripherals, and then trying booting again. <phrase arch="any-x86">Internal modems, sound cards, and Plug-n-Play devices can be especially problematic.</phrase>
pt: Frequentemente pode ser resolvido removendo add-ons e periféricos, e tente reiniciar novamente. <phrase arch="any-x86"> Modems internos, placas de som e dispositivos Plug-n-Play podem ser especialmente problemáticos.</phrase>

source: If you have a large amount of memory installed in your machine, more than 512M, and the installer hangs when booting the kernel, you may need to include a boot argument to limit the amount of memory the kernel sees, such as <userinput>mem=512m</userinput>.
pt: Se tem uma grande quantidade de memória instalada na sua máquina, mais que 512M, e o instalador pára quando inicia o kernel, pode necessitar de incluir um argumento de arranque para limitar a quantidade de memória que o kernel vê, tal como <userinput>mem=512m</userinput>.

source: Common &arch-title; Installation Problems
pt: Problemas comuns de Instalação em &arch-title;

source: There are some common installation problems that can be solved or avoided by passing certain boot parameters to the installer.
pt: Existem alguns problemas de instalação usuais que podem ser resolvidos ou evitados ao passar alguns parâmetros de arranque ao instalador.

source: Some systems have floppies with <quote>inverted DCLs</quote>. If you receive errors reading from the floppy, even when you know the floppy is good, try the parameter <userinput>floppy=thinkpad</userinput>.
pt: Alguns sistemas têm disquetes com <quote>inverted DCLs</quote>. Se receber erros ao ler a disquete, mesmo quando tem a certeza que a disquete está boa, tente o parâmetro <userinput>floppy=thinkpad</userinput>.

source: On some systems, such as the IBM PS/1 or ValuePoint (which have ST-506 disk drivers), the IDE drive may not be properly recognized. Again, try it first without the parameters and see if the IDE drive is recognized properly. If not, determine your drive geometry (cylinders, heads, and sectors), and use the parameter <userinput>hd=<replaceable>cylinders</replaceable>,<replaceable>heads</replaceable>,<replaceable>sectors</replaceable></userinput>.
pt: Em alguns sistemas, tal como o IBM PS/1 ou ValuePoint (que tem um driver de disco ST-506), a drive IDE poderá não ser reconhecido propriamente. Mais uma vez, tente primeiro sem nenhum parâmetro e veja se a drive IDE é reconhecida sem problemas. Senão, determine a geometria da sua drive (cilindros, cabeças e sectores) e use o parâmetro <userinput>hd=<replaceable>cylinders</replaceable>,<replaceable>heads</replaceable>,<replaceable>sectors</replaceable></userinput>.

source: If you have a very old machine, and the kernel hangs after saying <computeroutput>Checking 'hlt' instruction...</computeroutput>, then you should try the <userinput>no-hlt</userinput> boot argument, which disables this test.
pt: Se tem uma máquina mesmo muito velha, e o kernel pára após mostrar <computeroutput>Checking 'hlt' instruction...</computeroutput>, então deverá tentar <userinput>no-hlt</userinput> como argumento no arranque, o que desactiva este teste.

source: Some systems (especially laptops) that have a native resolution that is not a 4:3 ratio (i.e. not for example 800x600 or 1024x768) may have a blank display after the installer has been booted. In that case adding the boot parameter <userinput>vga=788</userinput><footnote> <para> The parameter <userinput>vga=788</userinput> will activate the VESA framebuffer with a resolution of 800x600. This will probably work, but may not be the optimal resolution for your system. A list of supported resolutions can be obtained by using <userinput>vga=ask</userinput>, but you should be aware that list may not be complete. </para> </footnote> may help. If that does not work, try adding the boot parameter <userinput>fb=false</userinput>.
pt: Alguns sistemas (especialmente os portáteis) têm uma resolução nativa que não tem a razão 4:3 (i.e. por exemplo não 800x600 ou 1024x768) podem ter um ecrã branco depois do instalador arrancar. Nesse caso acrescente o parâmetro de arranque <userinput>vga=788</userinput><footnote> <para> O parâmetro <userinput>vga=788</userinput> irá activar o framebuffer VESA com uma resolução 800x600. Isto irá provavelmente funcionar, mas poderá não ser a resolução óptima para o seu sistema. Pode ser obtida uma lista das resoluções suportadas utilizando <userinput>vga=ask</userinput>, mas esteja ciente que essa lista poderá não estar completa. </para> </footnote> poderá ajudar. Se isso não funcionar, tente acrescentar o parâmetro de arranque <userinput>fb=false</userinput>.

source: If your screen begins to show a weird picture while the kernel boots, eg. pure white, pure black or colored pixel garbage, your system may contain a problematic video card which does not switch to the framebuffer mode properly. Then you can use the boot parameter <userinput>fb=false</userinput> to disable the framebuffer console. Only a reduced set of languages will be available during the installation due to limited console features. See <xref linkend="boot-parms"/> for details.
pt: Se o seu ecrã começar a mostrar uma imagem estranha enquanto o seu kernel arranca, eg. toda branca, toda preta, ou com coloração estranha dos pixels, o seu sistema poderá ter uma placa gráfica problemática que não muda correctamente para o modo framebuffer. Neste caso, pode utilizar o parâmetro de arranque <userinput>fb=false</userinput>, para desabilitar a consola framebuffer. Durante a instalação apenas estará disponível um conjunto limitado de idiomas devido às características limitadas da consola. Veja a <xref linkend="boot-parms"/> para mais detalhes.

source: System Freeze During the PCMCIA Configuration Phase
pt: Bloqueio do Sistema Durante a Fase de Configuração de PCMCIA

source: Some laptop models produced by Dell are known to crash when PCMCIA device detection tries to access some hardware addresses. Other laptops may display similar problems. If you experience such a problem and you don't need PCMCIA support during the installation, you can disable PCMCIA using the <userinput>hw-detect/start_pcmcia=false</userinput> boot parameter. You can then configure PCMCIA after the installation is completed and exclude the resource range causing the problems.
pt: Alguns modelos de portáteis produzidos pela Dell, são conhecidos por bloquearem quando um dispositivo PCMCIA tenta aceder a alguns endereços de hardware. Outros portáteis poderão mostrar problemas similares. Se experimentou tal problema e não necessita do suporte PCMCIA durante a instalação, poderá desactivar PCMCIA usando o parâmetro de arranque <userinput>hw-detect/start_pcmcia=false</userinput>. Pode depois configurar a PCMCIA após a instalação estar concluída e excluir o recurso a causar o conflito.

source: Alternatively, you can boot the installer in expert mode. You will then be asked to enter the resource range options your hardware needs. For example, if you have one of the Dell laptops mentioned above, you should enter <userinput>exclude port 0x800-0x8ff</userinput> here. There is also a list of some common resource range options in the <ulink url="http://pcmcia-cs.sourceforge.net/ftp/doc/PCMCIA-HOWTO-1.html#ss1.12">System resource settings section of the PCMCIA HOWTO</ulink>. Note that you have to omit the commas, if any, when you enter this value in the installer.
pt: Em alternativa, poderá iniciar o instalador em modo expert. Ser-lhe-á pedido para introduzir o intervalo de recursos que o seu hardware necessita. Por exemplo, se tem um dos portáteis Dell mencionados acima deverá introduzir <userinput>exclude port 0x800-0x8ff</userinput>. Há uma lista com os intervalos mais comuns em <ulink url="http://pcmcia-cs.sourceforge.net/ftp/doc/PCMCIA-HOWTO-1.html#ss1.12">System resource settings section of the PCMCIA HOWTO</ulink>. Note que tem de omitir as virgulas, se alguma, quando introduz estes valores no instalador.

source: System Freeze while Loading USB Modules
pt: Bloqueio de Sistema durante o carregamento dos módulos USB

source: The kernel normally tries to install USB modules and the USB keyboard driver in order to support some non-standard USB keyboards. However, there are some broken USB systems where the driver hangs on loading. A possible workaround may be disabling the USB controller in your mainboard BIOS setup. Another option is passing the <userinput>nousb</userinput> parameter at the boot prompt.
pt: O kernel normalmente tenta instalar os módulos USB e o driver do teclado USB de forma a suportar alguns teclados USB não standard. No entanto existem alguns sistemas USB onde o controlador encrava ao carregar. Uma possível forma de contornar isto é desactivar o controlador USB na configuração da BIOS da sua 'motherbord'. Outra opção é passar o parâmetro <userinput>nousb</userinput> na prompt de arranque.

source: There are some common installation problems that are worth mentioning.
pt: Existem alguns problemas de instalação usuais que vale a pena mencionar.

source: Misdirected video output
pt: saída de vídeo direccionada incorrectamente

source: It is fairly common for &arch-title; to have two video cards in one machine, for example an ATI card and a Sun Creator 3D. In some cases, this may result in the video output getting misdirected soon after the system boots. In typical cases, the display will only show: <informalexample><screen> Remapping the kernel... done Booting Linux... </screen></informalexample> To work around this, you can either pull out one of the video cards, or disable the one not used during the OpenProm boot phase using a kernel parameter. For example, to disable an ATI card, you should boot the installer with <userinput>video=atyfb:off</userinput>.
pt: É bastante comum para &arch-title; ter duas placas gráficas numa máquina, por exemplo uma placa ATI e uma placa Sun Creator 3D. Em alguns casos, isto pode resultar em que a saída de video seja direccionada incorrectamente assim que o sistema arranque. Em casos típicos, o ecrã apenas irá mostrar: <informalexample><screen>Remapping the kernel... done Booting Linux... </screen></informalexample> Para contornar isto, pode tirar fora uma das placas gráficas, ou desabilitar a que não for utilizada durante o arranque da fase OpenProm utilizando um parâmetro do kernel. Por exemplo, para desabilitar uma placa ATI, deve arrancar o instalador com <userinput>video=atyfb:off</userinput>.

source: Note that you may also have to manually add this parameter to the silo configuration (edit <filename>/target/etc/silo.conf</filename> before rebooting) and, if you installed X11, modify the video driver in <filename>/etc/X11/xorg.conf</filename>.
pt: Note que também pode ter de acrescentar manualmente este parâmetro á configuração do silo (edite <filename>/target/etc/silo.conf</filename> antes de reiniciar) e, se instalou o X11, altere o controlador de video em <filename>/etc/X11/xorg.conf</filename>.

source: Failure to Boot or Install from CD-ROM
pt: Falha ao Arrancar ou Instalar a partir de CD-ROM

source: Some Sparc systems are notoriously difficult to boot from CD-ROM and even if they do boot, there may be inexplicable failures during the installation. Most problems have been reported with SunBlade systems.
pt: Alguns sistemas Sparc são notoriamente difíceis de arrancar a partir de CD-ROM e mesmo que arranquem, podem ocorrer falhas inexplicáveis durante a instalação. A maioria dos problemas foram relatados com sistemas SunBlade.

source: We recommend to install such systems by netbooting the installer.
pt: Nós recomendamos que tais sistemas sejam instalados através da rede com o instalador.

source: Interpreting the Kernel Startup Messages
pt: Interpretar as Mensagens de Arranque do Kernel

source: During the boot sequence, you may see many messages in the form <computeroutput>can't find <replaceable>something</replaceable></computeroutput>, or <computeroutput><replaceable>something</replaceable> not present</computeroutput>, <computeroutput>can't initialize <replaceable>something</replaceable></computeroutput>, or even <computeroutput>this driver release depends on <replaceable>something</replaceable></computeroutput>. Most of these messages are harmless. You see them because the kernel for the installation system is built to run on computers with many different peripheral devices. Obviously, no one computer will have every possible peripheral device, so the operating system may emit a few complaints while it looks for peripherals you don't own. You may also see the system pause for a while. This happens when it is waiting for a device to respond, and that device is not present on your system. If you find the time it takes to boot the system unacceptably long, you can create a custom kernel later <phrase arch="linux-any">(see <xref linkend="kernel-baking"/>)</phrase>.
pt: Durante a sequência de arranque, poderá ver muitas mensagens sob a forma <computeroutput>can't find <replaceable>alguma coisa</replaceable> </computeroutput>, ou <computeroutput><replaceable>alguma coisa</replaceable> not present</computeroutput>, <computeroutput>can't initialize <replaceable>alguma coisa</replaceable></computeroutput>, ou até <computeroutput>this driver release depends on <replaceable>alguma coisa</replaceable></computeroutput>. A maioria destas mensagens são inofensivas. Visualiza-as porque o kernel para o sistema de instalação é feito para correr em computadores com muitos dispositivos periféricos diferentes. Obviamente, nenhum computador terá todos os dispositivos periféricos possíveis, então o sistema operativo poderá emitir algumas queixas enquanto procura por periféricos que não possui. Poderá também verificar uma pausa no sistema por algum tempo. Isto acontece quando aguarda pela resposta de um dispositivo, e o mesmo não está presente no seu sistema. Se achar que o tempo que demora a arrancar o sistema é inaceitavelmente longo, poderá depois criar um kernel personalizado <phrase arch="linux-any">(veja a <xref linkend="kernel-baking"/>)</phrase>.

source: Reporting Installation Problems
pt: Relatar Problemas de Instalação

source: If you get through the initial boot phase but cannot complete the install, the menu option <guimenuitem>Save debug logs</guimenuitem> may be helpful. It lets you store system error logs and configuration information from the installer to a floppy, or download them using a web browser. This information may provide clues as to what went wrong and how to fix it. If you are submitting a bug report, you may want to attach this information to the bug report.
pt: Se avançar através da fase inicial de arranque mas não conseguir completar a instalação, a opção do menu <guimenuitem>Guardar registos de depuração</guimenuitem> poderá ser útil. Permite-lhe guardar os registos de erros do sistema e informação de configuração do instalador para uma disquete, ou fazer o download deles utilizando um browser web. Esta informação pode fornecer pistas acerca do que correu mal e como o corrigir. Se estiver a submeter um relatório de erros, você poderá querer adicionar esta informação ao relatório de erros.

source: Other pertinent installation messages may be found in <filename>/var/log/</filename> during the installation, and <filename>/var/log/installer/</filename> after the computer has been booted into the installed system.
pt: Outras mensagens pertinentes de instalação podem ser encontradas em <filename>/var/log/</filename> durante a instalação, e <filename>/var/log/installer/</filename> após o computador ter iniciado para o sistema instalado.

source: Submitting Installation Reports
pt: Submeter Relatórios de Instalação

source: If you still have problems, please submit an installation report. We also encourage installation reports to be sent even if the installation is successful, so that we can get as much information as possible on the largest number of hardware configurations.
pt: Se ainda tiver problemas, por favor submeta um relatório de instalação. Nós também encorajamos que sejam enviados relatórios de instalação mesmo que a instalação tenha sucesso, para que possamos obter tanta informação quanto possível no maior número de configurações de hardware.

source: Note that your installation report will be published in the Debian Bug Tracking System (BTS) and forwarded to a public mailing list. Make sure that you use an e-mail address that you do not mind being made public.
pt: Note que o seu relatório de instalação será publicado no &debian; Bug Tracking System (BTS) e encaminhado para uma mailing list pública. Assegure-se que utiliza um endereço de e-mail que não se importa que seja tornado público.
