Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/boot-installer.po
Languages: pt

source: Select <command>Boot From a File</command> from the menu with the arrow keys and press <command>ENTER</command>. This will display a list of devices probed by the firmware. You should see two menu lines containing either the label <command>Debian Inst [Acpi ...</command> or <command>Removable Media Boot</command>. If you examine the rest of the menu line, you will notice that the device and controller information should be the same.
pt: Seleccione <command>Boot From a File</command> a partir do menu, usando as setas do seu teclado e pressione <command>ENTER</command>. Isto irá listar os dispositivos testados pelo firmware. Deverá conseguir ver duas linhas do menu, contendo ou a etiqueta <command>Debian Inst [Acpi ...</command> ou a etiqueta <command>Removable Media Boot</command>. Se examinar o resto das linhas do menu, deverá notar que a informação do dispositivo e do controlador deverá ser a mesma.

source: You can choose either of the entries that refer to the CD/DVD drive. Select your choice with the arrow keys and press <command>ENTER</command>. If you choose <command>Removable Media Boot</command> the machine will immediately start the boot load sequence. If you choose <command>Debian Inst [Acpi ...</command> instead, it will display a directory listing of the bootable portion of the CD, requiring you to proceed to the next (additional) step.
pt: Poderá escolher qualquer uma das entradas que se referem à drive de CD/DVD. Seleccione a sua escolha com as setas do seu teclado e pressione <command>ENTER</command>. Se escolher <command>Removable Media Boot</command>, a máquina irá imediatamente iniciar a sequência de carregamento no arranque. Se em vez disso escolher <command>Debian Inst [Acpi ...</command>, irá mostrar uma lista de directórios da parte de arranque do CD, requerendo que proceda para o próximo passo (adicional).

source: You will only need this step if you chose <command>Debian Inst [Acpi ...</command>. The directory listing will also show <command>[Treat like Removable Media Boot]</command> on the next to the last line. Select this line with the arrow keys and press <command>ENTER</command>. This will start the boot load sequence.
pt: Apenas irá necessitar deste passo se escolher <command>Debian Inst [Acpi ...</command>. A lista de directórios irá também mostrar <command>[Treat like Removable Media Boot]</command> ao lado da linha a seguir à última. Seleccione esta linha com as setas do seu teclado e pressione<command>ENTER</command>. Isto irá iniciar a sequência de arranque.

source: These steps start the &debian; boot loader which will display a menu page for you to select a boot kernel and options. Proceed to selecting the boot kernel and options.
pt: Estas etapas iniciam o gestor de arranque de &debian; que irá mostrar uma página de menu, para você escolher um kernel e opções para arranque. Continue com a selecção do kernel e opções de arranque.

source: Option 2: Booting from the EFI Shell
pt: Opção 2: Arrancar a partir de uma Shell EFI

source: If, for some reason, option 1 is not successful, reboot the machine and when the EFI Boot Manager screen appears there should be one option called <command>EFI Shell [Built-in]</command>. Boot the &debian; Installer CD with the following steps:
pt: Se, por alguma razão, a opção 1 não for bem sucedida, reinicie a máquina e quando aparecer o ecrã de EFI Boot Manager deve haver uma opção chamada <command>EFI Shell [Built-in]</command>. Inicie o CD do Instalador &debian; com as seguintes etapas:

source: Insert the CD in the DVD/CD drive and reboot the machine. The firmware will display the EFI Boot Manager page and menu after it completes system initialization.
pt: Insira o CD na drive de DVD/CD e reinicie a máquina. O firmware irá mostrar a página do EFI Boot Manager e o menu após completar a inicialização do sistema.

source: Select <command>EFI Shell</command> from the menu with the arrow keys and press <command>ENTER</command>. The EFI Shell will scan all of the bootable devices and display them to the console before displaying its command prompt. The recognized bootable partitions on devices will show a device name of <filename>fs<replaceable>n</replaceable>:</filename>. All other recognized partitions will be named <filename>blk<replaceable>n</replaceable>:</filename>. If you inserted the CD just before entering the shell, this may take a few extra seconds as it initializes the CD drive.
pt: Escolha <command>EFI Shell</command> a partir do menu com as teclas de setas e carregue em <command>ENTER</command>. A EFI Shell irá procurar todos os seus dispositivos de arranque e mostrá-los na consola antes de mostrar a sua linha de comandos. As partições de arranque reconhecidas nos dispositivos irão mostrar um nome de dispositivo de <filename>fs<replaceable>n</replaceable>:</filename>. Todas as outras partições reconhecidas serão chamadas <filename>blk<replaceable>n</replaceable>:</filename>. Se você inseriu um CD mesmo antes de entrar na shell, desta forma poderá demorar alguns segundos extra enquanto inicializa a drive de CD.

source: Examine the output from the shell looking for the CDROM drive. It is most likely the <filename>fs0:</filename> device although other devices with bootable partitions will also show up as <filename>fs<replaceable>n</replaceable></filename>.
pt: Examine o output da consola a procurar a drive de CDROM. É muito provável que seja o dispositivo <filename>fs0:</filename> embora possam também aparecer outros dispositivos com partições de arranque como <filename>fs<replaceable>n</replaceable></filename>.

source: Enter <command>fs<replaceable>n</replaceable>:</command> and press <command>ENTER</command> to select that device where <replaceable>n</replaceable> is the partition number for the CDROM. The shell will now display the partition number as its prompt.
pt: Introduza <command>fs<replaceable>n</replaceable>:</command> e carregue em <command>ENTER</command> para seleccionar qual o dispositivo onde <replaceable>n</replaceable> é o número da partição para o CDROM. A shell irá agora mostrar o número da partição assim que aparecer a linha de comandos.

source: Enter <command>elilo</command> and press <command>ENTER</command>. This will start the boot load sequence.
pt: Introduza <command>elilo</command> e pressione <command>ENTER</command>. Isto irá iniciar a sequência de arranque.

source: As with option 1, these steps start the &debian; boot loader which will display a menu page for you to select a boot kernel and options. You can also enter the shorter <command>fs<replaceable>n</replaceable>:elilo</command> command at the shell prompt. Proceed to selecting the boot kernel and options.
pt: Tal como a opção 1, estes passos iniciam o gestor de arranque de &debian; que irá mostrar uma página de menu para você escolher um kernel e opções de arranque. Você pode também introduzir o comando mais curto <command>fs<replaceable>n</replaceable>:elilo</command> na linha de comando. Continue para seleccionar o kernel e as opções de arranque.

source: Installing using a Serial Console
pt: Instalar utilizando uma Consola Série

source: You may choose to perform an install using a monitor and keyboard or using a serial connection. To use a monitor/keyboard setup, select an option containing the string [VGA console]. To install over a serial connection, choose an option containing the string [<replaceable>BAUD</replaceable> baud serial console], where <replaceable>BAUD</replaceable> is the speed of your serial console. Menu items for the most typical baud rate settings on the ttyS0 device are preconfigured.
pt: Você pode escolher fazer uma instalação utilizando um monitor e teclado ou utilizando uma ligação série. Para utilizar uma configuração monitor/teclado, escolha uma opção que contém a string [consola VGA]. Para instalar através de uma ligação série, escolha uma opção que contenha a string [<replaceable>BAUD</replaceable> consola série baud], onde <replaceable>BAUD</replaceable> é a velocidade da sua consola série. Os itens do menu para as definições de baud rate mais típicas no dispositivo ttyS0 são pré-configuradas.

source: In most circumstances, you will want the installer to use the same baud rate as your connection to the EFI console. If you aren't sure what this setting is, you can obtain it using the command <command>baud</command> at the EFI shell.
pt: Na maioria das circunstâncias, você irá querer que o instalador utilize o mesmo baud rate que a sua ligação para a consola EFI. Se você não tiver a certeza qual á a definição, pode obtê-la utilizando o comando <command>baud</command> na shell EFI.

source: If there is not an option available that is configured for the serial device or baud rate you would like to use, you may override the console setting for one of the existing menu options. For example, to use a 57600 baud console over the ttyS1 device, enter <command>console=ttyS1,57600n8</command> into the <classname>Boot:</classname> text window.
pt: Se não tiver disponível uma opção que é configurada para o dispositivo série ou baud rate que você gostaria de utilizar, você pode pode ultrapassar a configuração da consola para uma ou mais das opções do menu. Por exemplo, para utilizar uma consola a 57600 baud no dispositivo ttyS1, introduza <command>console=ttyS1,57600n8</command> na janela de texto <classname>Boot:</classname>.

source: Most IA-64 boxes ship with a default console setting of 9600 baud. This setting is rather slow, and the normal installation process will take a significant time to draw each screen. You should consider either increasing the baud rate used for performing the installation, or performing a Text Mode installation. See the <classname>Params</classname> help menu for instructions on starting the installer in Text Mode.
pt: A maioria das máquinas IA-64 vem com uma configuração de consola por omissão de 9600 baud. Esta configuração é um bocado lenta, e o processo de instalação normal irá demorar um tempo significativo a desenhar cada ecrã. Você deve considerar aumentar o baud rate utilizado para fazer a instalação, ou fazer uma instalação em Modo Texto. Veja o menu de ajuda <classname>Params</classname>para instruções de como iniciar o instalador em Modo Texto.

source: If you select the wrong console type, you will be able to select the kernel and enter parameters but both the display and your input will go dead as soon as the kernel starts, requiring you to reboot before you can begin the installation.
pt: Se escolheu o tipo de consola errado, você será capaz de escolher o kernel e introduzir os parâmetros mas o display e o seu input estarão mortos logo que o kernel inicie, e você terá de reiniciar antes de conseguir iniciar a instalação.

source: Selecting the Boot Kernel and Options
pt: Escolher o Kernel e Opções de Arranque

source: The boot loader will display a form with a menu list and a text window with a <classname>Boot:</classname> prompt. The arrow keys select an item from the menu and any text typed at the keyboard will appear in the text window. There are also help screens which can be displayed by pressing the appropriate function key. The <classname>General</classname> help screen explains the menu choices and the <classname>Params</classname> screen explains the common command line options.
pt: O gestor de arranque irá mostrar um formulário com um menu em lista e uma janela de texto com uma linha de comandos <classname>Boot:</classname>. As teclas com as setas seleccionam um item a partir do menu e qualquer texto escrito no teclado irá aparecer na janela de texto. Existem também ecrãs de ajuda que podem ser mostrados pressionando a tecla de função apropriada. O ecrã de ajuda <classname>General</classname> explica as escolhas do menu e o ecrã <classname>Params</classname> explica as opções comuns da linha de comandos.

source: Consult the <classname>General</classname> help screen for the description of the kernels and install modes most appropriate for your installation. You should also consult <xref linkend="boot-parms"/> below for any additional parameters that you may want to set in the <classname>Boot:</classname> text window. The kernel version you choose selects the kernel version that will be used for both the installation process and the installed system. If you encounter kernel problems with the installation, you may also have those same problems with the system you install. The following two steps will select and start the install:
pt: Consulte o ecrã de ajuda <classname>Geral</classname> para a descrição dos kernel e modos de instalação mais apropriados para a sua instalação. Você também deve consultar a <xref linkend="boot-parms"/> abaixo para quaisquer parâmetros adicionais que você queira definir na janela de texto <classname>Boot:</classname>. A versão do kernel que você escolher seleccione a versão do kernel que será utilizada para o processo de instalação e para o sistema instalado, você também pode ter esses problemas com o sistema que instalar. Os dois passos seguintes irão seleccionar e iniciar a instalação:

source: Select the kernel version and installation mode most appropriate to your needs with the arrow keys.
pt: Escolha a versão do kernel e o modo de instalação mais apropriado para as suas necessidades com as teclas com as setas.

source: Enter any boot parameters by typing at the keyboard. The text will be displayed directly in the text window. This is where kernel parameters (such as serial console settings) are specified.
pt: Introduza quaisquer parâmetros de arranque escrevendo-os com o teclado. O texto será mostrado directamente na janela de texto. Isto é onde são especificados os parâmetros do kernel (tais como configurações da consola série).

source: Press <command>ENTER</command>. This will load and start the kernel. The kernel will display its usual initialization messages followed by the first screen of the &debian; Installer.
pt: Carregue em <command>ENTER</command>. Isto irá carregar e iniciar o kernel. O kernel irá mostrar as suas típicas mensagens de inicialização seguidas do primeiro ecrã do Instalador &debian;.

source: Proceed to the next chapter to continue the installation where you will set up the language locale, network, and disk partitions.
pt: Continue para o próximo capítulo para continuar com a instalação onde você irá configurar o idioma, rede, e partições de disco.

source: Booting an IA-64 system from the network is similar to a CD boot. The only difference is how the installation kernel is loaded. The EFI Boot Manager can load and start programs from a server on the network. Once the installation kernel is loaded and starts, the system install will proceed through the same steps as the CD install with the exception that the packages of the base install will be loaded from the network rather than the CD drive.
pt: Arrancar um sistema IA-64 a partir da rede é idêntico a arrancar a partir de CD. A única diferença é a forma como é carregado o kernel de instalação. O EFI Boot Manager pode carregar e iniciar programas a partir de um servidor na rede. Uma vez que o kernel de instalação esteja carregado e inicie, a instalação do sistema irá continuar através dos mesmos passos do que a instalação de CD com a excepção que os pacotes da instalação base serão carregados a partir da rede em vez do leitor de CD.

source: Network booting an IA-64 system requires two architecture-specific actions. On the boot server, DHCP and TFTP must be configured to deliver <command>elilo</command>. On the client a new boot option must be defined in the EFI boot manager to enable loading over a network.
pt: Arrancar a partir da rede num sistema IA-64 necessita de duas acções específicas da arquitectura. No servidor de arranque, DHCP e TFTP têm de estar configurados para entregarem o <command>elilo</command>. No cliente tem de ser definida uma nova opção de arranque no gestor de arranque EFI para permitir carregar através da rede.

source: Configuring the Server
pt: Configurar o Servidor

source: A suitable TFTP entry for network booting an IA-64 system looks something like this: <informalexample><screen> host mcmuffin { hardware ethernet 00:30:6e:1e:0e:83; fixed-address 10.0.0.21; filename "debian-installer/ia64/elilo.efi"; } </screen></informalexample> Note that the goal is to get <command>elilo.efi</command> running on the client.
pt: Uma entrada TFTP adequada para iniciar a partir da rede num sistema IA-64 parece-se um pouco como isto: <informalexample><screen> host mcmuffin { hardware ethernet 00:30:6e:1e:0e:83; fixed-address 10.0.0.21; filename "debian-installer/ia64/elilo.efi"; } </screen></informalexample> Note que o objectivo é pôr <command>elilo.efi</command> a correr no cliente.

source: Extract the <filename>netboot.tar.gz</filename> file into the directory used as the root for your tftp server. Typical tftp root directories include <filename>/var/lib/tftp</filename> and <filename>/tftpboot</filename>. This will create a <filename>debian-installer</filename> directory tree containing the boot files for an IA-64 system.
pt: Extraia o ficheiro <filename>netboot.tar.gz</filename> para o directório utilizado como raiz do seu servidor tftp. Tipicamente os directórios raiz de tftp incluem <filename>/var/lib/tftp</filename> e <filename>/tftpboot</filename>. Isto irá criar uma árvore de directórios <filename>debian-installer</filename> que contém os ficheiros de arranque para um sistema IA-64.

source: The <filename>netboot.tar.gz</filename> contains an <filename>elilo.conf</filename> file that should work for most configurations. However, should you need to make changes to this file, you can find it in the <filename>debian-installer/ia64/</filename> directory. It is possible to have different config files for different clients by naming them using the client's IP address in hex with the suffix <filename>.conf</filename> instead of <filename>elilo.conf</filename>. See documentation provided in the <classname>elilo</classname> package for details.
pt: O <filename>netboot.tar.gz</filename> contém um <filename>elilo.conf</filename> que deve funcionar com a maioria das configurações. No entanto, se você necessitar de fazer modificações no ficheiro pode encontrá-lo no directório <filename>debian-installer/ia64/</filename>. É possível ter vários ficheiros de configuração para diferentes clientes dando-lhes o nome do endereço IP do cliente em hexadecimal com o sufixo <filename>.conf</filename> em vez de <filename>elilo.conf</filename>. Para mais detalhes veja a documentação fornecida pelo pacote <classname>elilo</classname>.

source: Configuring the Client
pt: Configurar o Cliente

source: To configure the client to support TFTP booting, start by booting to EFI and entering the <guimenu>Boot Option Maintenance Menu</guimenu>. <itemizedlist> <listitem><para> Add a boot option. </para></listitem> <listitem><para> You should see one or more lines with the text <guimenuitem>Load File [Acpi()/.../Mac()]</guimenuitem>. If more than one of these entries exist, choose the one containing the MAC address of the interface from which you'll be booting. Use the arrow keys to highlight your choice, then press enter. </para></listitem> <listitem><para> Name the entry <userinput>Netboot</userinput> or something similar, save, and exit back to the boot options menu. </para></listitem> </itemizedlist> You should see the new boot option you just created, and selecting it should initiate a DHCP query, leading to a TFTP load of <filename>elilo.efi</filename> from the server.
pt: Para configurar o cliente para suportar arranque por TFTP, comece por arrancar em EFI e entre em <guimenu>Boot Option Maintenance Menu</guimenu>. <itemizedlist> <listitem><para> Adicione uma opção de arranque. </para></listitem> <listitem><para> Deve ver uma ou mais linhas com o texto <guimenuitem>Load File [Acpi ()/.../Mac()]</guimenuitem>. Se existir mais de uma destas entradas, escolha a que tem o endereço MAC do seu interface a partir do qual você irá arrancar. Utilize as teclas com setas para indicar a sua escolha, de seguida carregue em enter. </para></listitem> <listitem><para> Dê o nome <userinput>Netboot</userinput> ou algo similar, grave, e saia de novo para o menu de opções de arranque. </para></listitem> </itemizedlist> Você deve ver a nova opção de arranque acabada de criar, e ao seleccioná-la deve iniciar um query DHCP, levando a carregar <filename>elilo.efi</filename> via TFTP a partir do servidor.

source: The boot loader will display its prompt after it has downloaded and processed its configuration file. At this point, the installation proceeds with the same steps as a CD install. Select a boot option as in above and when the kernel has completed installing itself from the network, it will start the &debian; Installer.
pt: O gestor de arranque irá mostrar a sua linha de comandos após ter feito o download e processado o seu ficheiro de configuração. Neste ponto, a instalação continua com os mesmos passos do que a instalação por CD. Escolha uma opção de arranque tal como em cima quando o kernel completar de se instalar a ele próprio a partir da rede, e irá iniciar o Instalador &debian;.

source: SGI TFTP Booting
pt: Iniciar de TFTP em SGI

source: After entering the command monitor use <informalexample><screen> bootp(): </screen></informalexample> on SGI machines to boot linux and to begin installation of the &debian; Software. In order to make this work you may have to unset the <envar>netaddr</envar> environment variable. Type <informalexample><screen> unsetenv netaddr </screen></informalexample> in the command monitor to do this.
pt: Após ter entrado na consola utilize <informalexample><screen> bootp(): </screen></informalexample> em máquinas SGI para iniciar o Linux e para começar a instalação do software &debian;. Com o intuito de fazer com que isto funcione deve ter de retirar a variável de ambiente <envar>netaddr</envar>. Para fazer isto digite na consola<informalexample><screen> unsetenv netaddr </screen></informalexample>.

source: Boot Parameters
pt: Parâmetros de Arranque

source: On SGI machines you can append boot parameters to the <command>bootp():</command> command in the command monitor.
pt: Em máquinas SGI pode adicionar na consola parâmetros de arranque ao comando <command>bootp():</command>.

source: Following the <command>bootp():</command> command you can give the path and name of the file to boot if you did not give an explicit name via your bootp/dhcp server. Example: <informalexample><screen> bootp():/boot/tftpboot.img </screen></informalexample> Further kernel parameters can be passed via <command>append</command>:
pt: A seguir ao comando <command>bootp():</command> você pode indicar a path e o nome do ficheiro para arrancar se não deu um nome explícito através do seu servidor bootp/dhcp. Exemplo: <informalexample><screen> bootp():/boot/tftpboot.img </screen></informalexample> Parâmetros de kernel adicionais podem ser passados via <command>append</command>:

source: Cobalt TFTP Booting
pt: Iniciar o Cobalt TFTP
