Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/boot-installer.po
Languages: pt

source: Serial braille displays cannot safely be automatically detected (since that may damage some of them). You thus need to append the <userinput>brltty=<replaceable>driver</replaceable>,<replaceable>port</replaceable>,<replaceable>table</replaceable></userinput> boot parameter to tell <classname>brltty</classname> which driver it should use. <replaceable>driver</replaceable> should be replaced by the two-letter driver code for your terminal (see the <ulink url="&url-brltty-manual;">driver code list</ulink>). <replaceable>port</replaceable> should be replaced by the name of the serial port the display is connected to, <userinput>ttyS0</userinput> is the default. <replaceable>table</replaceable> is the name of the braille table to be used (see the <ulink url="&url-brltty-manual;">table code list</ulink>); the English table is the default. Note that the table can be changed later by entering the preference menu. Documentation on key bindings for braille devices is available on the <ulink url="&url-brltty-driver-help;"><classname>brltty</classname> website</ulink>.
pt: Os ecrãs braille série não podem ser automaticamente detectados em segurança (já que isso pode danificar alguns deles). Por isso terá de acrescentar o parâmetro de arranque <userinput>brltty=<replaceable>driver</replaceable>,<replaceable>port</replaceable>,<replaceable>tabela</replaceable></userinput> para dizer ao <classname>brltty</classname> qual o driver que deve utilizar. O <replaceable>driver</replaceable> deve ser substituído pelo código, de duas letras, para o seu terminal (veja a <ulink url="&url-brltty-driver-codes;">lista de códigos de drivers</ulink>). <replaceable>port</replaceable> deverá ser substituído pelo nome da porta série onde está ligado o ecrã, o predefinido é <userinput>ttyS0</userinput>. <replaceable>tabela</replaceable> é o nome da tabela braille a ser utilizada (veja a <ulink url="&url-brltty-manual;">lista de códigos de tabelas</ulink>); A tabela predefinida é a Inglesa. Note que a tabela pode ser alterada posteriormente ao entrar no menu de preferências. A documentação acerca das teclas de atalho para dispositivos braille está disponível no <ulink url="&url-brltty-driver-help;"> website <classname>brltty</classname></ulink>.

source: Hardware Speech Synthesis
pt: Hardware para Sintetizar Voz

source: Support for hardware speech synthesis devices is available only alongside support for graphical installer. You thus need to select the <quote>Graphical install</quote> entry in the boot menu.
pt: O suporte para hardware de dispositivos de síntese de voz está disponível apenas com o suporte do instalador gráfico. Por isso tem de seleccionar a entrada <quote>Instalador Gráfico</quote> no menu de arranque.

source: Hardware speech synthesis devices cannot be automatically detected. You thus need to append the <userinput>speakup.synth=<replaceable>driver</replaceable></userinput> boot parameter to tell <classname>speakup</classname> which driver it should use. <replaceable>driver</replaceable> should be replaced by the driver code for your device (see <ulink url="&url-speakup-driver-codes;">driver code list</ulink>). The textual version of the installer will then be automatically selected, and support for the speech synthesis device will be automatically installed on the target system.
pt: Os dispositivos de hardware para sintetizar voz não podem ser detectados automaticamente. Por isso tem de acrescentar o parâmetro de arranque <userinput>speakup.synth=<replaceable>driver</replaceable></userinput> para dizer ao <classname>speakup</classname> qual o driver que deve utilizar. <replaceable>driver</replaceable> deve ser substituído pelo código de driver para o seu dispositivo (veja a <ulink url="&url-speakup-driver-codes;">lista de códigos de driver</ulink>). A versão texto do instalador será então automaticamente escolhida, e o suporte para o dispositivo para sintetizar voz será automaticamente instalado no sistema alvo.

source: Board Devices
pt: Dispositivos em Placa

source: Some accessibility devices are actual boards that are plugged inside the machine and that read text directly from the video memory. To get them to work framebuffer support must be disabled by using the <userinput arch="x86">vga=normal</userinput> <userinput>fb=false</userinput> boot parameter. This will however reduce the number of available languages.
pt: Alguns dispositivos de acessibilidade são na verdade placas que são ligadas dentro da máquina e que lêem texto directamente da memória gráfica. Para pô-las a funcionar o suporte a framebuffer tem de ser desligado utilizando o parâmetro de arranque <userinput arch="x86">vga=normal</userinput> <userinput>fb=false</userinput>. No entanto isto irá reduzir o número de idiomas disponíveis.

source: If desired a textual version of the bootloader can be activated before adding the boot parameter by typing <userinput>h</userinput> &enterkey;.
pt: Se desejado, a versão textual do gestor de arranque pode ser activada antes acrescentando o parâmetro de arranque ao escrever <userinput>h</userinput> &enterkey;.

source: High-Contrast Theme
pt: Tema de Alto Contraste

source: For users with low vision, the installer can use a high-contrast theme that makes it more readable. To enable it, append the <userinput>theme=dark</userinput> boot parameter.
pt: Para utilizadores com pouca visão, o instalador pode utilizar um tema de alto contraste que se torna mais legível. Para o activar, acrescente o parâmetro de arranque <userinput>theme=dark</userinput>.

source: Boot parameters are Linux kernel parameters which are generally used to make sure that peripherals are dealt with properly. For the most part, the kernel can auto-detect information about your peripherals. However, in some cases you'll have to help the kernel a bit.
pt: Parâmetros de arranque são parâmetros do kernel Linux que são geralmente utilizados para certificar que os periféricos são tratados devidamente. Para a maioria, o kernel pode auto detectar informação sobre os seus periféricos. Contudo, em alguns casos terá de ajudar o kernel um pouco.

source: If this is the first time you're booting the system, try the default boot parameters (i.e., don't try setting parameters) and see if it works correctly. It probably will. If not, you can reboot later and look for any special parameters that inform the system about your hardware.
pt: Se esta é a primeira vez que está a iniciar o sistema, tente os parâmetros de arranque por omissão (i.e., não tente alterar os parâmetros) e veja se funciona correctamente. Provavelmente sim. Se não, pode mais tarde reiniciar e procurar por parâmetros especiais que informam o sistema do seu hardware.

source: Information on many boot parameters can be found in the <ulink url="http://www.tldp.org/HOWTO/BootPrompt-HOWTO.html"> Linux BootPrompt HOWTO</ulink>, including tips for obscure hardware. This section contains only a sketch of the most salient parameters. Some common gotchas are included below in <xref linkend="boot-troubleshooting"/>.
pt: Informação sobre muitos parâmetros de arranque podem ser encontrados em <ulink url="http://www.tldp.org/HOWTO/BootPrompt-HOWTO.html"> Linux BootPrompt HOWTO</ulink>, incluindo dicas para hardware obscuro. Esta secção contém apenas um esboço dos parâmetros mais distintos. Alguns truques para identificar problemas estão incluídos abaixo na <xref linkend="boot-troubleshooting"/>.

source: When the kernel boots, a message <informalexample><screen> Memory:<replaceable>avail</replaceable>k/<replaceable>total</replaceable>k available </screen></informalexample> should be emitted early in the process. <replaceable>total</replaceable> should match the total amount of RAM, in kilobytes. If this doesn't match the actual amount of RAM you have installed, you need to use the <userinput>mem=<replaceable>ram</replaceable></userinput> parameter, where <replaceable>ram</replaceable> is set to the amount of memory, suffixed with <quote>k</quote> for kilobytes, or <quote>m</quote> for megabytes. For example, both <userinput>mem=65536k</userinput> and <userinput>mem=64m</userinput> mean 64MB of RAM.
pt: Quando o kernel arranca, deve ser emitida no início do processo <informalexample><screen> Memory:<replaceable>avail</replaceable>k/<replaceable>total</replaceable>k. available </screen></informalexample> uma mensagem. <replaceable>total</replaceable> deve coincidir com a quantidade total de RAM, em kilobytes. Se isto não coincidir com a quantidade real de RAM que tem instalado, precisa de utilizar o parâmetro <userinput>mem=<replaceable>ram</replaceable></userinput>, onde <replaceable>ram</replaceable> é substituído pela quantidade de memória, seguido de <quote>k</quote> para kilobytes, ou <quote>m</quote> para megabytes. Por exemplo <userinput>mem=65536k</userinput> e <userinput>mem=64m</userinput> significam 64MB of RAM.

source: If you are booting with a serial console, generally the kernel will autodetect this. If you have a videocard (framebuffer) and a keyboard also attached to the computer which you wish to boot via serial console, you may have to pass the <userinput>console=<replaceable>device</replaceable></userinput> argument to the kernel, where <replaceable>device</replaceable> is your serial device, which is usually something like <filename>ttyS0</filename><footnote> <para> In order to ensure the terminal type used by the installer matches your terminal emulator, the parameter <userinput>TERM=<replaceable>type</replaceable></userinput> can be added. Note that the installer only supports the following terminal types: <literal>linux</literal>, <literal>bterm</literal>, <literal>ansi</literal>, <literal>vt102</literal> and <literal>dumb</literal>. The default for serial console in &d-i; is <userinput>vt102</userinput>. </para> </footnote>.
pt: Se estiver a arrancar com uma consola série, normalmente o kernel irá detectá-lo automaticamente. Se também tiver ligado uma placa gráfica (framebuffer) e um teclado ao computador no qual deseja arrancar através da consola série, poderá ter de passar o argumento <userinput>console=<replaceable>dispositivo</replaceable></userinput> ao kernel, onde <replaceable>dispositivo</replaceable> é o seu dispositivo série, que é normalmente algo parecido com <filename>ttyS0</filename><footnote> <para> De modo a assegurar que o tipo de terminal utilizado pelo instalador coincide com o do seu emulador de terminal, pode ser acrescentado o parâmetro <userinput>TERM=<replaceable>tipo</replaceable></userinput>. Note que o instalador apenas suporta os seguintes tipos de terminais: <literal>linux</literal>, <literal>bterm</literal>, <literal>ansi</literal>, <literal>vt102</literal> e <literal>dumb</literal>. O predefinido para a consola série no &d-i; é <userinput>vt102</userinput>. </para> </footnote>.

source: For &arch-title; the serial devices are <filename>ttya</filename> or <filename>ttyb</filename>. Alternatively, set the <envar>input-device</envar> and <envar>output-device</envar> OpenPROM variables to <filename>ttya</filename>.
pt: Para &arch-title; os dispositivos de série são <filename>ttya</filename> ou <filename>ttyb</filename>. Alternativamente, ajuste as variáveis OpenPROM <envar>input-device</envar> e <envar>output-device</envar> para <filename>ttya</filename>.

source: &debian; Installer Parameters
pt: Parâmetros de instalação &debian;

source: The installation system recognizes a few additional boot parameters<footnote> <para> With current kernels (2.6.9 or newer) you can use 32 command line options and 32 environment options. If these numbers are exceeded, the kernel will panic. </para> </footnote> which may be useful.
pt: O sistema de instalação reconhece alguns parâmetros de arranque adicionais <footnote> <para> Com os actuais kernels (2.6.9 e posteriores) pode utilizar até 32 opções de linha de comandos e 32 opções de ambiente. Se este números forem excedidos ocorrerá um kernel panic (colapso). </para> </footnote> que poderão ser úteis.

source: A number of parameters have a <quote>short form</quote> that helps avoid the limitations of the kernel command line options and makes entering the parameters easier. If a parameter has a short form, it will be listed in brackets behind the (normal) long form. Examples in this manual will normally use the short form too.
pt: Um certo número de parâmetros têm o formato <quote>abreviatura</quote> que ajuda a evitar as limitações das opções da linha de comandos do kernel e torna a introdução de parâmetros mais fácil. Se um parâmetro tem uma forma resumida, será listado entre parêntesis atrás da forma (normal) mais longa. Os exemplos neste manual normalmente também irão utilizar a forma abreviada.

source: debconf/priority (priority)
pt: debconf/priority (prioridade)

source: This parameter sets the lowest priority of messages to be displayed.
pt: Este parâmetro ajusta a prioridade mínima das mensagens a serem mostradas.

source: The default installation uses <userinput>priority=high</userinput>. This means that both high and critical priority messages are shown, but medium and low priority messages are skipped. If problems are encountered, the installer adjusts the priority as needed.
pt: A instalação por omissão utiliza <userinput>priority=high</userinput>. Isto significa que ambas as mensagem de prioridade alta e crítica irão ser mostradas, mas as mensagens de média e baixa prioridade não. Se forem encontrados problemas, o instalador ajusta a prioridade conforme necessário.

source: If you add <userinput>priority=medium</userinput> as boot parameter, you will be shown the installation menu and gain more control over the installation. When <userinput>priority=low</userinput> is used, all messages are shown (this is equivalent to the <emphasis>expert</emphasis> boot method). With <userinput>priority=critical</userinput>, the installation system will display only critical messages and try to do the right thing without fuss.
pt: Se acrescentou <userinput>priority=medium</userinput> como parâmetro de arranque irá-lhe ser mostrado o menu de instalação e assim ganhar mais controlo sobre a instalação. Quando é utilizado <userinput>priority=low</userinput> todas as mensagens são mostradas (Isto é equivalente ao método de arranque <emphasis>expert</emphasis>). Com <userinput>priority=critical</userinput>, o sistema de instalação irá mostrar somente as mensagens críticas e tentará optar pelas opções correctas sem grande confusão.

source: This boot parameter controls the type of user interface used for the installer. The current possible parameter settings are: <itemizedlist> <listitem> <para><userinput>DEBIAN_FRONTEND=noninteractive</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=text</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=newt</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=gtk</userinput></para> </listitem> </itemizedlist> The default frontend is <userinput>DEBIAN_FRONTEND=newt</userinput>. <userinput>DEBIAN_FRONTEND=text</userinput> may be preferable for serial console installs. Generally, only the <userinput>newt</userinput> frontend is available on default install media. On architectures that support it, the graphical installer uses the <userinput>gtk</userinput> frontend.
pt: Este parâmetro de arranque controla o tipo de interface para o utilizador que é utilizado para o instalador. Os actuais parâmetros possíveis são: <itemizedlist> <listitem> <para><userinput>DEBIAN_FRONTEND=noninteractive</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=newt</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=gtk</userinput></para> </listitem> </itemizedlist> O frontend por omissão é <userinput>DEBIAN_FRONTEND=newt</userinput>. Pode ser preferível utilizar <userinput>DEBIAN_FRONTEND=text</userinput> para instalações de consolas série. Geralmente apenas o frontend <userinput>newt</userinput> está disponível no meio de instalação por omissão. Em arquitecturas que o suportam, o instalador gráfico utiliza o frontend <userinput>gtk</userinput>.

source: Setting this boot parameter to 2 will cause the installer's boot process to be verbosely logged. Setting it to 3 makes debug shells available at strategic points in the boot process. (Exit the shells to continue the boot process.)
pt: Definir este parâmetro de arranque para 2 irá fazer com que o processo de arranque da instalação seja feito com um registo detalhado. Defini-lo para 3 faz com que estejam disponíveis shells de debug em pontos estratégicos do processo de arranque. (Sair das shells para continuar o processo de arranque.)

source: This is the default.
pt: Isto é por omissão

source: More verbose than usual.
pt: Mais detalhes que o habitual

source: Lots of debugging information.
pt: Muita informação de eliminação de erros.

source: Shells are run at various points in the boot process to allow detailed debugging. Exit the shell to continue the boot.
pt: As shells são executadas em vários pontos do processo de arranque para permitir um debugging detalhado. Saia para a shell para continuar o arranque.

source: The value of the parameter is the path to the device to load the &debian; installer from. For example, <userinput>INSTALL_MEDIA_DEV=/dev/floppy/0</userinput>
pt: O valor do parâmetro é o caminho para o dispositivo por onde carregar o instalador &debian;. Por exemplo, <userinput>INSTALL_MEDIA_DEV=/dev/floppy/0</userinput>

source: The boot floppy, which normally scans all floppies it can to find the root floppy, can be overridden by this parameter to only look at the one device.
pt: A disquete de arranque, que normalmente procura todas as disquetes que poder para encontrar a disquete root, pode ser ultrapassado por este parâmetro para apenas olhar para um dispositivo.

source: Can be used to force the installer to a lowmem level higher than the one the installer sets by default based on available memory. Possible values are 1 and 2. See also <xref linkend="lowmem"/>.
pt: Pode ser utilizado para forçar o instalador para um nível de baixa memória superior ao que o instalador define baseado na memória disponível. Os valores possíveis são 1 e 2. Veja também <xref linkend="lowmem"/>.

source: Prevents the installer from offering interactive shells on tty2 and tty3. Useful for unattended installations where physical security is limited.
pt: Previne que o instalador ofereça shells interactivas no tty2 e tty3. Útil para instalações à distância em que a segurança física é limitada.

source: Some architectures use the kernel framebuffer to offer installation in a number of languages. If framebuffer causes a problem on your system you can disable the feature using the parameter <userinput arch="x86">vga=normal</userinput> <userinput>fb=false</userinput>. Problem symptoms are error messages about bterm or bogl, a blank screen, or a freeze within a few minutes after starting the install.
pt: Algumas arquitecturas utilizam o framebuffer do kernel para oferecer uma instalação em várias línguas. Se o framebuffer causar problemas no seu sistema pode desactivar esta funcionalidade utilizando o parâmetro <userinput arch="x86">vga=normal</userinput> <userinput>fb=false</userinput>. Os sintomas do problema são mensagens de erro sobre bterm ou bogl, um ecrã em branco, ou uma paragem alguns minutos após o início da instalação.

source: Such problems have been reported on hppa.
pt: Tais problemas foram reportados em hppa.

source: Because of display problems on some systems, framebuffer support is <emphasis>disabled by default</emphasis> for &arch-title;. This can result in ugly display on systems that do properly support the framebuffer, like those with ATI graphical cards. If you see display problems in the installer, you can try booting with parameter <userinput>debian-installer/framebuffer=true</userinput> or <userinput>fb=true</userinput> for short.
pt: Devido a problemas de visualização em alguns sistemas, o suporte a framebuffer está <emphasis>desactivado por omissão</emphasis> para &arch-title;. Isto pode resultar numa visualização feia em sistemas que suportam framebuffer, como aqueles com placas gráficas ATI. Se vir problemas de visualização no instalador, pode tentar arrancar com o parâmetro <userinput>debian-installer/framebuffer=true</userinput> ou <userinput>fb=true</userinput>, abreviado.

source: A theme determines how the user interface of the installer looks (colors, icons, etc.). What themes are available differs per frontend. Currently both the newt and gtk frontends only have a <quote>dark</quote> theme that was designed for visually impaired users. Set the theme by booting with <userinput>theme=<replaceable>dark</replaceable></userinput>.
pt: Um tema determina como vai parecer o interface com o utilizador (cores, ícones, etc.) Os temas disponíveis diferem por frontend. Actualmente ambos os interfaces newt e gtk têm um tema <quote>dark</quote> que foi desenhado para os utilizadores com dificuldades de visão. Escolha o tema arrancando com <userinput>theme=<replaceable>dark</replaceable></userinput>.

source: By default, the &d-i; automatically probes for network configuration via DHCP. If the probe succeeds, you won't have a chance to review and change the obtained settings. You can get to the manual network setup only in case the DHCP probe fails.
pt: Por omissão o &d-i; sonda automaticamente a configuração de rede via DHCP. Se a sonda for bem sucedida, não terá a oportunidade de rever e alterar os ajustes obtidos. Apenas conseguirá fazer uma configuração manual da rede em caso do probe DHCP falhar.

source: If you have a DHCP server on your local network, but want to avoid it because e.g. it gives wrong answers, you can use the parameter <userinput>netcfg/disable_dhcp=true</userinput> to prevent configuring the network with DHCP and to enter the information manually.
pt: Se tem um servidor DHCP na sua rede local, mas quer evitar utilizá-lo ex.: devolve respostas erradas, pode utilizar o parâmetro <userinput>netcfg/disable_dhcp=true</userinput> que previne que a rede não seja configurada por DHCP e que a informação seja inserida manualmente.

source: Set to <userinput>false</userinput> to prevent starting PCMCIA services, if that causes problems. Some laptops are well known for this misbehavior.
pt: Ponha como <userinput>false</userinput> para prevenir que sejam iniciados serviços PCMCIA, se isso causar problemas. Alguns portáteis são bem conhecidos por este mau comportamento.

source: Set to <userinput>true</userinput> to enable support for Serial ATA RAID (also called ATA RAID, BIOS RAID or fake RAID) disks in the installer. Note that this support is currently experimental. Additional information can be found on the <ulink url="&url-d-i-wiki;">&debian; Installer Wiki</ulink>.
pt: Definido como <userinput>true</userinput> para habilitar o suporte para discos RAID Serial ATA (também chamado de ATA RAID, BIOS RAID ou 'fake RAID') no instalador. Note que este suporte actualmente é experimental. Pode ser encontrada informação adicional no <ulink url="&url-d-i-wiki;">Wiki do Instalador &debian;</ulink>.

source: Specify the url to a preconfiguration file to download and use for automating the install. See <xref linkend="automatic-install"/>.
pt: Especifique o url para o download de um ficheiro de pré-configuração e para utilização para automatizar a instalação. Veja a <xref linkend="automatic-install"/>.

source: Specify the path to a preconfiguration file to load for automating the install. See <xref linkend="automatic-install"/>.
pt: Especifique o caminho para carregar um ficheiro de pré-configuração para a automatização da instalação. Veja a <xref linkend="automatic-install"/>.
