Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/boot-installer.po
Languages: pt

source: Set to <userinput>true</userinput> to display questions even if they have been preseeded. Can be useful for testing or debugging a preconfiguration file. Note that this will have no effect on parameters that are passed as boot parameters, but for those a special syntax can be used. See <xref linkend="preseed-seenflag"/> for details.
pt: Defina como <userinput>true</userinput> para mostrar as questões mesmo que a estas tenha sido feito preseed. Pode ser útil para testar ou depurar um ficheiro de pré-configuração. Note que isto não terá qualquer efeito em parâmetros são passados como parâmetros de arranque, mas pode ser utilizado para aqueles com uma sintaxe especial. Para detalhes veja <xref linkend="preseed-seenflag"/>.

source: Delay questions that are normally asked before preseeding is possible until after the network is configured. See <xref linkend="preseed-auto"/> for details about using this to automate installs.
pt: Perguntas retardadas são normalmente perguntadas antes de ser possível de fazer preseed até depois da rede estar configurada. Para detalhes acerca de como utilizar isto para automatizar instalações veja <xref linkend="preseed-auto"/>.

source: During installations from serial or management console, the regular virtual consoles (VT1 to VT6) are normally disabled in <filename>/etc/inittab</filename>. Set to <userinput>true</userinput> to prevent this.
pt: Durante as instalações a partir da consola série ou de gestão, os consolas virtuais normais (VT1 a VT6) normalmente estão desactivadas em <filename>/etc/inittab</filename>. Defina para <userinput>true</userinput> para evitar isto.

source: By default, before rebooting, &d-i; automatically ejects the optical media used during the installation. This can be unnecessary if the system does not automatically boot off the CD. In some cases it may even be undesirable, for example if the optical drive cannot reinsert the media itself and the user is not there to do it manually. Many slot loading, slim-line, and caddy style drives cannot reload media automatically.
pt: Por omissão, antes de reiniciar, o &d-i; ejecta automaticamente o media óptico utilizado durante a instalação. Isto poderá ser desnecessário se o sistema não iniciar automaticamente de CD. Em alguns casos pode até não ser desejável, por exemplo se o drive óptica não conseguir inserir novamente o media sozinha e o utilizador não estiver lá para o fazer manualmente. Muitas drives de carregamento de slots, slim-line, e caddy style não conseguem recarregar automaticamente.

source: Set to <userinput>false</userinput> to disable automatic ejection, and be aware that you may need to ensure that the system does not automatically boot from the optical drive after the initial installation.
pt: Coloque <userinput>false</userinput> para desactivar ejecção automática, e fique atento pois pode necessitar de assegurar que o sistema não inicia automaticamente a partir da drive optical após a instalação inicial.

source: By setting this option to <userinput>false</userinput>, the package management system will be configured to not automatically install <quote>Recommends</quote>, both during the installation and for the installed system. See also <xref linkend="di-install-base"/>.
pt: Ao definir esta opção como <userinput>falso</userinput>, o sistema de gestão de pacotes irá ser configurado para não instalar automaticamente os pacotes de <quote>Recommends</quote>, quer durante a instalação quer para o sistema instalado. Veja também <xref linkend="di-install-base"/>.

source: Note that this option allows to have a leaner system, but can also result in features being missing that you might normally expect to be available. You may have to manually install some of the recommended packages to obtain the full functionality you want. This option should therefore only be used by very experienced users.
pt: Note que esta opção permite ter um sistema mais 'leve', mas também pode resultar em falta de funcionalidades que normalmente espera que estejam disponíveis. Terá de instalar manualmente alguns dos pacotes recomendados para obter totalmente a funcionalidade que deseja. Por isso esta opção apenas deve ser utilizada por utilizadores muito experientes.

source: By default the installer requires that repositories be authenticated using a known gpg key. Set to <userinput>true</userinput> to disable that authentication. <emphasis role="bold">Warning: insecure, not recommended.</emphasis>
pt: Por omissão o instalador necessita que os repositórios sejam autenticados utilizando uma chave gpg conhecida. Coloque como <userinput>true</userinput> para desabilitar essa autenticação. <emphasis role="bold">Aviso: inseguro, e não recomendado.</emphasis>

source: This parameter should already be set to a correct value where needed; set it only it you see errors during the boot that indicate the ramdisk could not be loaded completely. The value is in kB.
pt: Este parâmetro já deve estar definido para um valor correcto onde necessário; defina-o se vir erros durante o arranque que indiquem que o ramdisk não pode ser completamente carregado. O valor é em kB.

source: Set to <userinput>true</userinput> to enter rescue mode rather than performing a normal installation. See <xref linkend="rescue"/>.
pt: Defina como <userinput>true</userinput> para entrar em modo de recuperação em vez de efectuar uma instalação normal. Veja a <xref linkend="rescue"/>.

source: Using boot parameters to answer questions
pt: Utilizar parâmetros de arranque para responder a questões

source: With some exceptions, a value can be set at the boot prompt for any question asked during the installation, though this is only really useful in specific cases. General instructions how to do this can be found in <xref linkend="preseed-bootparms"/>. Some specific examples are listed below.
pt: Com algumas excepções, pode ser definido um valor na prompt de arranque para qualquer questão colocada durante a instalação, apesar de isto ser apenas possível em casos específicos. Instruções gerais acerca de como fazer isto podem ser encontradas em <xref linkend="preseed-bootparms"/>. Alguns exemplos específicos estão listados abaixo.

source: There are two ways to specify the language, country and locale to use for the installation and the installed system.
pt: Existem duas formas de especificar o idioma, país e locale a utilizar para a instalação e para o sistema instalado.

source: The first and easiest is to pass only the parameter <literal>locale</literal>. Language and country will then be derived from its value. You can for example use <userinput>locale=de_CH</userinput> to select German as language and Switzerland as country (<literal>de_CH.UTF-8</literal> will be set as default locale for the installed system). Limitation is that not all possible combinations of language, country and locale can be achieved this way.
pt: O primeiro, e mais fácil, é passar apenas o parâmetro <literal>locale</literal>. O idioma e o país serão derivados a partir do seu valor. Pode, por exemplo, utilizar <userinput>locale=de_CH</userinput> para escolher Alemão como idioma e Suíça como país (<literal>de_CH.UTF-8</literal> será definido como locale predefinido para o sistema instalado). A limitação é que não podem ser feitas todas as combinações de idioma, países e locales.

source: The second, more flexible option is to specify <literal>language</literal> and <literal>country</literal> separately. In this case <literal>locale</literal> can optionally be added to specify a specific default locale for the installed system. Example: <userinput>language=en country=DE locale=en_GB.UTF-8</userinput>.
pt: A segunda opção, e a mais flexível, é especificar separadamente <literal>language</literal> e <literal>country</literal>. Neste caso <literal>locale</literal> pode, opcionalmente, ser acrescentado para especificar um locale especifico predefinido para o sistema instalado. Exemplo: <userinput>language=en country=DE locale=en_GB.UTF-8</userinput>.

source: Can be used to automatically load installer components that are not loaded by default. Examples of optional components that may be useful are <classname>openssh-client-udeb</classname> (so you can use <command>scp</command> during the installation)<phrase arch="not-s390"> and <classname>ppp-udeb</classname> (see <xref linkend="pppoe"/>)</phrase>.
pt: Pode ser utilizado para automaticamente carregar componentes do instalador que não são carregados por omissão. Exemplos de componentes opcionais que poderão ser úteis são o <classname>openssh-client-udeb</classname> (para que possa utilizar o <command>scp</command> durante a instalação)<phrase arch="not-s390"> e o <classname>ppp-udeb</classname> (veja <xref linkend="pppoe"/>)</phrase>.

source: Set to <userinput>true</userinput> if you want to disable DHCP and instead force static network configuration.
pt: Defina para <userinput>true</userinput> se deseja desligar DHCP e forçar a configuração de rede estática.

source: By default the installer will use the http protocol to download files from &debian; mirrors and changing that to ftp is not possible during installations at normal priority. By setting this parameter to <userinput>ftp</userinput>, you can force the installer to use that protocol instead. Note that you cannot select an ftp mirror from a list, you have to enter the hostname manually.
pt: Por omissão o instalador irá utilizar o protocolo http para fazer download aos ficheiros em mirrors &debian; e mudar isso para ftp não é possível durante as instalações em prioridade normal. Ao definir este parâmetro para <userinput>ftp</userinput>, pode forçar o instalador a utilizar este protocolo. Note que não pode escolher um mirror ftp a partir de uma lista, tem de introduzir manualmente o nome da máquina.

source: Can be used to select tasks that are not available from the interactive task list, such as the <literal>kde-desktop</literal> task. See <xref linkend="pkgsel"/> for additional information.
pt: Pode ser utilizado para escolher tarefas que não estão disponíveis a partir da lista interactiva de tarefas, tal como a tarefa <literal>kde-desktop</literal>. Veja <xref linkend="pkgsel"/> para informações adicionais.

source: Passing parameters to kernel modules
pt: Passagem de argumentos a módulos do kernel

source: If drivers are compiled into the kernel, you can pass parameters to them as described in the kernel documentation. However, if drivers are compiled as modules and because kernel modules are loaded a bit differently during an installation than when booting an installed system, it is not possible to pass parameters to modules as you would normally do. Instead, you need to use a special syntax recognized by the installer which will then make sure that the parameters are saved in the proper configuration files and will thus be used when the modules are actually loaded. The parameters will also be propagated automatically to the configuration for the installed system.
pt: Se os drivers estiverem compilados no kernel, pode passar-lhes parâmetros tal como é descrito na documentação do kernel. No entanto, se os drivers estiverem compilados como módulos e porque os módulos de kernel são carregados de uma forma um pouco diferente durante a instalação do que quando arranca um sistema já instalado, não é possível passar parâmetros a módulos como normalmente faria. Em vez disso, você tem de utilizar uma sintaxe especial reconhecida pelo instalador que se assegura que os parâmetros são guardados nos devidos ficheiros de configuração e por isso serão utilizados quando os módulos forem carregados. Os parâmetros também se propagarão automaticamente na configuração para o sistema instalado.

source: Note that it is now quite rare that parameters need to be passed to modules. In most cases the kernel will be able to probe the hardware present in a system and set good defaults that way. However, in some situations it may still be needed to set parameters manually.
pt: Note que agora é extremamente raro ser necessário passar parâmetros a módulos. Na maioria dos casos o kernel conseguirá detectar o hardware presente num sistema e definir dessa forma bons valores por omissão. No entanto, em algumas situações poderá ser necessário definir manualmente os parâmetros.

source: The syntax to use to set parameters for modules is: <informalexample><screen> <replaceable>module_name</replaceable>.<replaceable>parameter_name</replaceable>=<replaceable>value</replaceable> </screen></informalexample> If you need to pass multiple parameters to the same or different modules, just repeat this. For example, to set an old 3Com network interface card to use the BNC (coax) connector and IRQ 10, you would pass:
pt: A sintaxe a utilizar para definir parâmetros para o módulo é: <informalexample><screen> <replaceable>nome_módulo</replaceable>.<replaceable>parameter_name</replaceable>=<replaceable>valor</replaceable> </screen></informalexample> Se necessitar passar vários parâmetros ao mesmo ou a diferentes módulos, basta repetir isto. Por exemplo, para fazer com que uma velha placa de rede 3Com utilize o conector BNC (coaxial) e o IRQ 10, você deve passar:

source: Blacklisting kernel modules
pt: Colocar módulos do kernel na 'lista negra'

source: Sometimes it may be necessary to blacklist a module to prevent it from being loaded automatically by the kernel and udev. One reason could be that a particular module causes problems with your hardware. The kernel also sometimes lists two different drivers for the same device. This can cause the device to not work correctly if the drivers conflict or if the wrong driver is loaded first.
pt: Por vezes pode ser necessário colocar um módulo na lista negra para prevenir que este seja carregado automaticamente pelo kernel e pelo udev. Uma razão pode ser que um módulo em particular cause problemas com o seu hardware. O kernel por vezes, também, lista dois controladores diferentes para o mesmo dispositivo. Isto pode fazer com que o dispositivo não funcione correctamente se os controladores estiverem em conflito ou se o controlador errado for carregado primeiro.

source: You can blacklist a module using the following syntax: <userinput><replaceable>module_name</replaceable>.blacklist=yes</userinput>. This will cause the module to be blacklisted in <filename>/etc/modprobe.d/blacklist.local</filename> both during the installation and for the installed system.
pt: Pode colocar um módulo na lista negra utilizando a seguinte sintaxe: <userinput><replaceable>nome_do_módulo</replaceable>.blacklist=yes</userinput>. Isto fará com que o módulo seja colocado na lista negra em <filename>/etc/modprobe.d/blacklist.local</filename> quer para a instalação, quer para o sistema instalado.

source: Note that a module may still be loaded by the installation system itself. You can prevent that from happening by running the installation in expert mode and unselecting the module from the list of modules displayed during the hardware detection phases.
pt: Note que um módulo pode ser à mesma carregado pelo próprio sistema de instalação. Você pode prevenir que isto aconteça ao correr o instalador em modo expert e desseleccionar o módulo a partir da lista de módulos mostrada durante as fases de detecção de hardware.

source: Troubleshooting the Installation Process
pt: Diagnosticar Problemas no Processo de Instalação

source: CD-ROM Reliability
pt: Fiabilidade do CD-ROM

source: Sometimes, especially with older CD-ROM drives, the installer may fail to boot from a CD-ROM. The installer may also &mdash; even after booting successfully from CD-ROM &mdash; fail to recognize the CD-ROM or return errors while reading from it during the installation.
pt: Por vezes, especialmente em leitores de CD-ROM antigos, o instalador pode falhar o arranque a partir de um CD-ROM. O instalador pode também &mdash; mesmo após ter arrancado com sucesso a partir de CD-ROM &mdash; falhar o reconhecimento do CD-ROM ou durante a instalação retornar erros ao ler a partir deste.

source: There are many different possible causes for these problems. We can only list some common issues and provide general suggestions on how to deal with them. The rest is up to you.
pt: Existem muitas possíveis causas diferentes para estes problemas. Podemos apenas listar alguns dos problemas usuais e disponibilizar sugestões gerais acerca de como lidar com eles. O resto é consigo.

source: There are two very simple things that you should try first.
pt: Existem duas coisas muito simples que deve tentar primeiro.

source: If the CD-ROM does not boot, check that it was inserted correctly and that it is not dirty.
pt: Se o CD-ROM não arrancar, verifique se foi inserido correctamente e se não está sujo.

source: If the installer fails to recognize a CD-ROM, try just running the option <menuchoice> <guimenuitem>Detect and mount CD-ROM</guimenuitem> </menuchoice> a second time. Some DMA related issues with older CD-ROM drives are known to be resolved in this way.
pt: Se o instalador falhar o reconhecimento de um CD-ROM, tente apenas correr a opção <menuchoice> <guimenuitem>Detectar e montar o CD-ROM</guimenuitem> </menuchoice> uma segunda vez. É conhecido que alguns problemas relacionados com DMA em leitores de CD-ROM antigos se resolvem desta forma.

source: If this does not work, then try the suggestions in the subsections below. Most, but not all, suggestions discussed there are valid for both CD-ROM and DVD, but we'll use the term CD-ROM for simplicity.
pt: Se isto não funcionar, então tente as sugestões nas sub-secções abaixo. A maioria, mas não todas, as sugestões discutidas são válidas quer para CD-ROM quer para DVD, mas utilizaremos o termo CD-ROM pela simplicidade.

source: If you cannot get the installation working from CD-ROM, try one of the other installation methods that are available.
pt: Se não puder pôr a instalação a funcionar a partir de CD-ROM, tente um dos outros métodos de instalação que estão disponíveis.

source: Common issues
pt: Problemas usuais

source: Some older CD-ROM drives do not support reading from discs that were burned at high speeds using a modern CD writer.
pt: Alguns leitores de CD-ROM antigos não suportam a leitura a partir de discos que foram gravados a altas velocidades com um gravador de CDs moderno.

source: If your system boots correctly from the CD-ROM, it does not necessarily mean that &arch-kernel; also supports the CD-ROM (or, more correctly, the controller that your CD-ROM drive is connected to).
pt: Se o seu sistema arranca correctamente a partir de CD-ROM, não significa necessariamente que &arch-kernel; também suporte o CD-ROM (ou, mais correctamente, o controlador ao qual o seu leitor de CD-ROMs está ligado).

source: Some older CD-ROM drives do not work correctly if <quote>direct memory access</quote> (DMA) is enabled.
pt: Alguns leitores de CD-ROM mais antigos não trabalham correctamente se o <quote>acesso directo à memória</quote> (DMA) estiver activado.

source: How to investigate and maybe solve issues
pt: Como investigar e talvez resolver problemas

source: If the CD-ROM fails to boot, try the suggestions listed below.
pt: Se o CD-ROM falhar o arranque, tente as sugestões listadas abaixo.

source: Check that your BIOS actually supports booting from CD-ROM (older systems possibly don't) and that your CD-ROM drive supports the media you are using.
pt: Verifique se a BIOS na realidade suporta arrancar a partir de CD-ROM (os sistemas mais antigos possivelmente não) e que o seu leitor de CD-ROMs suporta o disco que está a utilizar.

source: If you downloaded an iso image, check that the md5sum of that image matches the one listed for the image in the <filename>MD5SUMS</filename> file that should be present in the same location as where you downloaded the image from. <informalexample><screen> $ md5sum <replaceable>debian-testing-i386-netinst.iso</replaceable> a20391b12f7ff22ef705cee4059c6b92 <replaceable>debian-testing-i386-netinst.iso</replaceable> </screen></informalexample> Next, check that the md5sum of the burned CD-ROM matches as well. The following command should work. It uses the size of the image to read the correct number of bytes from the CD-ROM.
pt: Se fez o download de uma imagem iso, verifique se o md5sum dessa imagem coincide com o que está listado para a imagem no ficheiro <filename>MD5SUMS</filename> que deve estar presente no mesmo local de onde fez o download da imagem. <informalexample><screen> $ md5sum <replaceable>debian-testing-i386-netinst.iso</replaceable> a20391b12f7ff22ef705cee4059c6b92 <replaceable>debian-testing-i386-netinst.iso</replaceable> </screen></informalexample> De seguida, verifique se o md5sum do CD-ROM gravado também coincide. O seguinte comando deve funcionar. Utiliza o tamanho da imagem para ler o número de bytes correcto a partir do CD-ROM.

source: If, after the installer has been booted successfully, the CD-ROM is not detected, sometimes simply trying again may solve the problem. If you have more than one CD-ROM drive, try changing the CD-ROM to the other drive. If that does not work or if the CD-ROM is recognized but there are errors when reading from it, try the suggestions listed below. Some basic knowledge of &arch-kernel; is required for this. To execute any of the commands, you should first switch to the second virtual console (VT2) and activate the shell there.
pt: Se, após o instalador ter arrancado com sucesso, o CD-ROM não for detectado, simplesmente tentar novamente poderá resolver o problema. Se tiver mais do que um leitor de CD-ROMs, tente mudar o CD-ROM para o outro leitor. Se isso não funcionar ou se o CD-ROM for reconhecido mas existirem erros quando ler a partir dele, tente as sugestões listadas abaixo. Para isto serão necessários alguns conhecimentos básicos de &arch-kernel;. Para executar qualquer dos comandos, deve primeiro mudar para a segunda consola virtual (VT2) e activar lá a shell.

source: Switch to VT4 or view the contents of <filename>/var/log/syslog</filename> (use <command>nano</command> as editor) to check for any specific error messages. After that, also check the output of <command>dmesg</command>.
pt: Mude para o VT4 ou veja o conteúdo de <filename>/var/log/syslog</filename> (utilize o <command>nano</command> como editor) para ver alguma mensagem de erro específica. Depois disso, veja a saída de <command>dmesg</command>.

source: Check in the output of <command>dmesg</command> if your CD-ROM drive was recognized. You should see something like (the lines do not necessarily have to be consecutive): <informalexample><screen> Probing IDE interface ide1... hdc: TOSHIBA DVD-ROM SD-R6112, ATAPI CD/DVD-ROM drive ide1 at 0x170-0x177,0x376 on irq 15 hdc: ATAPI 24X DVD-ROM DVD-R CD-R/RW drive, 2048kB Cache, UDMA(33) Uniform CD-ROM driver Revision: 3.20 </screen></informalexample> If you don't see something like that, chances are the controller your CD-ROM is connected to was not recognized or may be not supported at all. If you know what driver is needed for the controller, you can try loading it manually using <command>modprobe</command>.
pt: Verifique na saída de <command>dmesg</command> para ver se o seu leitor de CD-ROMs foi reconhecido. Você deve ver algo como (estas linhas não têm necessariamente de ser consecutivas): <informalexample><screen> Probing IDE interface ide1... hdc: TOSHIBA DVD-ROM SD-R6112, ATAPI CD/DVD-ROM drive ide1 at 0x170-0x177,0x376 on irq 15 hdc: ATAPI 24X DVD-ROM DVD-R CD-R/RW drive, 2048kB Cache, UDMA(33) Uniform CD-ROM driver Revision: 3.20 </screen></informalexample> Se não vir algo como isso, existe a possibilidade do controlador a que o seu CD-ROM está ligado não tenha sido reconhecido ou não é suportado. Se sabe que controlador é necessário para este leitor, deve tentar carregá-lo manualmente utilizando o <command>modprobe</command>.
