Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/boot-installer.po
Languages: pt

source: If you have a working &debian; system, the easiest way to send an installation report is to install the <classname>installation-report</classname> and <classname>reportbug</classname> packages (<command>aptitude install installation-report reportbug</command>), configure <classname>reportbug</classname> as explained in <xref linkend="mail-outgoing"/>, and run the command <command>reportbug installation-reports</command>.
pt: Se tem um sistema &debian; funcional, a forma mais fácil de enviar relatórios de instalação é instalar os pacotes <classname>installation-report</classname> e <classname>reportbug</classname> (<command>aptitude install installation-report reportbug</command>), configure o <classname>reportbug</classname> como é explicado em <xref linkend="mail-outgoing"/>, e corra o comando <command>reportbug installation-reports</command>.

source: Alternatively you can use this template when filling out installation reports, and file the report as a bug report against the <classname>installation-reports</classname> pseudo package, by sending it to <email>submit@bugs.debian.org</email>. <informalexample><screen> Package: installation-reports Boot method: &lt;How did you boot the installer? CD? floppy? network?&gt; Image version: &lt;Full URL to image you downloaded is best&gt; Date: &lt;Date and time of the install&gt; Machine: &lt;Description of machine (eg, IBM Thinkpad R32)&gt; Processor: Memory: Partitions: &lt;df -Tl will do; the raw partition table is preferred&gt; Output of lspci -knn (or lspci -nn): Base System Installation Checklist: [O] = OK, [E] = Error (please elaborate below), [ ] = didn't try it Initial boot: [ ] Detect network card: [ ] Configure network: [ ] Detect CD: [ ] Load installer modules: [ ] Detect hard drives: [ ] Partition hard drives: [ ] Install base system: [ ] Clock/timezone setup: [ ] User/password setup: [ ] Install tasks: [ ] Install boot loader: [ ] Overall install: [ ] Comments/Problems: &lt;Description of the install, in prose, and any thoughts, comments and ideas you had during the initial install.&gt; </screen></informalexample> In the bug report, describe what the problem is, including the last visible kernel messages in the event of a kernel hang. Describe the steps that you did which brought the system into the problem state.
pt: Em alternativa pode utilizar este modelo quando preencher relatórios de instalação, e arquivar o relatório como relato de bug contra o pseudo-pacote <classname>installation-reports</classname>, enviando-o para <email>submit@bugs.debian.org</email>. <informalexample><screen> Package: installation-reports Método de arranque: &lt;Como arrancou o instalador? CD? disquete? rede?&gt; Versão da imagem: &lt;é melhor o URL completo para a imagem de que fez o download&gt; Data: &lt; Data e hora da instalação&gt; Máquina: &lt;Descrição da máquina (ex, IBM Thinkpad R32)&gt; Processador: Memória: Partições: &lt;df -Tl serve; é preferida a tabela de partições em bruto&gt; Saída de lspci -knn (ou lspci -nn): Checklist da Instalação do Sistema Base [O] = OK, [E] = Erro (por favor descreva abaixo), [ ] = não foi tentado Arranque inicial: [ ] Detectar placa de rede: [ ] Configurar rede: [ ] Detectar CD: [ ] Carregar módulos do instalador: [ ] Detectar discos rígidos: [ ] Particionar discos rígidos: [ ] Instalar o sistema base: [ ] Configuração do relógio/fuso horário: [ ] Configuração do utilizador/password: [ ] Instalar tarefas: [ ] Instalar gestor de arranque: [ ] Total da instalação: [ ] Comentários/Problemas: &lt;Descrição da instalação, em prosa, e quaisquer pensamentos, comentários e ideias que tenha tido durante a instalação inicial.&gt; </screen></informalexample> No relatório de bug, descreva qual é o problema, incluindo as últimas mensagens visíveis do kernel no caso do kernel bloquear. Descreva os passos que tomou que levaram o sistema ao estado do problema.
