Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/boot-installer.po
Languages: pt

source: The procedure for <command>GRUB</command> is quite similar. Locate your <filename>menu.lst</filename> in the <filename>/boot/grub/</filename> directory (or sometimes <filename>/boot/boot/grub/</filename>) and add an entry for the installer, for example (assuming <filename>/boot</filename> is on the first partition of the first disk in the system):
pt: O procedimento para o <command>GRUB</command> é bastante semelhante. Localize o seu <filename>menu.lst</filename> no directório <filename>/boot/grub/</filename> (por vezes em <filename>/boot/boot/grub/</filename>), e acrescente uma entrada para o instalador, por exemplo (assumindo que <filename>/boot</filename> é a primeira partição do primeiro disco do sistema):

source: title New Install root (hd0,0) kernel /boot/newinstall/vmlinuz initrd /boot/newinstall/initrd.gz
pt: title Nova Instalação root (hd0,0) kernel /boot/newinstall/vmlinuz initrd /newinstall/initrd.gz

source: From here on, there should be no difference between <command>GRUB</command> or <command>LILO</command>.
pt: A partir daqui, não deverá haver diferenças entre o <command>GRUB</command> ou o <command>LILO</command>.

source: Booting from USB Memory Stick
pt: Arrancar a partir de 'pen' USB

source: Let's assume you have prepared everything from <xref linkend="boot-dev-select"/> and <xref linkend="boot-usb-files"/>. Now just plug your USB stick into some free USB connector and reboot the computer. The system should boot up, and you should be presented with the <prompt>boot:</prompt> prompt. Here you can enter optional boot arguments, or just hit &enterkey;.
pt: Vamos assumir que tem tudo preparado a partir da <xref linkend="boot-dev-select"/> e da <xref linkend="boot-usb-files"/>. Agora basta ligar a sua pen USB num dos conectores USB livres e reiniciar o computador. O sistema deverá arrancar e ser-lhe-á apresentado a linha de comandos <prompt>boot:</prompt>. Aqui poderá introduzir argumentos de arranque opcionais, ou carregar em &enterkey;.

source: Booting from Floppies
pt: Arrancar a partir de Disquetes

source: You will have already downloaded the floppy images you needed and created floppies from the images in <xref linkend="create-floppy"/>.
pt: Poderá já ter feito download das imagens das disquete que necessita e ter criado as disquetes a partir das imagens na <xref linkend="create-floppy"/>.

source: To boot from the installer boot floppy, place it in the primary floppy drive, shut down the system as you normally would, then turn it back on.
pt: Para arrancar a partir da disquete de arranque do instalador, coloque a disquete na drive de disquetes primária, desligue o sistema como faria normalmente, e de seguida ligue-o outra vez.

source: For installing from an LS-120 drive (ATAPI version) with a set of floppies, you need to specify the virtual location for the floppy device. This is done with the <emphasis>root=</emphasis> boot argument, giving the device that the ide-floppy driver maps the device to. For example, if your LS-120 drive is connected as the first IDE device (master) on the second cable, you enter <userinput>install root=/dev/hdc</userinput> at the boot prompt.
pt: Para instalar a partir de uma drive LS-120 (versão ATAPI) com um conjunto de disquetes, necessita de especificar a localização virtual para o dispositivo de disquetes. Isto é feito com o argumento de arranque <emphasis>root=</emphasis>, dando o dispositivo para onde o driver ide-floppy mapeia o dispositivo. Por exemplo, se a sua drive LS-120 está conectada no primeiro dispositivo IDE (master) no segundo cabo, deverá introduzir <userinput>install root=/dev/hdc</userinput> na linha de comandos de arranque.

source: Note that on some machines, <keycombo><keycap>Control</keycap> <keycap>Alt</keycap> <keycap>Delete</keycap></keycombo> does not properly reset the machine, so a <quote>hard</quote> reboot is recommended. If you are installing from an existing operating system (e.g., from a DOS box) you don't have a choice. Otherwise, please do a hard reboot when booting.
pt: Note que em algumas máquinas, <keycombo><keycap>Control</keycap> <keycap>Alt</keycap> <keycap>Delete</keycap></keycombo> não faz reset à máquina portanto é recomendado um <quote>hard</quote> reboot. Se está a instalar a partir de um sistema operativo já existente (p.e., a partir de uma máquina com DOS) não terá escolha. Caso contrário, por favor, faça um hard reboot quando arrancar.

source: The floppy disk will be accessed, and you should then see a screen that introduces the boot floppy and ends with the <prompt>boot:</prompt> prompt.
pt: A disquete irá ser acedida e deverá ver um ecrã que introduz a disquete de arranque e acaba com a prompt <prompt>boot:</prompt>.

source: Once you press &enterkey;, you should see the message <computeroutput>Loading...</computeroutput>, followed by <computeroutput>Uncompressing Linux...</computeroutput>, and then a screenfull or so of information about the hardware in your system. More information on this phase of the boot process can be found below in <xref linkend="kernel-msgs"/>.
pt: Uma vez pressionado &enterkey; deverá ver a mensagem <computeroutput>Loading...</computeroutput>, seguida de <computeroutput>Uncompressing Linux...</computeroutput>, e depois um ecrã de informação sobre o hardware no seu sistema. Mais informação deste passo do processo de arranque pode ser encontrada na <xref linkend="kernel-msgs"/>.

source: After booting from the boot floppy, the root floppy is requested. Insert the root floppy and press &enterkey;, and the contents are loaded into memory. The installer program <command>debian-installer</command> is automatically launched.
pt: Após arrancar a partir da disquete de arranque, a disquete de root é pedida. Insira a disquete root e pressione &enterkey;, e os conteúdos serão carregados para a memória. O programa instalador <command>debian-installer</command> é lançado automaticamente.

source: Booting with TFTP
pt: Arrancar com TFTP

source: There are various ways to do a TFTP boot on i386.
pt: Existem várias maneiras fazer um arranque TFTP em i386.

source: NIC or Motherboard that support PXE
pt: NIC ou Motherboards que suportam PXE

source: It could be that your Network Interface Card or Motherboard provides PXE boot functionality. This is a <trademark class="trade">Intel</trademark> re-implementation of TFTP boot. If so, you may be able to configure your BIOS to boot from the network.
pt: Pode acontecer que a sua Network Interface Card (NIC, ou placa de rede) ou a sua Motherboard disponibilize a funcionalidade de arranque PXE. Isto é uma re-implementação da <trademark class="trade">Intel</trademark> do arranque por TFTP. Se tal acontecer, poderá configurar a sua BIOS para arrancar através da rede.

source: NIC with Network BootROM
pt: NIC (placa de rede) com Network BootROM

source: It could be that your Network Interface Card provides TFTP boot functionality.
pt: Poderá ser que a sua placa de rede disponibilize a funcionalidade de arranque por TFTP.

source: Let us (<email>&email-debian-boot-list;</email>) know how did you manage it. Please refer to this document.
pt: Diga-nos(<email>&email-debian-boot-list;</email>) como o conseguiu fazer. Por favor, refira-se a este documento.

source: The <ulink url="http://www.etherboot.org">etherboot project</ulink> provides bootdiskettes and even bootroms that do a TFTPboot.
pt: O <ulink url="http://www.etherboot.org"> projecto etherboot</ulink> disponibiliza disquetes de arranque e mesmo 'bootroms' para arrancar por TFTPboot.

source: The Boot Screen
pt: Um Ecrã de Arranque

source: When the installer boots, you should be presented with a friendly graphical screen showing the &debian; logo and a menu: <informalexample><screen> Installer boot menu Install Graphical install Advanced options > Help Press ENTER to boot or TAB to edit a menu entry </screen></informalexample> Depending on the installation method you are using, the <quote>Graphical install</quote> option may not be available.
pt: Quando o instalador arranca, deve ser-lhe apresentado um ecrã gráfico amistoso que mostra o logotipo de &debian; e um menu: <informalexample><screen> Menu de arranque do instalador Instalar Instalação gráfica Opções avançadas > Ajuda Carregue em ENTER para arrancar ou em TAB para editar uma entrada do menu Carregue em F1 para ajuda, ou ENTER para iniciar: </screen></informalexample> Dependendo do método de instalação que estiver a utilizar, a opção <quote>Graphical install</quote> pode não estar disponível.

source: For a normal installation, select either the <quote>Install</quote> or the <quote>Graphical install</quote> entry &mdash; using either the arrow keys on your keyboard or by typing the first (highlighted) letter &mdash; and press &enterkey; to boot the installer.
pt: Para uma instalação normal, escolha <quote>Install</quote> ou a entrada <quote>Graphical install</quote> &mdash; utilizando as teclas com setas ou o seu teclado ao digitar a primeira letra (destacada) &mdash; e carregue em &enterkey; para arrancar o instalador.

source: The <quote>Advanced options</quote> entry gives access to a second menu that allows to boot the installer in expert mode, in rescue mode and for automated installs.
pt: A entrada <quote>Advanced options</quote> dá acesso a um segundo menu que permite arrancar o instalador em modo avançado, em modo de recuperação e para instalações automatizadas.

source: If you wish or need to add any boot parameters for either the installer or the kernel, press &tabkey;. This will display the default boot command for the selected menu entry and allow to add additional options. The help screens (see below) list some common possible options. Press &enterkey; to boot the installer with your options; pressing &escapekey; will return you to the boot menu and undo any changes you made.
pt: Se desejar ou necessitar acrescentar parâmetros de arranque para o instalador ou para o kernel, carregue em &tabkey;. Isto irá mostrar o comando de arranque pré-definido para a entrada do menu escolhida e permite acrescentar opções adicionais. Os ecrãs de ajuda (veja abaixo) listam algumas opções usuais possíveis. Carregue em &enterkey; para arrancar o instalador com as suas opções; carregar em &escapekey; irá levá-lo para o ecrã de arranque e desfazer quaisquer alterações que tenha feito.

source: Choosing the <quote>Help</quote> entry will result in the first help screen being displayed which gives an overview of all available help screens. Note that it is not possible to return to the boot menu after the help screens have been displayed. However, the F3 and F4 help screens list commands that are equivalent to the boot methods listed in the menu. All help screens have a boot prompt at which the boot command can be typed: <informalexample><screen> Press F1 for the help index, or ENTER to boot: </screen></informalexample> At this boot prompt you can either just press &enterkey; to boot the installer with default options or enter a specific boot command and, optionally, boot parameters. A number of boot parameters which might be useful can be found on the various help screens. If you do add any parameters to the boot command line, be sure to first type the boot method (the default is <userinput>install</userinput>) and a space before the first parameter (e.g., <userinput>install fb=false</userinput>).
pt: Escolher a entrada <quote>Help</quote> irá resultar em que seja mostrado o primeiro ecrã de ajuda, o qual dá uma vista global de todos os ecrãs de ajuda disponíveis. Note que não é possível voltar ao menu de arranque após terem sido mostrados os ecrãs de ajuda. No entanto, os ecrãs de ajuda F3 e F4 listam comandos que são equivalentes aos métodos de arranque listados no menu. Todos os ecrãs de ajuda têm uma linha de comandos de arranque na qual pode ser escrito o comando de arranque: <informalexample><screen> Carregue em F1 para o índice de ajuda, ou ENTER para arrancar: </screen></informalexample> Nesta linha de comandos de arranque pode apenas carregar em &enterkey; para arrancar o instalador com as opções pré-definidas ou introduzir um comando de arranque específico e, opcionalmente, parâmetros de arranque. Podem ser encontrados nos vários ecrãs de ajuda um número de parâmetros de arranque que podem ser úteis. Se acrescentar quaisquer parâmetros á linha de comandos de arranque, assegure-se que digita primeiro o método de arranque (o pré-definido é <userinput>install</userinput> e um espaço antes do primeiro parâmetro (e.g., <userinput>install fb=false</userinput>).

source: The keyboard is assumed to have a default American English layout at this point. This means that if your keyboard has a different (language-specific) layout, the characters that appear on the screen may be different from what you'd expect when you type parameters. Wikipedia has a <ulink url="&url-us-keymap;">schema of the US keyboard layout</ulink> which can be used as a reference to find the correct keys to use.
pt: Nesta altura é assumido que o teclado tenha uma disposição pré-definida de Inglês Americano. Isto significa que se o seu teclado tiver uma disposição diferente (específico do idioma), os caracteres que aparecem no ecrã podem ser diferentes dos que espera quando digita os parâmetros. A Wikipedia tem um <ulink url="url-us-keymap;">esquema da disposição do teclado US</ulink> que pode ser utilizado como referência para encontrar as teclas correctas a utilizar.

source: If you are using a system that has the BIOS configured to use serial console, you may not be able to see the initial graphical splash screen upon booting the installer; you may even not see the boot menu. The same can happen if you are installing the system via a remote management device that provides a text interface to the VGA console. Examples of these devices include the text console of Compaq's <quote>integrated Lights Out</quote> (iLO) and HP's <quote>Integrated Remote Assistant</quote> (IRA).
pt: Se estiver a utilizar um sistema que tenha a BIOS configurada para utilizar uma consola série, poderá não conseguir ver o ecrã gráfico inicial de apresentação quando arrancar o instalador; poderá mesmo não ver o menu de arranque. Poderá acontecer o mesmo se estiver a instalar a partir de um dispositivo de gestão remota que disponibilize um interface de texto para a consola VGA. Exemplos destes dispositivos incluem a consola de texto <quote>integrated Lights Out</quote> (iLO) da Compaq e a <quote>Integrated Remote Assistant</quote> (IRA) da HP.

source: To bypass the graphical boot screen you can either blindly press &escapekey; to get a text boot prompt, or (equally blindly) press <quote>H</quote> followed by &enterkey; to select the <quote>Help</quote> option described above. After that your keystrokes should be echoed at the prompt. To prevent the installer from using the framebuffer for the rest of the installation, you will also want to add <userinput>vga=normal fb=false</userinput> to the boot prompt, as described in the help text.
pt: Para contornar o ecrã gráfico de arranque pode carregar às cegas em &escapekey; para obter uma linha de comandos de arranque em texto, ou (igualmente às cegas) pressione em <quote>H</quote> seguido de &enterkey; para escolher a opção <quote>Help</quote> descrita acima. Depois disso as suas digitações devem ser ecoadas na linha de comandos. Para evitar que o instalador utilize o framebuffer para o resto da instalação, também irá querer acrescentar <userinput>vga=normal fb=false</userinput> na linha de comandos de arranque, conforme é descrito no texto de ajuda.

source: CD Contents
pt: Conteúdo do CD

source: There are three basic variations of &debian; Install CDs. The <emphasis>Business Card</emphasis> CD has a minimal installation that will fit on the small form factor CD media. It requires a network connection in order to install the rest of the base installation and make a usable system. The <emphasis>Network Install</emphasis> CD has all of the packages for a base install but requires a network connection to a &debian; mirror site in order to install the extra packages one would want for a complete system . The set of &debian; CDs can install a complete system from the wide range of packages without needing access to the network.
pt: Há três variações básicas dos CDs de Instalação &debian;. O CD <emphasis>Business Card</emphasis> tem a instalação mínima que irá caber nos mini-CDs. Requer uma ligação à rede, por forma a instalar o resto da instalação base e fazer um sistema utilizável. O CD <emphasis>Network Install</emphasis> tem todos os pacotes necessários para a instalação base, mas requer uma ligação à rede para um mirror &debian;, por forma a instalar os pacotes extra que deseje para ter um sistema &debian; completo. O conjunto de CDs &debian; pode instalar o sistema completo a partir de uma variedade de pacotes sem necessitar de aceder à rede.

source: The IA-64 architecture uses the next generation Extensible Firmware Interface (EFI) from Intel. Unlike the traditional x86 BIOS which knows little about the boot device other than the partition table and Master Boot Record (MBR), EFI can read and write files from FAT16 or FAT32 formatted disk partitions. This simplifies the often arcane process of starting a system. The system boot loader and the EFI firmware that supports it have a full filesystem to store the files necessary for booting the machine. This means that the system disk on an IA-64 system has an additional disk partition dedicated to EFI instead of the simple MBR or boot block on more conventional systems.
pt: A arquitectura IA-64 usa a nova geração de Extensible Firmware Interface (EFI) da Intel. Ao contrário das BIOS dos x86 tradicionais, que conhece pouco acerca do dispositivo de arranque que não seja a tabela de partições e o Master Boot Record (MBR), EFI pode ler e escrever ficheiros a partir de partições de disco em FAT16 ou FAT32. Isto simplifica os arcaicos processos de iniciar um sistema mais comuns. O sistema de arranque e o firmware EFI que o suporta tem um sistema de ficheiros completo para guardar os ficheiros necessários ao arranque da máquina. Isto significa que o sistema de discos num sistema IA-64 tem uma partição de disco adicional dedicado ao EFI em vez do simples MBR ou do bloco de arranque em sistemas mais convencionais.

source: The &debian; Installer CD contains a small EFI partition where the <command>ELILO</command> bootloader, its configuration file, the installer's kernel, and initial filesystem (initrd) are located. The running system also contains an EFI partition where the necessary files for booting the system reside. These files are readable from the EFI Shell as described below.
pt: O &debian; Installer CD contém uma partição EFI pequena, onde o gestor de arranque<command>ELILO</command> , o seu ficheiro de configuração, o kernel do instalador e o sistema de ficheiros iniciar (initrd) estão localizados. O sistema em execução também contém uma partição EFI onde os ficheiros necessários são lidos a partir da shell EFI descrita em baixo.

source: Most of the details of how <command>ELILO</command> actually loads and starts a system are transparent to the system installer. However, the installer must set up an EFI partition prior to installing the base system. Otherwise, the installation of <command>ELILO</command> will fail, rendering the system un-bootable. The EFI partition is allocated and formatted in the partitioning step of the installation prior to loading any packages on the system disk. The partitioning task also verifies that a suitable EFI partition is present before allowing the installation to proceed.
pt: A maioria dos detalhes de como o <command>ELILO</command> carrega e inicia um sistema são transparentes para o instalador do sistema. No entanto, o instalador terá de configurar uma partição EFI antes de instalar o sistema base, De outra forma, a instalação do <command>ELILO</command> irá falhar, criando um sistema incapaz de arrancar. A partição EFI está alocada e formatada no passo relativo à partição da instalação anterior ao carregamento de quaisquer pacotes do disco de sistema. A tarefa de particionamento também verifica que uma partição EFI apropriada está presente antes de autorizar a continuação da instalação.

source: The EFI Boot Manager is presented as the last step of the firmware initialization. It displays a menu list from which the user can select an option. Depending on the model of system and what other software has been loaded on the system, this menu may be different from one system to another. There should be at least two menu items displayed, <command>Boot Option Maintenance Menu</command> and <command>EFI Shell (Built-in)</command>. Using the first option is preferred, however, if that option is not available or the CD for some reason does not boot with it, use the second option.
pt: O gestor de arranque EFI está presente como o último passo da inicialização do firmware. Mostra uma lista sob a forma de menu a partir da qual o utilizador pode seleccionar uma opção. Dependendo do modelo do sistema e qual o software carregado no sistema, este menu pode ser diferente de sistema para sistema. Deverá haver pelo menos dois itens mostrados, <command>Boot Option Maintenance Menu</command> e <command>EFI Shell (Built-in)</command>. O uso da primeira opção é preferível, no entanto, se tal opção não estiver disponível ou o CD, por alguma razão não a iniciar, use a segunda opção.

source: IMPORTANT
pt: IMPORTANTE

source: The EFI Boot Manager will select a default boot action, typically the first menu choice, within a pre-set number of seconds. This is indicated by a countdown at the bottom of the screen. Once the timer expires and the systems starts the default action, you may have to reboot the machine in order to continue the installation. If the default action is the EFI Shell, you can return to the Boot Manager by running <command>exit</command> at the shell prompt.
pt: O gestor de arranque EFI irá seleccionar uma acção de arranque por pré-definição, tipicamente a primeira escolha do menu, dentro de um tempo pré-determinado. Isto é indicado por uma contagem decrescente no fundo do ecrã. Mal o temporizador expire e o sistema inicia a acção pré-definida, poderá ter de reiniciar a máquina por forma a continuar a instalação. Se a acção por omissão for a shell EFI, poderá voltar ao gesto de arranque, se executar <command>exit</command> na prompt da shell.

source: Option 1: Booting from the Boot Option Maintenance Menu
pt: Opção 1: Arrancar a partir do Menu de Manutenção das Opções de Arranque

source: Insert the CD in the DVD/CD drive and reboot the machine. The firmware will display the EFI Boot Manager page and menu after it completes its system initialization.
pt: Insira o CD na drive CD/DVD e reinicie a máquina. O firmware irá mostrar a página e menu do gestor de arranque EFI após completar o seu sistema de inicialização.

source: Select <command>Boot Maintenance Menu</command> from the menu with the arrow keys and press <command>ENTER</command>. This will display a new menu.
pt: Seleccione <command>Boot Maintenance Menu</command> a partir do menu, usando as setas do seu teclado e pressionando <command>ENTER</command>. Isto irá mostrar um novo menu.
