Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/boot-installer.po
Languages: pt

source: Booting the Installation System
pt: Arrancar o Sistema de Instalação

source: Booting the Installer on &arch-title;
pt: Arrancar o Instalador em &arch-title;

source: If you have any other operating systems on your system that you wish to keep (dual boot setup), you should make sure that they have been properly shut down <emphasis>before</emphasis> you boot the installer. Installing an operating system while another operating system is in hibernation (has been suspended to disk) could result in loss of, or damage to the state of the suspended operating system which could cause problems when it is rebooted.
pt: Se tiver qualquer outro sistema operativo, que deseje manter, no seu sistema (configuração 'dual-boot'), deve assegurar-se que esses sistemas operativos foram devidamente desligados <emphasis>antes</emphasis> de arrancar o instalador. Instalar um sistema operativo com outro sistema operativo em hibernação (em suspensão no disco) pode resultar na perda, ou num estado danificado do sistema operativo suspenso que pode causar problemas com é reiniciado.

source: For information on how to boot the graphical installer, see <xref linkend="graphical"/>.
pt: Para informações acerca de como pode arrancar com o instalador gráfico, veja <xref linkend="graphical"/>.

source: Booting from TFTP
pt: Arrancar de TFTP

source: Booting from the network requires that you have a network connection and a TFTP network boot server (DHCP, RARP, or BOOTP).
pt: Arrancar pela rede, requer que tenha uma ligação de rede configurada e um servidor de arranque de rede TFTP (DHCP, RARP ou BOOTP).

source: Older systems such as the 715 might require the use of an RBOOT server instead of a BOOTP server.
pt: Sistemas mais antigos como o 715 poderão necessitar do uso de um servidor RBOOT em vez de um servidor BOOTP.

source: The installation method to support network booting is described in <xref linkend="install-tftp"/>.
pt: O método de instalação para suportar o arranque pela rede é descrito na <xref linkend="install-tftp"/>.

source: Booting from CD-ROM
pt: Arrancar a partir de CD-ROM

source: The easiest route for most people will be to use a set of &debian; CDs. If you have a CD set, and if your machine supports booting directly off the CD, great! Simply <phrase arch="x86"> configure your system for booting off a CD as described in <xref linkend="boot-dev-select"/>, </phrase> insert your CD, reboot, and proceed to the next chapter.
pt: O melhor caminho para a maioria das pessoas será usar um conjunto de CDs &debian;. Se tem um conjunto de CDs, e se a sua máquina suporta arranque directamente a partir do CD, fantástico! Simplesmente <phrase arch="x86"> configure o seu sistema para arrancar a partir de um CD como descrito na <xref linkend="boot-dev-select"/>, </phrase> insira o seu CD, reinicie, e proceda para o próximo capítulo.

source: Note that certain CD drives may require special drivers, and thus be inaccessible in the early installation stages. If it turns out the standard way of booting off a CD doesn't work for your hardware, revisit this chapter and read about alternate kernels and installation methods which may work for you.
pt: Note que determinadas drives de CD podem necessitar de drivers especiais, e portanto estarem inacessíveis nas fases iniciais da instalação. Se se verificar que a maneira comum de iniciar a partir do CD não funciona no seu hardware, visite novamente este capítulo e leia sobre métodos alternativos para instalar e kernels alternativos que poderão funcionar consigo.

source: Even if you cannot boot from CD-ROM, you can probably install the &debian; system components and any packages you want from CD-ROM. Simply boot using a different media, such as floppies. When it's time to install the operating system, base system, and any additional packages, point the installation system at the CD-ROM drive.
pt: Mesmo se não conseguir iniciar a partir do CD-ROM, poderá provavelmente instalar os componentes do &debian; e qualquer pacote que deseje a partir do CD-ROM. Simplesmente arranque utilizando uma media diferente, tal como disquetes. Quando for altura de instalar o sistema operativo, sistema base, e qualquer pacote adicional, aponte o sistema de instalação para a drive de CD-ROM.

source: If you have problems booting, see <xref linkend="boot-troubleshooting"/>.
pt: Se tiver problemas com o arranque, veja a <xref linkend="boot-troubleshooting"/>.

source: Booting from Firmware
pt: Arrancar a partir de Firmware

source: There is an increasing number of consumer devices that directly boot from a flash chip on the device. The installer can be written to flash so it will automatically start when you reboot your machines.
pt: Existe um número cada vez maior de dispositivos para os consumidores que arrancam directamente a partir de um chip flash no dispositivo. O instalador pode ser escrito para flash de modo a que arranque automaticamente quando reiniciar as suas máquinas.

source: In many cases, changing the firmware of an embedded device voids your warranty. Sometimes you are also not able to recover your device if there are problems during the flashing process. Therefore, please take care and follow the steps precisely.
pt: em muitos casos, mudar o firmware de um dispositivo embebido inutiliza a sua garantia. Por vezes nem sequer consegue recuperar o seu dispositivo se ocorrerem problemas durante o processo de flash. Por isso, tenha cuidado e siga os passos com cuidado.

source: Booting the NSLU2
pt: Arrancar o NSLU2

source: There are three ways how to put the installer firmware into flash:
pt: Existem três formas de colocar o firmware do instalador em flash:

source: Using the NSLU2 web interface
pt: Utilizando o interface web NSLU2

source: Go to the administration section and choose the menu item <literal>Upgrade</literal>. You can then browse your disk for the installer image you have previously downloaded. Then press the <literal>Start Upgrade</literal> button, confirm, wait for a few minutes and confirm again. The system will then boot straight into the installer.
pt: Vá à secção de administração e escolha o item do menu <literal>Upgrade</literal>. Depois pode navegar pelo seu disco à procura da imagem do instalador de que fez download anteriormente. Depois carregue no botão <literal>Start Upgrade</literal>, confirme, espere alguns minutos e confirme novamente. Então o sistema irá arrancar directo para o instalador.

source: Via the network using Linux/Unix
pt: Através da rede utilizando Linux/Unix

source: You can use <command>upslug2</command> from any Linux or Unix machine to upgrade the machine via the network. This software is packaged for &debian;. First, you have to put your NSLU2 in upgrade mode: <orderedlist> <listitem><para> Disconnect any disks and/or devices from the USB ports. </para></listitem> <listitem><para> Power off the NSLU2 </para></listitem> <listitem><para> Press and hold the reset button (accessible through the small hole on the back just above the power input). </para></listitem> <listitem><para> Press and release the power button to power on the NSLU2. </para></listitem> <listitem><para> Wait for 10 seconds watching the ready/status LED. After 10 seconds it will change from amber to red. Immediately release the reset button. </para></listitem> <listitem><para> The NSLU2 ready/status LED will flash alternately red/green (there is a 1 second delay before the first green). The NSLU2 is now in upgrade mode. </para></listitem> </orderedlist> See the <ulink url="http://www.nslu2-linux.org/wiki/OpenSlug/UsingTheBinary">NSLU2-Linux pages</ulink> if you have problems with this. Once your NSLU2 is in upgrade mode, you can flash the new image: <informalexample><screen> sudo upslug2 -i di-nslu2.bin </screen></informalexample> Note that the tool also shows the MAC address of your NSLU2, which may come in handy to configure your DHCP server. After the whole image has been written and verified, the system will automatically reboot. Make sure you connect your USB disk again now, otherwise the installer won't be able to find it.
pt: Pode utilizar <command>upslug2</command> a partir de qualquer máquina Linux ou Unix para actualizar a máquina a partir da rede. Este software está empacotado em &debian;. Primeiro, tem de colocar o seu NSLU2 em modo de upgrade: <orderedlist> <listitem><para>Desligar quaisquer discos e/ou dispositivos das portas USB. </para></listitem> <listitem><para>Desligar o NSLU2</para></listitem> <listitem><para>Carregar e manter pressionado o botão de reset (acessível através de um pequeno buraco atrás, mesmo acima da entrada para alimentação).</para></listitem> <listitem><para>Carregue e largue o botão de ligar para ligar o NSLU2. </para></listitem> <listitem><para>Espere 10 segundos olhando para o LED ready/status. Após 10 segundos mudará de âmbar para vermelho. Solte imediatamente o botão de reset. </para></listitem> <listitem><para>O LED ready/status irá piscar alternando vermelho/verde (existe uma espera de 1 segundo antes do primeiro verde). O NSLU2 está agora em modo de actualização. </para></listitem> </orderedlist> Se tiver problemas com isto veja as <ulink url="http://www.nslu2-linux.org/wiki/OpenSlug/UsingTheBinary">páginas Linux-NSLU2</ulink>. Uma vez estando o NSLU2 em modo de actualização, pode flashar a nova imagem: <informalexample><screen> sudo upslug2 -i di-nslu2.bin </screen></informalexample> Note que a ferramenta também mostra o endereço MAC da seu NSLU2, que pode ser útil para configurar o seu servidor DHCP. Após toda a imagem estar escrita e verificada, o sistema irá reiniciar automaticamente. Assegure-se que liga novamente o seu disco USB, caso contrário o instalador não conseguirá encontrá-lo.

source: Via the network using Windows
pt: Através da rede utilizando Windows

source: There is <ulink url="http://www.everbesthk.com/8-download/sercomm/firmware/all_router_utility.zip">a tool</ulink> for Windows to upgrade the firmware via the network.
pt: Para Windows existe <ulink url="http://www.everbesthk.com/8-download/sercomm/firmware/all_router_utility.zip">uma ferramenta</ulink> para actualizar o firmware via rede.

source: Booting the SS4000-E
pt: Arrancar o SS4000-E

source: Due to limitations in the SS4000-E firmware, it unfortunately is not possible to boot the installer without the use of a serial port at this time. To boot the installer, you will need a serial nullmodem cable; a computer with a serial port<footnote id="arm-s4ke-port"> <para> A USB serial converter will also work. </para> </footnote>; and a ribbon cable with a male DB9 connector at one end, and a 10-pin .1" IDC header at the other<footnote id="arm-s4k-rib"> <para> This cable is often found in older desktop machines with builtin 9-pin serial ports. </para> </footnote>.
pt: Devido a limitações no firmware SS4000-E, infelizmente não é possível de momento, arrancar o instalador sem utilizar uma porta série. Para arrancar o instalador, irá necessitar de um cabo nullmodem; um computador com porta série<footnote id="arm-s4ke-port"> <para> Um conversor série-USB também irá funcionar. </para> </footnote>; e um cabo com um conector macho DB9 numa ponta, e na outra ponta uma ficha de 10 pinos .1" IDC<footnote id="arm-s4k-rib"> <para> Este cabo é encontrado normalmente em computadores antigos com portas série de 9 pinos. </para> </footnote>.

source: To boot the SS4000-E, use your serial nullmodem cable and the ribbon cable to connect to the serial port of the SS4000-E, and reboot the machine. You need to use a serial terminal application to communicate with the machine; a good option on a &debian; GNU/Linux is to use the <command>cu</command> program, in the package of the same name. Assuming the serial port on your computer is to be found on <filename>/dev/ttyS0</filename>, use the following command line:
pt: Para arrancar o SS4000-E, utilize o seu cabo nullmodem série e o cabo de fita para ligar à porta série do SS4000-E, e reinicie a máquina. Tem de utilizar uma aplicação de terminal série para comunicar com a máquina; uma boa opção é utilizar, num &debian; GNU/Linux, o programa <command>cu</command>, no pacote com o mesmo nome. Assumindo que no seu computador a porta série se encontra em <filename>/dev/ttyS0</filename>, utilize a seguinte linha de comandos:

source: If using Windows, you may want to consider using the program <classname>hyperterminal</classname>. Use a baud rate of 115200, 8 bits word length, no stop bits, and one parity bit.
pt: Se está a utilizar Windows, pode querer considerar utilizar o programa <classname>hyperterminal</classname>. Utilize um baud rate de 115200, words de 8 bits, sem stop bits, e um bit de paridade.

source: When the machine boots, you will see the following line of output:
pt: Quando a máquina arrancar, verá a seguinte linha:

source: No network interfaces found EM-7210 ver.T04 2005-12-12 (For ver.AA) == Executing boot script in 1.000 seconds - enter ^C to abort
pt: Nenhum interface de rede encontrado M-7210 ver.T04 2005-12-12 (For ver.AA) == A executar script de arranque em 1.000 segundos - introduza ^C para abortar

source: At this point, hit Control-C to interrupt the boot loader<footnote id="arm-s4ke-sec"> <para> Note that you have only one second to do so; if you miss this window, just powercycle the machine and try again. </para> </footnote>. This will give you the RedBoot prompt. Enter the following commands:
pt: Nesta altura, carregue em Control-C para interromper o gestor de arranque<footnote id="arm-s4ke-sec"> <para> Note que tem apenas um segundo para o fazer; se falhar esta janela, limite-se a reiniciar a alimentação da máquina e tentar novamente. </para> </footnote>. Isto dar-lhe-à a prompt RedBoot. Introduza os seguintes comandos:

source: After every <command>load</command> command, the system will expect a file to be transmitted using the YMODEM protocol. When using cu, make sure you have the package <classname>lrzsz</classname> installed, then hit enter, followed by the <quote>~&lt;</quote> escape sequence to start an external program, and run <command>sb initrd.gz</command> or <command>sb vmlinuz</command>.
pt: Depois do comando <command>load</command>, o sistema irá esperar que seja transmitido um ficheiro utilizando o protocolo YMODEM. Ao utilizar o comando cu, assegure-se que tem instalado o pacote <classname>lrzsz</classname>, e depois carregue em enter, seguido da sequência de escape <quote>~&lt;</quote> para iniciar um programa externo, e depois execute <command>sb initrd.gz</command> ou <command>sb vmlinuz</command>.

source: Alternatively, it is possible to load the kernel and ramdisk using HTTP rather than YMODEM. This is faster, but requires a working HTTP server on the network. To do so, first switch the bootloader to RAM mode:
pt: Em alternativa, é possível carregar o kernel e ramdisk utilizando HTTP em vez de YMODEM. Isto é mais rápido, mas necessita de um servidor de HTTP na sua rede. Para o fazer, primeiro mude o gestor de arranque para o modo RAM:

source: This will seemingly restart the machine; but in reality, it loads reboot to RAM and restarts it from there. Not doing this step will cause the system to hang in the necessary ip_address step that comes next.
pt: Isto irá reiniciar a máquina; mas na realidade, carrega o reboot para a RAM e reinicia a partir daí. Não fazer este passo irá fazer com que o sistema fique parado à espera na etapa necessária, ip_address, que vem a seguir.

source: You will need to hit Ctrl-C again to interrupt the boot. Then: <informalexample><screen> ip_address -l <replaceable>192.168.2.249</replaceable> -h <replaceable>192.168.2.4</replaceable> load -v -r -b 0x01800000 -m http /initrd.gz load -v -r -b 0x01008000 -m http /zImage exec -c "console=ttyS0,115200 rw root=/dev/ram mem=256M@0xa0000000" -r 0x01800000 </screen></informalexample> Where <replaceable>192.168.2.249</replaceable> is the IP address of the installed system and <replaceable>192.168.2.4</replaceable> the IP address of the HTTP server containing the kernel and ramdisk files.
pt: Para interromper o arranque tem de carregar novamente em Ctrl-C. Depois <informalexample><screen> ip_address -l <replaceable>192.168.2.249</replaceable> -h <replaceable>192.168.2.4</replaceable> load -v -r -b 0x01800000 -m http /initrd.gz load -v -r -b 0x01008000 -m http /zImage exec -c "console=ttyS0,115200 rw root=/dev/ram mem=256M@0xa0000000" -r 0x01800000 </screen></informalexample> Onde <replaceable>192.168.2.249</replaceable> é o endereço IP do sistema instalado e <replaceable>192.168.2.4</replaceable> é o endereço IP do servidor HTTP que contém o kernel e ficheiros ramdisk.

source: The installer will now start as usual.
pt: O instalador irá iniciar como normalmente.

source: Booting from a CD-ROM
pt: Arrancar a partir de CD-ROM

source: Booting from Windows
pt: Arrancar a partir do Windows

source: To start the installer from Windows, you must first obtain CD-ROM/DVD-ROM or USB memory stick installation media as described in <xref linkend="official-cdrom"/> and <xref linkend="boot-usb-files"/>.
pt: Para iniciar o instalador a partir do Windows, você primeiro tem de obter o mídia de instalação em CD-ROM/DVD-ROM ou uma 'pendrive' de memória USB conforme é descrito em <xref linkend="official-cdrom"/> e em <xref linkend="boot-usb-files"/>.

source: If you use an installation CD or DVD, a pre-installation program should be launched automatically when you insert the disc. In case Windows does not start it automatically, or if you are using a USB memory stick, you can run it manually by accessing the device and executing <command>setup.exe</command>.
pt: Se utilizar um CD ou DVD de instalação, deve ser lançado automaticamente um programa de pré-instalação ao inserir o disco. No caso do Windows não o iniciar automaticamente, ou se estiver uma 'pendrive' de memória USB, pode corrê-lo manualmente acedendo ao dispositivo e executando <command>setup.exe</command>.

source: After the program has been started, a few preliminary questions will be asked and the system will be prepared to start the &debian-gnu; installer.
pt: Após o programa ter sido iniciado, serão colocadas algumas questões preliminares e o sistema será preparado para iniciar o instalador de &debian-gnu;.

source: Booting from DOS
pt: A arrancar a partir do DOS

source: Boot into DOS (not Windows). To do this, you can for instance boot from a recovery or diagnostic disk.
pt: Arrancar para o DOS (não para o Windows). Para fazer isto, pode por exemplo arrancar a partir de um disco de recuperação ou de diagnóstico.

source: If you can access the installation CD, change the current drive to the CD-ROM drive, e.g. <informalexample><screen> d: </screen></informalexample> else make sure you have first prepared your hard disk as explained in <xref linkend="files-loadlin"/>, and change the current drive to it if needed.
pt: Se consegue aceder ao CD de instalação, altere o leitor actual para o leitor de CD-ROM, p.e. <informalexample><screen> d: </screen></informalexample> caso contrário assegure-se que preparou primeiro o seu disco rígido conforme é explicado em <xref linkend="files-loadlin"/>, e altere o leitor actual se necessário.

source: Enter the subdirectory for the flavor you chose, e.g., <informalexample><screen> cd \&x86-install-dir; </screen></informalexample> If you prefer using the graphical installer, enter the <filename>gtk</filename> sub-directory. <informalexample><screen> cd gtk </screen></informalexample> Next, execute <command>install.bat</command>. The kernel will load and launch the installer system.
pt: Introduza o sub-directório do tipo que escolheu, p.e., <informalexample><screen> cd \&x86-install-dir; </screen></informalexample> Se preferir utilizar o instalador gráfico, introduza o directório <filename>gtk</filename>. <informalexample><screen> cd gtk </screen></informalexample> De seguida, execute <command>install.bat</command>. O kernel irá carregar e lançar o sistema de instalação.

source: Booting from Linux Using <command>LILO</command> or <command>GRUB</command>
pt: Arrancar a partir de Linux utilizando o <command>LILO</command> ou o <command>GRUB</command>

source: To boot the installer from hard disk, you must first download and place the needed files as described in <xref linkend="boot-drive-files"/>.
pt: Para arrancar o instalador a partir do disco rígido, terá primeiro de fazer o download e colocar os ficheiros necessários, como descrito na <xref linkend="boot-drive-files"/>.

source: If you intend to use the hard drive only for booting and then download everything over the network, you should download the <filename>netboot/debian-installer/&architecture;/initrd.gz</filename> file and its corresponding kernel <filename>netboot/debian-installer/&architecture;/linux</filename>. This will allow you to repartition the hard disk from which you boot the installer, although you should do so with care.
pt: Se tenciona utilizar o disco rígido apenas para arrancar e depois fazer o download de tudo através da rede, deve fazer o download do ficheiro <filename>netboot/debian-installer/&architecture;/initrd.gz</filename> e do seu correspondente kernel <filename>netboot/debian-installer/&architecture;/linux</filename>. Isto permitir-lhe-á reparticionar o disco rígido a partir do qual o instalador arranca, embora deva fazer isto com cuidado.

source: Alternatively, if you intend to keep an existing partition on the hard drive unchanged during the install, you can download the <filename>hd-media/initrd.gz</filename> file and its kernel, as well as copy a CD (or DVD) iso to the drive (make sure the file is named ending in <literal>.iso</literal>). The installer can then boot from the drive and install from the CD/DVD image, without needing the network.
pt: Em alternativa, se tenciona manter uma partição existente no disco rígido, inalterada durante a instalação, poderá fazer o download do ficheiro <filename>hd-media/initrd.gz</filename> e do seu kernel, assim como uma cópia do iso do CD (ou DVD) para o disco (assegure-se que o nome do ficheiro termina em <literal>.iso</literal>). O instalador poderá então arrancar a partir do disco e instalar a partir da imagem do CD/DVD, sem necessitar da rede.

source: For <command>LILO</command>, you will need to configure two essential things in <filename>/etc/lilo.conf</filename>: <itemizedlist> <listitem><para> to load the <filename>initrd.gz</filename> installer at boot time; </para></listitem> <listitem><para> have the <filename>vmlinuz</filename> kernel use a RAM disk as its root partition. </para></listitem> </itemizedlist> Here is a <filename>/etc/lilo.conf</filename> example:
pt: Para o <command>LILO</command>, necessitará de configurar 2 coisas essenciais em <filename>/etc/lilo.conf</filename>: <itemizedlist> <listitem><para> para carregar o instalador do <filename>initrd.gz</filename> em tempo de arranque; </para></listitem> <listitem><para> ter o kernel <filename>vmlinuz</filename> a usar uma RAM disk como partição de root. </para></listitem> </itemizedlist> Aqui está um exemplo do <filename>/etc/lilo.conf</filename>:

source: For more details, refer to the <citerefentry><refentrytitle>initrd</refentrytitle> <manvolnum>4</manvolnum></citerefentry> and <citerefentry><refentrytitle>lilo.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> man pages. Now run <userinput>lilo</userinput> and reboot.
pt: Para mais detalhes, veja as páginas do man <citerefentry><refentrytitle>initrd</refentrytitle> <manvolnum>4</manvolnum></citerefentry> e <citerefentry><refentrytitle>lilo.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry>. Agora execute <userinput>lilo</userinput> e reinicie.
