Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/boot-installer.po
Languages: pt

source: Strictly speaking, Cobalt does not use TFTP but NFS to boot. You need to install an NFS server and put the installer files in <filename>/nfsroot</filename>. When you boot your Cobalt, you have to press the left and the right cursor buttons at the same time and the machine will boot via the network from NFS. It will then display several options on the display. There are the following two installation methods:
pt: Falando concretamente, para arrancar, o Cobalt não utiliza TFTP mas sim NFS. Você necessita instalar um servidor NFS e colocar os ficheiros do instalador em <filename>/nfsroot</filename>. Quando arrancar o seu Cobalt, tem de carregar os botões de cursor esquerda e direita ao mesmo tempo e a máquina arranca a partir da rede via NFS. De seguida irá mostrar várias opções. Aqui estão os dois seguintes métodos de instalação:

source: Via SSH (default): In this case, the installer will configure the network via DHCP and start an SSH server. It will then display a random password and other login information (such as the IP address) on the Cobalt LCD. When you connect to the machine with an SSH client you can start with the installation.
pt: Via SSH (omissão): Neste caso, o instalador irá configurar a rede via DHCP e iniciar um servidor SSH. Irá então mostrar no LCD do Cobalt uma password gerada aleatoriamente e outras informações de login (tal como o endereço IP). Quando ligar à máquina com um cliente SSH pode iniciar a instalação.

source: Via serial console: Using a null modem cable, you can connect to the serial port of your Cobalt machine (using 115200 bps) and perform the installation this way.
pt: Via consola série: Utilizando um cabo null modem, pode ligar à porta série da sua máquina Cobalt (utilizando 115200 bps) e desta forma fazer a instalação.

source: You cannot pass any boot parameters directly. Instead, you have to edit the <filename>/nfsroot/default.colo</filename> file on the NFS server and add your parameters to the <replaceable>args</replaceable> variable.
pt: Não pode passar qualquer parâmetro de arranque directamente. Em vez disso, tem de editar o ficheiro <filename>/nfsroot/default.colo</filename> no servidor NFS e adicionar os seus parâmetros à variável <replaceable>args</replaceable>.

source: s390 Limitations
pt: Limitações de s390

source: In order to run the installation system a working network setup and ssh session is needed on S/390.
pt: Com o intuito de executar o sistema de instalação num S/390 é necessário uma rede funcional e uma sessão de ssh.

source: The booting process starts with a network setup that prompts you for several network parameters. If the setup is successful, you will login to the system by starting an ssh session which will launch the standard installation system.
pt: O processo de arranque começa com a configuração da rede que o alerta para vários parâmetros de rede. Se a configuração for bem sucedida, irá fazer login no sistema iniciando uma sessão de ssh que irá lançar o sistema de instalação standard.

source: s390 Boot Parameters
pt: Parâmetros de Arranque de s390

source: On S/390 you can append boot parameters in the parm file. This file can either be in ASCII or EBCDIC format. A sample parm file <filename>parmfile.debian</filename> is provided with the installation images.
pt: Em S/390 pode acrescentar parâmetros de arranque no ficheiro parm. Este ficheiro pode estar tanto em formato ASCII como em EBCDIC. É disponibilizado um ficheiro parm de exemplo <filename>parmfile.debian</filename> com as imagens de instalação.

source: Currently, the only &arch-title; subarchitectures that support CD-ROM booting are PReP (though not all systems) and New World PowerMacs. On PowerMacs, hold the <keycap>c</keycap> key, or else the combination of <keycap>Command</keycap>, <keycap>Option</keycap>, <keycap>Shift</keycap>, and <keycap>Delete</keycap> keys together while booting to boot from the CD-ROM.
pt: Actualmente, as únicas sub-arquitecturas &arch-title; que suportam arrancar a partir de CD-ROM são a PReP (embora não todos os sistemas) e New World PowerMacs. Nos PowerMacs, prima a tecla <keycap>c</keycap>, ou então a combinação conjunta das teclas <keycap>Command</keycap>, <keycap>Option</keycap>, <keycap>Shift</keycap>, e <keycap>Delete</keycap> enquanto arranca para arrancar a partir de CD-ROM.

source: OldWorld PowerMacs will not boot a &debian; CD, because OldWorld computers relied on a Mac OS ROM CD boot driver to be present on the CD, and a free-software version of this driver is not available. All OldWorld systems have floppy drives, so use the floppy drive to launch the installer, and then point the installer to the CD for the needed files.
pt: OldWorld PowerMacs não irão arrancar de um CD &debian;, porque os computadores OldWorld baseiam-se num driver de arranque Mac OS ROM CD que esteja presento no CD, e não está disponível uma versão de free-software. Todos os sistemas OldWorld têm drives de disquete, utilize portanto a drive de disquetes para iniciar o instalador, e aponte o instalador para os ficheiros necessários do CD.

source: If your system doesn't boot directly from CD-ROM, you can still use the CD-ROM to install the system. On NewWorlds, you can also use an OpenFirmware command to boot from the CD-ROM manually. Follow the instructions in <xref linkend="boot-newworld"/> for booting from the hard disk, except use the path to <command>yaboot</command> on the CD at the OF prompt, such as
pt: Se o seu sistema não arranca directamente de CD-ROM, pode continuar a utilizar o CD-ROM para instalar o sistema. Em NewWorlds, pode também utilizar um comando OpenFirmware para iniciar manualmente de um CD-ROM. Siga as instruções na <xref linkend="boot-newworld"/> para iniciar de disco rígido, excepto o uso da localização do <command>yaboot</command> do CD no prompt OF, tal como

source: Booting from Hard Disk
pt: Arrancar a partir de Disco Rígido

source: Booting from an existing operating system is often a convenient option; for some systems it is the only supported method of installation.
pt: Iniciar de um sistema operativo já existente é por vezes uma opção adequada; para alguns sistemas é a única forma de instalação suportada.

source: To boot the installer from hard disk, you will have already completed downloading and placing the needed files as described in <xref linkend="boot-drive-files"/>.
pt: Para iniciar o instalador a partir do disco rígido, terá de ter já completado o download dos ficheiros necessários bem como tê-los colocado conforme é descrito em <xref linkend="boot-drive-files"/>.

source: Booting OldWorld PowerMacs from MacOS
pt: Arrancar OldWorld PowerMacs a partir de MacOS

source: If you set up BootX in <xref linkend="files-oldworld"/>, you can use it to boot into the installation system. Double click the <guiicon>BootX</guiicon> application icon. Click on the <guibutton>Options</guibutton> button and select <guilabel>Use Specified RAM Disk</guilabel>. This will give you the chance to select the <filename>ramdisk.image.gz</filename> file. You may need to select the <guilabel>No Video Driver</guilabel> checkbox, depending on your hardware. Then click the <guibutton>Linux</guibutton> button to shut down MacOS and launch the installer.
pt: Se configurar BootX na <xref linkend="files-oldworld"/>, pode utilizá-lo para iniciar o sistema de instalação. Faça duplo clique no ícone da aplicação <guiicon>BootX</guiicon>. Clique no botão das opções <guibutton>Options</guibutton> e seleccione a checkbox <guilabel>No Video Driver</guilabel>, dependendo do seu hardware. Clique então no botão <guibutton>Linux</guibutton> para desligar o MacOS e o instalador iniciar.

source: Booting NewWorld Macs from OpenFirmware
pt: Arrancar Macs NewWorld a partir de OpenFirmware

source: You will have already placed the <filename>vmlinux</filename>, <filename>initrd.gz</filename>, <filename>yaboot</filename>, and <filename>yaboot.conf</filename> files at the root level of your HFS partition in <xref linkend="files-newworld"/>. You will now have to boot into OpenFirmware (see <xref linkend="invoking-openfirmware"/>). At the prompt, type <informalexample><screen> 0 &gt; boot hd:<replaceable>x</replaceable>,yaboot </screen></informalexample> replacing <replaceable>x</replaceable> with the partition number of the HFS partition where the kernel and yaboot files were placed, followed by a &enterkey;. On some machines, you may need to use <userinput>ide0:</userinput> instead of <userinput>hd:</userinput>. In a few more seconds you will see a yaboot prompt <informalexample><screen> boot: </screen></informalexample> At yaboot's <prompt>boot:</prompt> prompt, type either <userinput>install</userinput> or <userinput>install video=ofonly</userinput> followed by a &enterkey;. The <userinput>video=ofonly</userinput> argument is for maximum compatibility; you can try it if <userinput>install</userinput> doesn't work. The &debian; installation program should start.
pt: Já terá colocado os ficheiros <filename>vmlinux</filename>, <filename>initrd.gz</filename>, <filename>yaboot</filename>, e <filename>yaboot.conf</filename> ao nível da raiz da sua partição HFS na <xref linkend="files-newworld"/>. Terá de arrancar para o OpenFirmware (veja <xref linkend="invoking-openfirmware"/>). Na linha de comandos, escreva <informalexample><screen> 0 &gt; boot hd:<replaceable>x</replaceable>,yaboot </screen></informalexample> substituindo <replaceable>x</replaceable> pelo número da partição HFS onde os ficheiros do kernel e do yaboot foram colocados, pressione &enterkey; em seguida. Em algumas máquinas , poderá precisar de utilizar <userinput>ide0:</userinput> em vez de <userinput>hd:</userinput>. Em alguns segundos visualizará o prompt do yaboot <informalexample><screen> boot: </screen></informalexample> No prompt do yaboot <prompt>boot:</prompt>, digite o <userinput>install</userinput> ou <userinput>install video=ofonly</userinput>, seguindo da tecla &enterkey;. O argumento <userinput>video=ofonly</userinput> é para um máximo de compatibilidade; poderá tentar utilizá-lo se <userinput>install</userinput> não funcionar.

source: Booting from USB memory stick
pt: Arrancar a partir de uma 'pen' USB

source: Currently, NewWorld PowerMac systems are known to support USB booting.
pt: Actualmente, os sistemas NewWorld PowerMac são conhecidos por suportarem iniciar de USB.

source: Make sure you have prepared everything from <xref linkend="boot-usb-files"/>. To boot a Macintosh system from a USB stick, you will need to use the Open Firmware prompt, since Open Firmware does not search USB storage devices by default. See <xref linkend="invoking-openfirmware"/>.
pt: Certifique-se de que preparou tudo a partir da <xref linkend="boot-usb-files"/>. Para iniciar um sistema Macintosh a partir de um stick USB, irá necessitar de utilizar a linha de comandos do Open Firmware, já que por pré-definição o Open Firmware não procura dispositivos de armazenamento USB. Veja <xref linkend="invoking-openfirmware"/>.

source: You will need to work out where the USB storage device appears in the device tree, since at the moment <command>ofpath</command> cannot work that out automatically. Type <userinput>dev / ls</userinput> and <userinput>devalias</userinput> at the Open Firmware prompt to get a list of all known devices and device aliases. On the author's system with various types of USB stick, paths such as <filename>usb0/disk</filename>, <filename>usb0/hub/disk</filename>, <filename>/pci@f2000000/usb@1b,1/disk@1</filename>, and <filename>/pci@f2000000/usb@1b,1/hub@1/disk@1</filename> work.
pt: Terá de utilizar onde aparece o dispositivo de armazenamento USB na árvore de dispositivos, dado que no momento <command>ofpath</command> não o consegue utilizar de uma maneira automática. Digite no prompt de OpenFirmware <userinput>dev / ls</userinput> e <userinput>devalias</userinput> para conseguir a lista de todos os dispositivos e respectivos alias conhecidos. No sistema autor com vários stick USB, localizações como <filename>usb0/disk</filename>, <filename>usb0/hub/disk</filename>, <filename>/pci@f2000000/usb@1b,1/disk@1</filename>, e <filename>/pci@f2000000/usb@1b,1/hub@1/disk@1</filename> funcionam.

source: Having worked out the device path, use a command like this to boot the installer: <informalexample><screen> boot <replaceable>usb0/disk</replaceable>:<replaceable>2</replaceable>,\\:tbxi </screen></informalexample> The <replaceable>2</replaceable> matches the Apple_HFS or Apple_Bootstrap partition onto which you copied the boot image earlier, and the <userinput>,\\:tbxi</userinput> part instructs Open Firmware to boot from the file with an HFS file type of "tbxi" (i.e. <command>yaboot</command>) in the directory previously blessed with <command>hattrib -b</command>.
pt: Tendo retirado a localização do dispositivo, utilize um comando como este para iniciar o instalador: <informalexample><screen> boot <replaceable>usb0/disk</replaceable>:<replaceable>2</replaceable>,\\:tbxi </screen></informalexample> O <replaceable>2</replaceable> coincide com a partição Apple_HFS ou Apple_Bootstrap para onde anteriormente copiou a imagem de arranque, e o <userinput>,\\:tbxi</userinput> parte que instrui o Open Firmware a iniciar a partir do ficheiro com um ficheiro HFS do tipo "tbxi" (ex.: <command>yaboot</command>) num directório anteriormente abençoada com <command>hattrib -b</command>.

source: The system should now boot up, and you should be presented with the <prompt>boot:</prompt> prompt. Here you can enter optional boot arguments, or just hit &enterkey;.
pt: O sistema deve agora iniciar, e deve lhe ser apresentado o prompt <prompt>boot:</prompt>. Aqui pode inserir opcionalmente parâmetros de arranque. Aqui pode inserir parâmetros de arranque opcionais.

source: This boot method is new, and may be difficult to get to work on some NewWorld systems. If you have problems, please file an installation report, as explained in <xref linkend="submit-bug"/>.
pt: Este método de arranque é novo, e poderá ser difícil de o colocar a funcionar em alguns sistemas NewWorld. Se tiver dificuldades, por favor envie um ficheiro com o relatório de instalação, como é explicado na <xref linkend="submit-bug"/>.

source: Currently, PReP and New World PowerMac systems support netbooting.
pt: Actualmente, sistemas PReP e NewWorld PowerMac suportam netbooting.

source: On machines with Open Firmware, such as NewWorld Power Macs, enter the boot monitor (see <xref linkend="invoking-openfirmware"/>) and use the command <informalexample><screen> 0 &gt; boot enet:0 </screen></informalexample> If this doesn't work, you might have to add the filename like this: <informalexample><screen> 0 &gt; boot enet:0,yaboot </screen></informalexample> PReP and CHRP boxes may have different ways of addressing the network. On a PReP machine, you should try <informalexample><screen> boot net:<replaceable>server_ipaddr</replaceable>,<replaceable>file</replaceable>,<replaceable>client_ipaddr</replaceable> </screen></informalexample> On some PReP systems (e.g. Motorola PowerStack machines) the command <userinput>help boot</userinput> may give a description of syntax and available options.
pt: Em máquinas com Open Firmware, tais como as Mac NewWorld Power, entre no monitor de arranque (veja a <xref linkend="invoking-openfirmware"/>) e utilize o comando <informalexample><screen> 0 &gt; boot enet:0 </screen></informalexample> As máquinas PReP and CHRP podem ter diferentes maneiras de endereçar a rede. Numa máquina PReP, você deve tentar <informalexample><screen> boot net:<replaceable>server_ipaddr</replaceable>,<replaceable>file</replaceable>,<replaceable>client_ipaddr</replaceable> </screen></informalexample>Nalguns sistemas PReP (e.g. máquinas Motorola PowerStack) o comando <userinput>help boot</userinput> pode dar uma descrição da sintaxe e as opções disponíveis.

source: Booting from floppies is supported for &arch-title;, although it is generally only applicable for OldWorld systems. NewWorld systems are not equipped with floppy drives, and attached USB floppy drives are not supported for booting.
pt: Arrancar a partir de disquetes é suportado para &arch-title;,·embora geralmente apenas aplicável a sistemas OldWorld. Sistemas NewWorld não são equipados com drives de disquetes, e drives de disquetes USB não são suportadas para arranque.

source: To boot from the <filename>boot-floppy-hfs.img</filename> floppy, place it in floppy drive after shutting the system down, and before pressing the power-on button.
pt: Para arrancar a partir de disquete <filename>boot-floppy-hfs.img</filename>, coloque-a no dispositivo de disquetes após ter desligado o sistema, e antes de o voltar a ligar.

source: For those not familiar with Macintosh floppy operations: a floppy placed in the machine prior to boot will be the first priority for the system to boot from. A floppy without a valid boot system will be ejected, and the machine will then check for bootable hard disk partitions.
pt: Para aqueles que não estão familiarizados com operações de disquetes em Macintosh: uma disquete colocada na máquina antes do arranque será a primeira prioridade para o sistema arrancar. Uma disquete sem um sistema de boot válido será ejectada e a máquina irá procurar por partições do disco rígido pelas quais possa arrancar.

source: After booting, the <filename>root.bin</filename> floppy is requested. Insert the root floppy and press &enterkey;. The installer program is automatically launched after the root system has been loaded into memory.
pt: Após re-iniciar, é pedida a disquete <filename>root.bin</filename>. Insira a disquete root e carregue em &enterkey;.O programa instalador é automaticamente lançado após o sistema root ter sido carregado para a memória.

source: PowerPC Boot Parameters
pt: PowerPC parâmetros de arranque

source: Many older Apple monitors used a 640x480 67Hz mode. If your video appears skewed on an older Apple monitor, try appending the boot argument <userinput>video=atyfb:vmode:6</userinput> , which will select that mode for most Mach64 and Rage video hardware. For Rage 128 hardware, this changes to <userinput>video=aty128fb:vmode:6</userinput> .
pt: Muitos monitores antigos Apple utilizam o modo 640x480 67Hz. Se a sua imagem aparece enviesada num monitor Apple antigo, tente adicionar o argumento de arranque <userinput>video=atyfb:vmode:6</userinput>, que irá seleccionar esse modo para a maioria do hardware Mach64 e Rage. No hardware Rage 128, isto altera para <userinput>video=aty128fb:vmode:6</userinput> .

source: On machines with OpenBoot, simply enter the boot monitor on the machine which is being installed (see <xref linkend="invoking-openboot"/>). Use the command <userinput>boot net</userinput> to boot from a TFTP and RARP server, or try <userinput>boot net:bootp</userinput> or <userinput>boot net:dhcp</userinput> to boot from a TFTP and BOOTP or DHCP server. You can pass extra boot parameters to &d-i; at the end of the <userinput>boot</userinput> command.
pt: Em máquinas com OpenBoot, simplesmente entre no monitor de arranque na máquina que está a ser instalada (veja a <xref linkend="invoking-openboot"/>). Utilize o comando <userinput>boot net</userinput> para arrancar a partir de um servidor TFTP e RARP, ou tente <userinput>boot net:bootp</userinput> ou <userinput>boot net:dhcp</userinput> para arrancar a partir de um servidor TFTP e BOOTP ou DHCP. Pode passar parâmetros extra de arranque ao &d-i; no final do comando <userinput>boot</userinput>.

source: Most OpenBoot versions support the <userinput>boot cdrom</userinput> command which is simply an alias to boot from the SCSI device on ID 6 (or the secondary master for IDE based systems).
pt: A maioria das versões OpenBoot suportam o comando <userinput>boot cdrom</userinput> que é simplesmente um alias para iniciar a partir de um dispositivo SCSI no ID 6 (ou o master secundário para sistemas IDE).

source: IDPROM Messages
pt: Mensagens IDPROM

source: If you cannot boot because you get messages about a problem with <quote>IDPROM</quote>, then it's possible that your NVRAM battery, which holds configuration information for you firmware, has run out. See the <ulink url="&url-sun-nvram-faq;">Sun NVRAM FAQ</ulink> for more information.
pt: Se não consegue arrancar porque recebe mensagens sobre um problema com <quote>IDPROM</quote>, então é possível que a sua bateria NVRAM, que contém informação de configuração para o seu firmware, se tenha esgotado. Veja a <ulink url="&url-sun-nvram-faq;">Sun NVRAM FAQ</ulink> para mais informação.

source: Accessibility
pt: Acessibilidade

source: Some users may need specific support because of e.g. some visual impairment. <phrase arch="ia64;powerpc;x86">USB braille displays are detected automatically, but most other</phrase> <phrase arch="arm;hppa;mips;mipsel;sparc">Most</phrase> accessibility features have to be enabled manually. <phrase arch="x86">On machines that support it, the boot menu emits a beep when it is ready to receive keystrokes.</phrase> Some boot parameters can <phrase arch="x86">then</phrase> be appended to enable accessibility features<phrase arch="x86"> (see also <xref linkend="boot-screen"/>)</phrase>. Note that on most architectures the boot loader interprets your keyboard as a QWERTY keyboard.
pt: Alguns utilizadores podem necessitar de suporte especifico devido a, por exemplo, visão reduzida. <phrase arch="ia64;powerpc;x86">Os ecrãs braille USB são automaticamente detectados, mas a maioria das outras</phrase> <phrase arch="arm;hppa;mips;mipsel;sparc">A maioria das</phrase> funcionalidades de acessibilidade têm de ser activadas manualmente. <phrase arch="x86">Em máquinas que o suportem, o menu de arranque emite um apito quando estiver pronto a ser utilizado o teclado.</phrase> Alguns parâmetros de arranque podem <phrase arch="x86">então</phrase> ser acrescentados para activar as funcionalidades de acessibilidade<phrase arch="x86">(veja também <xref linkend="boot-screen"/>)</phrase>. Note que na maioria das arquitecturas o gestor de arranque interpreta o seu teclado como sendo um teclado QWERTY.

source: USB Braille Displays
pt: Ecrãs Braille USB

source: USB braille displays should be automatically detected. A textual version of the installer will then be automatically selected, and support for the braille display will be automatically installed on the target system. You can thus just press &enterkey; at the boot menu. Once <classname>brltty</classname> is started, you can choose a braille table by entering the preference menu. Documentation on key bindings for braille devices is available on the <ulink url="&url-brltty-driver-help;"><classname>brltty</classname> website</ulink>.
pt: Os ecrãs braille USB devem ser automaticamente detectados. Uma versão textual do instalador será então automaticamente seleccionada, e o suporte para o ecrã braille será automaticamente instalado no sistema a instalar. Pode então carregar em &enterkey; no menu de arranque. Uma vez que o <classname>brltty</classname> seja iniciado, poderá escolher uma tabela braille entrando no menu de preferências. O documentação acerca das teclas de atalho para os dispositivos braille estão disponíveis no <ulink url="&url-brltty-driver-help;">website <classname>brltty</classname></ulink>.

source: Serial Braille Displays
pt: Ecrãs Braille Série
