Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/install-methods.po
Languages: fi, pt

source: Obtaining System Installation Media
fi: Asennustaltioiden hankkiminen
pt: Obter o Meio de Instalação do Sistema

source: Official &debian-gnu; CD-ROM Sets
fi: Viralliset &debian-gnu; romput
pt: Conjuntos Oficiais de CD-ROMs &debian-gnu;

source: By far the easiest way to install &debian-gnu; is from an Official &debian; CD-ROM Set. You can buy a set from a vendor (see the <ulink url="&url-debian-cd-vendors;">CD vendors page</ulink>). You may also download the CD-ROM images from a &debian; mirror and make your own set, if you have a fast network connection and a CD burner (see the <ulink url="&url-debian-cd;">Debian CD page</ulink> for detailed instructions). If you have a &debian; CD set and CDs are bootable on your machine, you can skip right to <xref linkend="boot-installer"/>; much effort has been expended to ensure the files most people need are there on the CD. Although a full set of binary packages requires several CDs, it is unlikely you will need packages on the third CD and above. You may also consider using the DVD version, which saves a lot of space on your shelf and you avoid the CD shuffling marathon.
fi: &debian-gnu; on helpointa asentaa virallisilta rompuilta. Romput voi ostaa kauppiaalta (katso <ulink url="&url-debian-cd-vendors;">Debianin CD-toimittajat</ulink> -sivulta). Jos &debian;in romput on jo hankittuna ja romput kelpaavat käynnistysrompuksi asennettavalla tietokoneella, voidaan hypätä suoraan kohtaan <xref linkend="boot-installer"/>; paljon vaivaa on nähty jotta useimpien käyttäjien tarvitsemat tiedostot olisivat rompulla. Vaikkakin tarvitaan monta romppua, jotta kaikki asennuspaketit saadaan mahtumaan, on epätodennäköistä, että tarvittaisiin paketteja jotka ovat kolmannella rompulla tai sen jälkeen. Kannattaa huomata myös asennus-DVD, jolla säästää paljon hyllytilaa ja välttyy rompunvaihtotalkoilta.
pt: A forma mais simples para se instalar o &debian-gnu; é de longe a partir de um conjunto de CD-ROM oficiais. Pode também comprar um conjunto de CDs a um vendedor (visite a <ulink url="&url-debian-cd-vendors;">página de vendedores de CDs</ulink>). Também pode fazer o download das imagens a partir do mirror da &debian; e fazer o seu próprio conjunto, se tiver uma ligação rápida à Internet e um gravador de CDs (para informações detalhadas visite a <ulink url="&url-debian-cd;">página de CDs Debian</ulink>). Se tem um conjunto de CDs &debian; e estes iniciam na sua máquina, pode saltar directamente para o <xref linkend="boot-installer"/>; muito esforço tem sido gasto para garantir que os ficheiros que a maioria das pessoas precisam estão presentes no CD. Embora o conjunto completo dos pacotes binários necessite de vários CDs, é pouco provável que você irá precisar dos pacotes que estão presentes no terceiro CD e seguintes. Deve também considerar em usar a versão em DVD, que poupa bastante espaço na sua prateleira e evita a maratona de CDs misturados.

source: If your machine doesn't support CD booting, but you do have a CD set, you can use an alternative strategy such as <phrase condition="supports-floppy-boot">floppy disk,</phrase> <phrase arch="s390">tape, emulated tape,</phrase> <phrase condition="bootable-disk">hard disk,</phrase> <phrase condition="bootable-usb">usb stick,</phrase> <phrase condition="supports-tftp">net boot,</phrase> or manually loading the kernel from the CD to initially boot the system installer. The files you need for booting by another means are also on the CD; the &debian; network archive and CD folder organization are identical. So when archive file paths are given below for particular files you need for booting, look for those files in the same directories and subdirectories on your CD.
fi: Jos tietokone ei tue rompulta käynnistämistä, mutta romput ovat käytettävissä, voidaan käyttää vaihtoehtoista tapaa kuten <phrase condition="supports-floppy-boot">levykettä,</phrase> <phrase arch="s390">nauhaa, emuloitua nauhaa,</phrase> <phrase condition="bootable-disk">kiintolevyä,</phrase> <phrase condition="bootable-usb">USB-muistia,</phrase> <phrase condition="supports-tftp">käynnistystä verkosta,</phrase> tai ytimen lataamista itse rompulta järjestelmän asentimen ensimmäiseen käynnistämiseen. Myöskin muilla tavoin käynnistämiseen tarvittavat tiedostot ovat rompulla; &debian;in verkossa olevan asennuspalvelimen ja romppujen hakemistorakenne on samanlainen. Joten kun seuraavassa kerrotaan käynnistämisessä tarvittavien arkiston tiedostojen polkunimiä, löytyvät tiedostot samoista hakemistoista ja alihakemistoista rompulta.
pt: Se a sua máquina não suporta arranque a partir de CD, mas no entanto tem um conjunto de CDs, você pode utilizar uma estratégia alternativa tal como <phrase condition="supports-floppy-boot">disquete,</phrase> <phrase arch="s390">tape, tape emulada, </phrase> <phrase condition="bootable-disk">disco rígido,</phrase> <phrase condition="bootable-usb">stick usb,</phrase> <phrase condition="supports-tftp">net boot,</phrase> ou carregar manualmente o kernel a partir do CD para iniciar o instalador de sistema. Os ficheiros que precisa para inicializar através de outros métodos também estão no CD; A organização dos ficheiros do arquivo &debian; na Internet é idêntica à organização de ficheiros do CD. Portanto quando abaixo forem dadas localizações para ficheiros específicos necessários para o arranque, procure por esses ficheiros nos mesmos directórios e sub-directórios do seu CD.

source: Once the installer is booted, it will be able to obtain all the other files it needs from the CD.
fi: Kun asennin on käynnistetty, se osaa noutaa kaikki muut tarvitsemansa tiedostot rompulta.
pt: Uma vez o instalador iniciado, a partir do CD você poderá obter todos os outros ficheiros que precisa.

source: If you don't have a CD set, then you will need to download the installer system files and place them on the <phrase arch="s390">installation tape</phrase> <phrase condition="supports-floppy-boot">floppy disk or</phrase> <phrase condition="bootable-disk">hard disk or</phrase> <phrase condition="bootable-usb">usb stick or</phrase> <phrase condition="supports-tftp">a connected computer</phrase> so they can be used to boot the installer.
fi: Jos romppuja ei ole, on asentimen järjestelmätiedostot noudettava netistä ja tallennettava ne <phrase arch="s390">asennusnauhalle</phrase> <phrase condition="supports-floppy-boot">levykkeelle tai</phrase> <phrase condition="bootable-disk">kiintolevylle tai</phrase> <phrase condition="bootable-usb">USB-muistille tai</phrase> <phrase condition="supports-tftp">verkkoyhteyden päässä olevalle tietokoneelle</phrase> jotta asennin voidaan käynnistää niiltä.
pt: Se você não tem um conjunto de CDs, necessitará então de fazer o download dos ficheiros de instalação do sistema e colocá-los na <phrase arch="s390">tape de instalação ou na </phrase> <phrase condition="supports-floppy-boot">disquete ou</phrase> <phrase condition="bootable-disk"> no disco rígido ou </phrase> <phrase condition="bootable-usb">num usb stick ou</phrase> <phrase condition="supports-tftp">num computador que esteja ligado à rede</phrase> para que possam ser utilizados para arrancar com o instalador.

source: Downloading Files from &debian; Mirrors
fi: Tiedostojen noutaminen &debian;in asennuspalvelimilta
pt: Download dos Ficheiros a partir dos Mirrors &debian;

source: To find the nearest (and thus probably the fastest) mirror, see the <ulink url="&url-debian-mirrors;">list of &debian; mirrors</ulink>.
fi: Lähimmän (ja siten luultavasti nopeimman) asennuspalvelimen löytää <ulink url="&url-debian-mirrors;">&debian;in asennuspalvelimien luettelosta</ulink>.
pt: Para encontrar o mirror mais próximo (e provavelmente o mais rápido), visite a <ulink url="&url-debian-mirrors;">lista de mirrors Debian</ulink>.

source: When downloading files from a &debian; mirror using FTP, be sure to download the files in <emphasis>binary</emphasis> mode, not text or automatic mode.
fi: FTP:tä käytettäessä muista noutaa tiedostot &debian;in asennuspalvelimelta <emphasis>binäärimuodossa</emphasis>, ei tekstimuodossa tai automaattimuodossa.
pt: Quando fizer download de ficheiros de um mirror &debian; utilizando FTP, certifique-se de que faz o download dos ficheiros em modo <emphasis>binário</emphasis>, e não em modo de texto ou no modo automático.

source: Where to Find Installation Images
fi: Mistä asennusotokset löytyvät?
pt: Onde Encontrar Imagens de Instalação

source: The installation images are located on each &debian; mirror in the directory <ulink url="&url-debian-installer;images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink> &mdash; the <ulink url="&url-debian-installer;images/MANIFEST">MANIFEST</ulink> lists each image and its purpose.
fi: Asennuslevyjen otokset löytyvät jokaisesta &debian;in asennuspalvelimesta hakemistosta <ulink url="&url-debian-installer;images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink> &mdash; luettelossa <ulink url="&url-debian-installer;images/MANIFEST">MANIFEST</ulink> on kaikki otokset ja niiden käyttötarkoitus.
pt: As imagens de instalação estão localizadas em cada mirror &debian; no directório <ulink url="&url-debian-installer;images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink> &mdash; o <ulink url="&url-debian-installer;images/MANIFEST">MANIFEST</ulink> lista cada imagem e o seu propósito.

source: NSLU2 Installation Files
fi: NSLU2:n asennustiedostot
pt: Ficheiros de Instalação para NSLU2

source: A firmware image is provided for the Linksys NSLU2 which will automatically boot <classname>debian-installer</classname>. This image can be uploaded via the Linksys web frontend or with upslug2. This firmware image can be obtained from &nslu2-firmware-img;.
fi: Linksys NSLU2:lle on laiteohjelmisto joka käynnistää automaattisesti &debian;in asentimen <classname>debian-installer</classname>. Tämä laiteohjelmiston otos on saatavilla tiedostossa &nslu2-firmware-img;.
pt: É disponibilizada uma imagem de firmware para o Linksys NSLU2 a qual irá arrancar automaticamente o <classname>debian-installer</classname>. Pode ser feito o upload desta imagem através do frontend web da Linksys ou com upslug2. Esta imagem de firmware pode ser obtida a partir de &nslu2-firmware-img;.

source: Thecus N2100 Installation Files
fi: Thecus N2100:n asennustiedostot
pt: Ficheiros de Instalação para Thecus N2100

source: A firmware image is provided for the Thecus N2100 which will automatically boot <classname>debian-installer</classname>. This image can be installed using the Thecus firmware upgrade process. This firmware image can be obtained from &n2100-firmware-img;.
fi: Thecus N2100:lle on laiteohjelmisto joka käynnistää automaattisesti &debian;in asentimen <classname>debian-installer</classname>. Tämä laiteohjelmiston otos saadaan tiedostosta &n2100-firmware-img;.
pt: É disponibilizada uma imagem de firmware para o Thecus N2100 a qual irá arrancar automaticamente o <classname>debian-installer</classname>. Esta imagem pode ser instalada utilizando o processo de actualização de firmware da Thecus. Esta imagem de firmware pode ser obtida a partir de &n2100-firmware-img;.

source: GLAN Tank Installation Files
fi: GLAN Tank:n asennustiedostot
pt: Ficheiros de Instalação do GLAN Tank

source: The GLAN Tank requires a kernel and ramdisk on an ext2 partition on the disk on which you intend to install &debian;. These images can be obtained from &glantank-firmware-img;.
fi: GLAN Tank vaatii ytimen ja muistilevyn ext2-osiolla, jonka on oltava sillä levyllä johon &debian; aiotaan asentaa. Nämä otokset saadaan osoitteesta &glantank-firmware-img;.
pt: O GLAN Tank necessita de um kernel e ramdisk numa partição ext2 no disco onde pretende instalar &debian;. Estas imagens podem ser obtidas a partir de &glantank-firmware-img;.

source: Kurobox Pro Installation Files
fi: Kurobox Pro:n asennustiedostot
pt: Ficheiros de Instalação do Kurobox Pro

source: The Kurobox Pro requires a kernel and ramdisk on an ext2 partition on the disk on which you intend to install &debian;. These images can be obtained from &kuroboxpro-firmware-img;.
fi: Kurobox Pro vaatii ytimen ja muistilevyn ext2-osiolla, jonka on oltava sillä levyllä johon &debian; aiotaan asentaa. Nämä otokset saadaan osoitteesta &kuroboxpro-firmware-img;.
pt: A Kurobox Pro necessita de um kernel e ramdisk numa partição ext2 no disco em que pretende instalar &debian;. Estas imagens podem ser obtidas a partir de &kuroboxpro-firmware-img;.

source: HP mv2120 Installation Files
fi: HP mv2120:n asennustiedostot
pt: Ficheiros de Instalação para HP mv2120

source: A firmware image is provided for the HP mv2120 which will automatically boot <classname>debian-installer</classname>. This image can be installed with uphpmvault on Linux and other systems and with the HP Media Vault Firmware Recovery Utility on Windows. The firmware image can be obtained from &mv2120-firmware-img;.
fi: HP vv2120:lle on laiteohjelmisto joka käynnistää automaattisesti &debian;in asentimen <classname>debian-installer</classname>. Tämä otos asennetaan uphpmvault:lla Linuxissa ja muissa järjestelmissä ja HP Media Vault Firmware Recovery Utility:llä Windowsissa. Tämä laiteohjelmiston otos saadaan tiedostosta &mv2120-firmware-img;.
pt: É disponibilizada uma imagem de firmware para o HP mv2120 que irá arrancar automaticamente o <classname>debian-installer</classname>. Esta imagem pode ser instalada com o uphpmvault em Linux e noutros sistemas e com o HP Media Vault Firmware Recovery Utility em Windows. A imagem de firmware pode ser obtida a partir de &mv2120-firmware-img;.

source: QNAP Turbo Station Installation Files
fi: QNAP Turbo Station:in asennustiedostot
pt: Ficheiros de Instalação para QNAP Turbo

source: The installation files for the QNAP Turbo Station consist of a kernel and ramdisk as well as a script to write these images to flash. You can obtain the installation files for QNAP TS-109 and TS-209 from &qnap-orion-firmware-img; and for QNAP TS-110, TS-119, TS-210, TS-219, TS-219P from &qnap-kirkwood-firmware-img;.
fi: QNAP Turbo Stationin asennustiedostoissa on ydin ja muistilevy sekä komentotiedosto jolla nämä otokset kirjoitetaan flash-muistiin. Asennustiedostot malleille QNAP TS-109 ja TS-209 löytyvät osoitteesta &qnap-orion-firmware-img; ja malleille QNAP TS-110, TS-119, TS-210, TS-219, TS-219P osoitteesta &qnap-kirkwood-firmware-img;.
pt: Os ficheiros de instalação para o QNAP Turbo Station consiste num kernel e num ramdisk assim como dum script para escrever essas imagens na flash. Pode obter esses ficheiros de instalação para o QNAP TS-109 e TS-209 a partir de &qnap-orion-firmware-img; e para o QNAP TS-110, TS-119, TS-210, TS-219, TS-219P a parir de &qnap-kirkwood-firmware-img;.

source: SheevaPlug and OpenRD Installation Files
fi: SheevaPlug:in ja OpenRD:n asennustiedostot
pt: Ficheiros de Instalação para SheevaPlug e OpenRD

source: The installation files for the Marvell SheevaPlug and OpenRD devices consist of a kernel and initrd for U-Boot. You can obtain these files from &kirkwood-marvell-firmware-img;.
fi: Marvell Sheevaplug:in ja OpenRD:n asennustiedostoissa on ydin ja initrd U-Boot:lle. Nämä tiedostot ovat saatavilla osoitteesta &kirkwood-marvell-firmware-img;.
pt: Os ficheiros de instalação para o Marvell SheevaPlug e dispositivos OpenRD consistem num kernel e initrd para U-Boot. Pode obter esses ficheiros a partir de &kirkwood-marvell-firmware-img;.

source: Creating an IPL tape
fi: IPL-nauhan luominen
pt: Criar uma tape IPL

source: If you can't boot (IPL) from the CD-ROM and you are not using VM you need to create an IPL tape first. This is described in section 3.4.3 in the <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and S/390: Distributions</ulink> Redbook. The files you need to write to the tape are (in this order): <filename>kernel.debian</filename>, <filename>parmfile.debian</filename> and <filename>initrd.debian</filename>. The files can be downloaded from the <filename>tape</filename> sub-directory, see <xref linkend="where-files"/>.
fi: Jos käynnistäminen (IPL) rompulta ei ole mahdollista eikä VM ole käytössä, on ensin luotava IPL-nauha. Ohjeet tähän löytyvät luvusta 3.4.3 Redbookista <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and S/390: Distributions</ulink>. Tiedostot jotka on (tässä järjestyksessä) kirjoitettava nauhalle ovat: <filename>kernel.debian</filename>, <filename>parmfile.debian</filename> ja <filename>initrd.debian</filename>. Tiedostot voi noutaa alihakemistosta <filename>tape</filename>, katso kohdasta <xref linkend="where-files"/>.
pt: Se não pode iniciar (IPL) a partir de CD-ROM e não está a utilizar VM primeiro precisa criar uma tape IPL. Isto é descrito na secção 3.4.3 no <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and S/390: Distributions</ulink> Redbook. Os ficheiros que precisa escrever para a tape são (por esta ordem): <filename>kernel.debian</filename>, <filename>parmfile.debian</filename> e <filename>initrd.debian</filename>. O download destes ficheiros pode ser feito a partir do sub-directório <filename>tape</filename>, visite <xref linkend="where-files"/>,

source: Creating Floppies from Disk Images
fi: Levykkeiden luominen levyotoksista
pt: Criar Disquetes a partir de Imagens de Disco

source: Bootable floppy disks are generally used as a last resort to boot the installer on hardware that cannot boot from CD or by other means.
fi: Käynnistyslevykkeitä käytetään tavallisesti viimeisenä konstina asentimen käynnistämiseen laitteilla, joita ei voi käynnistää rompulta tai muilla tavoin.
pt: As disquetes de arranque são geralmente utilizadas como último recurso para iniciar o instalador em hardware que não arranca de CD ou por outros meios.

source: Booting the installer from floppy disk reportedly fails on Mac USB floppy drives.
fi: Kuulemma asentimen käynnistäminen levykkeeltä ei toimi Mac USB-levykeasemilta.
pt: É relatado que falha ao arrancar a partir da disquete nas drives USB de disquetes Mac.

source: Disk images are files containing the complete contents of a floppy disk in <emphasis>raw</emphasis> form. Disk images, such as <filename>boot.img</filename>, cannot simply be copied to floppy drives. A special program is used to write the image files to floppy disk in <emphasis>raw</emphasis> mode. This is required because these images are raw representations of the disk; it is required to do a <emphasis>sector copy</emphasis> of the data from the file onto the floppy.
fi: Levyotokset ovat tiedostoja, joissa on levykkeen koko sisältö <emphasis>käsittelemättömässä</emphasis> muodossa. Levyotoksia kuten <filename>boot.img</filename> ei voi suoraan kopioida levykkeelle. Tarvitaan tätä tarkoitusta varten tehty ohjelma kirjoittamaan levyotos levykkeelle <emphasis>käsittelemättömässä</emphasis> muodossa. Näin on meneteltävä, koska otokset ovat levyn käsittelemättömiä sisältöjä; tiedosto on kirjoitettava levykkeelle sektori kerrallaan.
pt: Imagens de disco são ficheiros que contêm o conteúdo completo das disquetes de arranque em formato <emphasis>raw</emphasis>. Imagens de disco, tais como <filename>boot.img</filename>, não podem simplesmente ser copiadas para disquetes. É utilizado um programa especial para escrever os ficheiros da imagem para disquetes em modo <emphasis>raw</emphasis>. Isto é necessário porque estas imagens são representações raw do disco; é necessário que seja feita uma <emphasis>cópia do sector</emphasis> dos dados deste ficheiro para a disquete.

source: There are different techniques for creating floppies from disk images. This section describes how to create floppies from disk images on different platforms.
fi: Levykkeiden tekemiseen levyotoksista on useita tapoja. Tässä luvussa kerrotaan miten levyotoksista tehdään levykkeitä eri laitealustoilla.
pt: Existem diferentes técnicas para criar disquetes a partir de imagens de disco. Esta secção descreve como criar disquetes a partir de imagens de disco em diferentes plataformas.

source: Before you can create the floppies, you will first need to download them from one of the &debian; mirrors, as explained in <xref linkend="downloading-files"/>. <phrase arch="i386">If you already have an installation CD-ROM or DVD, the floppy images may also be included on the CD/DVD.</phrase>
fi: Ennen kuin levykkeitä voi kirjoittaa, on ne ensin noudettava jostain &debian;in asennuspalvelimesta, kuten selitetään kohdassa <xref linkend="downloading-files"/>. <phrase arch="i386">Jos sinulla on asennusromppu, saattavat levykeotokset olla rompulla.</phrase>
pt: Antes de você poder criar as disquetes, primeiro você tem de fazer o download delas a partir de um dos mirrors &debian;, conforme é explicado em <xref linkend="downloading-files"/>. <phrase arch="i386">Se você já tiver um CD-ROM ou DVD de instalação, as imagens de disquetes podem também estar incluídas no CD/DVD.</phrase>

source: No matter which method you use to create your floppies, you should remember to flip the write-protect tab on the floppies once you have written them, to ensure they are not damaged unintentionally.
fi: Tehtiinpä levykkeet millä tavalla tahansa, on kirjoittamisen jälkeen muistettava pistää levykkeiden kirjoitussuojaus päälle, jottei niiden päälle kirjoita vahingossa.
pt: Não importa que método estiver a utilizar para criar as suas disquetes, assim que tiver escrito nelas deve lembrar-se de carregar na patilha de protecção contra escrita, para se assegurar que não serão involuntariamente danificadas.

source: Writing Disk Images From a Linux or Unix System
fi: Levyotosten kirjoittaminen Linuxissa tai Unixissa
pt: Escrever Imagens de Disco a partir de um Sistema Linux ou Unix
