Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/install-methods.po
Languages: fi, pt

source: If you intend to install &debian; on an SGI machine and your TFTP server is a GNU/Linux box running Linux 2.4, you'll need to set the following on your server: <informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> to turn off Path MTU discovery, otherwise the SGI's PROM can't download the kernel. Furthermore, make sure TFTP packets are sent from a source port no greater than 32767, or the download will stall after the first packet. Again, it's Linux 2.4.X tripping this bug in the PROM, and you can avoid it by setting <informalexample><screen> # echo "2048 32767" &gt; /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample> to adjust the range of source ports the Linux TFTP server uses.
fi: Asennettaessa &debian;ia SGI:n koneelle kun TFTP-palvelin on GNU/Linux-kone jossa on Linux 2.4, on palvelimella tehtävä seuraavat asetukset:<informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> Tämä ottaa Path MTU discoveryn pois päältä, muuten SGI:n PROM ei osaa noutaa ydintä. Lisäksi on varmistuttava TFTP-paketteja lähetettävän portista, jonka numero on enintään 32767, tai nouto pysähtyy ensimmäisen paketin jälkeen. Taaskin se on Linux 2.4.X joka löytää tämän vian PROM:sta, ja se voidaan välttää asetuksella<informalexample><screen> # echo "2048 32767" &gt; /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample> jolla säädetään aluetta jolta Linuxin TFTP-palvelimen valitsee käyttämänsä lähdeporttit.
pt: Se tenciona instalar &debian; numa máquina SGI e o seu servidor é uma máquina GNU/Linux utilizando um Linux 2.4, necessitará de configurar o seguinte no servidor <informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> para desligar o Path MTU discovery, caso contrário o PROM da SGI não consegue fazer o download do kernel. Além disso, assegure-se que os pacotes TFTP são enviados a partir de um source port não maior que 32767, ou o download irá ficar bloqueado após o primeiro pacote. Mais uma vez, o Linux 2.4.X despoleta este bug na PROM, pode evitá-lo configurando <informalexample><screen> # echo "2048 32767" &gt; /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample> para ajustar a gama de source ports que o servidor TFTP de Linux utiliza.

source: Move TFTP Images Into Place
fi: Siirretään TFTP-otokset paikalleen
pt: Mover Imagens TFTP Para o Lugar

source: Next, place the TFTP boot image you need, as found in <xref linkend="where-files"/>, in the <command>tftpd</command> boot image directory. You may have to make a link from that file to the file which <command>tftpd</command> will use for booting a particular client. Unfortunately, the file name is determined by the TFTP client, and there are no strong standards.
fi: Seuraavaksi on tarvittava TFTP-käynnistysotos (kohdasta <xref linkend="where-files"/>) tallennettava <command>tftpd</command>:n käynnistysotosten hakemistoon. Tuosta tiedostosta on ehkä tehtävä linkki tiedostoon jota <command>tftpd</command> käyttää tietyn asiakkaan käynnistämiseen. Harmittavasti tiedoston nimen määrää TFTP-asiakas, eikä nimeämiskäytännölle ole kunnollisia standardeja.
pt: Em seguida, coloque a imagem de arranque do TFTP que necessita, conforme encontrada na <xref linkend="where-files"/>, no directório de imagem de arranque <command>tftpd</command>. Terá de fazer um link a partir desse ficheiro para o ficheiro que o <command>tftpd</command> irá utilizar para iniciar um cliente em particular. Infelizmente, o nome do ficheiro é determinado pelo cliente TFTP, e não existem standards sólidos.

source: On NewWorld Power Macintosh machines, you will need to set up the <command>yaboot</command> boot loader as the TFTP boot image. <command>Yaboot</command> will then retrieve the kernel and RAMdisk images via TFTP itself. You will need to download the following files from the <filename>netboot/</filename> directory:
fi: NewWorld Power Macintosh -koneilla on käynnistyslatain <command>yaboot</command> asetettava TFTP:n käynnistysotokseksi. <command>Yaboot</command> noutaa sitten ytimen ja muistilevyn otokset TFTP:llä. Hakemistosta <filename>netboot</filename> on noudettava seuraavat tiedostot:
pt: Em máquinas Macintosh Power NewWorld, irá necessitar de instalar o gestor de arranque <command>yaboot</command> como a imagem de arranque TFTP. O <command>yaboot</command> irá então obter a imagem do kernel e RAMdisk através do próprio TFTP. Irá ter de fazer download dos seguintes ficheiros a partir do directório <filename>netboot/</filename>:

source: For PXE booting, everything you should need is set up in the <filename>netboot/netboot.tar.gz</filename> tarball. Simply extract this tarball into the <command>tftpd</command> boot image directory. Make sure your dhcp server is configured to pass <filename>pxelinux.0</filename> to <command>tftpd</command> as the filename to boot.
fi: Käytettäessä PXE-käynnistystä on kaikki mitä pitäisi tarvittaman tar-arkistossa <filename>netboot/netboot.tar.gz</filename>. Pura vaan tämä arkisto <command>tftpd</command>:n käynnistysotosten hakemistoon. Varmista, että dhcp-palvelimen asetuksissa on <command>tftpd</command>:lle välitettävän käynnistettävän tiedoston nimenä <filename>/pxelinux.0</filename>.
pt: Para um arranque PXE, tudo o que deve precisar configurar está no tarball <filename>netboot/netboot.tar.gz</filename>. Extraia simplesmente este tarball para o directório da imagem de arranque <command>tftpd</command>. Certifique-se que o servidor dhcp está configurado para passar <filename>/pxelinux.0</filename> ao <command>tftpd</command> como o nome do ficheiro para arrancar.

source: For PXE booting, everything you should need is set up in the <filename>netboot/netboot.tar.gz</filename> tarball. Simply extract this tarball into the <command>tftpd</command> boot image directory. Make sure your dhcp server is configured to pass <filename>/debian-installer/ia64/elilo.efi</filename> to <command>tftpd</command> as the filename to boot.
fi: Käytettäessä PXE-käynnistystä on kaikki mitä pitäisi tarvittaman tar-arkistossa <filename>netboot/netboot.tar.gz</filename>. Pura vaan tämä arkisto <command>tftpd</command>:n käynnistysotosten hakemistoon. Varmista, että dhcp-palvelimen asetuksissa on <command>tftpd</command>:lle välitettävän käynnistettävän tiedoston nimenä <filename>/debian-installer/ia64/elilo.efi</filename>.
pt: Para um arranque PXE, tudo o que deve precisar configurar está no tarball <filename>netboot/netboot.tar.gz</filename>. Apenas extraia este tarball para o directório da imagem de arranque <command>tftpd</command>. Certifique-se que o servidor dhcp está configurado para passar <filename>/debian-installer/ia64/elilo.efi</filename> ao <command>tftpd</command> como o nome do ficheiro para arrancar.

source: SPARC TFTP Booting
fi: SPARC:n käynnistys TFTP:llä
pt: Arrancar SPARC TFTP

source: Some SPARC architectures add the subarchitecture names, such as <quote>SUN4M</quote> or <quote>SUN4C</quote>, to the filename. Thus, if your system's subarchitecture is a SUN4C, and its IP is 192.168.1.3, the filename would be <filename>C0A80103.SUN4C</filename>. However, there are also subarchitectures where the file the client looks for is just <filename>client-ip-in-hex</filename>. An easy way to determine the hexadecimal code for the IP address is to enter the following command in a shell (assuming the machine's intended IP is 10.0.0.4). <informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> To get to the correct filename, you will need to change all letters to uppercase and if necessary append the subarchitecture name.
fi: Jotkin SPARC-suoritinperheet lisäävät suoritinarkkitehtuurin nimen, kuten <quote>SUN4M</quote> tai <quote>SUN4C</quote>, tiedoston nimeen. Niinpä, jos järjestelmän suoritinarkkitehtuuri on SUN4C ja sen IP on 192.168.1.3, tiedoston nimi olisi <filename>C0A80103.SUN4C</filename>. Joissakin suoritinarkkitehtuuressa asiakaskoneen etsimän tiedoston nimi on kuitenkin vain <filename>asiakaskoneen-ip-heksana</filename>. Helppo tapa nähdä IP-osoite heksana on kirjoittaa seuraava komento komentotulkissa (olettaen että koneelle tarkoitettu IP-osoite on 10.0.0.4). <informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> Oikean tiedoston nimen saa muuttamalla kaikki kirjaimet isoiksi ja tarvittaessa liittämällä loppuun suoritinarkkitehtuurin nimen.
pt: As Arquitecturas SPARC acrescentam nomes de sub-srquitecturas, tais como <quote>SUN4M</quote> ou <quote>SUN4C</quote>, ao nome do ficheiro. Assim, se a sub-arquitectura do seu sistema for SUN4C, e o seu IP for 192.168.1.3, o nome do ficheiros será <filename>C0A80103.SUN4C</filename>. No entanto, existem também sub-arquitecturas onde o ficheiro que o cliente procura é apenas <filename>client-ip-in-hex</filename>. Uma maneira simples de determinar o código hexadecimal para o endereço IP é introduzir o seguinte comando numa shell (assumindo que o IP pretendido para a máquina é 10.0.0.4). <informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> Para obter o nome do ficheiro correcto, necessitará de alterar todas as letras para maiúsculas e se necessário adicionar o nome da sub-arquitectura.

source: If you've done all this correctly, giving the command <userinput>boot net</userinput> from the OpenPROM should load the image. If the image cannot be found, try checking the logs on your tftp server to see which image name is being requested.
fi: Jos teit tämän kaiken oikein, pitäisi OpenPROM:ssa komennolla <userinput>boot net</userinput> saada otos ladattua. Jos otosta ei löydy, yritä tarkistaa tftp-palvelimen lokeista mitä otoksen nimeä yritetään noutaa.
pt: Se fez tudo isto correctamente, dando o comando <userinput>boot net</userinput> a partir da OpenPROM deve carregar a imagem. Se a imagem não puder ser encontrada, tente ver os logs do seu servidor tftp para ver qual o nome da imagem que está a ser pedida.

source: You can also force some sparc systems to look for a specific file name by adding it to the end of the OpenPROM boot command, such as <userinput>boot net my-sparc.image</userinput>. This must still reside in the directory that the TFTP server looks in.
fi: Joissakin sparc-järjestelmissä voidaan OpenPROM:n käynnistyskomennolla järjestelmä pakottaa käyttämään tiettyä tiedoston nimeä. Komento olisi <userinput>boot net minun-sparc.image</userinput>. Tiedoston on silti oltava hakemistossa josta TFTP-palvelin sitä etsii.
pt: Pode também forçar alguns sistemas sparc a procurar por um nome de ficheiro especifico adicionando-o no final do comando de arranque OpenPROM, tal como <userinput>boot net my-sparc.image</userinput>. Isto tem de residir no directório onde o servidor TFTP procura.

source: SGI TFTP Booting
fi: SGI:n käynnistys TFTP:llä
pt: Arrancar por TFTP em SGI

source: On SGI machines you can rely on the <command>bootpd</command> to supply the name of the TFTP file. It is given either as the <userinput>bf=</userinput> in <filename>/etc/bootptab</filename> or as the <userinput>filename=</userinput> option in <filename>/etc/dhcpd.conf</filename>.
fi: SGI:n koneilla <command>bootpd</command> noutaa TFTP-tiedoston nimen. Se annetaan joko rivillä <userinput>bf=</userinput> tiedostossa <filename>/etc/bootptab</filename> tai direktiivissä <userinput>filename=</userinput> tiedostossa <filename>/etc/dhcpd.conf</filename>.
pt: Em máquinas SGI pode confiar em <command>bootpd</command> para fornecer o nome do ficheiro TFTP. É dado seja em <userinput>bf=</userinput> <filename>/etc/bootptab</filename> ou como opção <userinput>filename=</userinput> em <filename>/etc/dhcpd.conf</filename>.

source: Automatic Installation
fi: Automaattinen asennus
pt: Instalação Automática

source: For installing on multiple computers it's possible to do fully automatic installations. &debian; packages intended for this include <classname>fai-quickstart</classname> (which can use an install server) and the &debian; Installer itself. Have a look at the <ulink url="http://fai-project.org">FAI home page</ulink> for detailed information.
pt: É possível fazer instalações totalmente automáticas para instalar em vários computadores. Os pacotes &debian; destinados a essa função incluem <classname>fai-quickstart</classname> (que utiliza um servidor de instalação), e o próprio Instalador &debian;. Para informação detalhada veja a <ulink url="http://fai-project.org">Página do FAI</ulink>.

source: Automatic Installation Using the &debian; Installer
fi: Automaattinen asennus &debian;in asentimella
pt: Instalação Automática Utilizando o Instalador &debian;

source: The &debian; Installer supports automating installs via preconfiguration files. A preconfiguration file can be loaded from the network or from removable media, and used to fill in answers to questions asked during the installation process.
fi: &debian;in asennin tukee automaattista asennusta valmiiden vastausten tiedostoilla. Valmiiden vastausten tiedosto voidaan ladata verkosta tai vaihdettavalta taltiolta, ja sillä saadaan annettua vastaukset asennusprosessin aikana kysyttyihin kysymyksiin.
pt: O Instalador &debian; suporta instalações automáticas via ficheiros de pré-configuração. Um ficheiro de pré-configuração pode ser carregado a partir da rede ou a partir de um meio amovível, e utilizado para preencher as respostas às perguntas feitas durante o processo de instalação.

source: Full documentation on preseeding including a working example that you can edit is in <xref linkend="appendix-preseed"/>.
fi: Kaikki ohjeet valmiista vastauksista mukaan lukien toimiva esimerkki jota voi muokata on <xref linkend="appendix-preseed"/>.
pt: Toda a documentação sobre a pré-configuração e um exemplo funcional que pode editar encontra-se na <xref linkend="appendix-preseed"/>.
