Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/install-methods.po
Languages: fi, pt

source: For example, when using an existing GNU/Linux system, the <filename>mini.iso</filename> file can be written to a USB stick as follows: <informalexample><screen> <prompt>#</prompt> <userinput>dd if=<replaceable>debian.iso</replaceable> of=/dev/<replaceable>sdX</replaceable></userinput> <prompt>#</prompt> <userinput>sync</userinput> </screen></informalexample> To add firmware to a USB stick prepared in this way, obtain the necessary firmware files. See <xref linkend="loading-firmware"/> for more information. Now unplug and replug the USB stick, and two partitions should now be visible on it. You should mount the second of the two partitions, and unpack the firmware onto it.
pt: Por exemplo, ao utilizar um sistema GNU/Linux existente, o ficheiro <filename>mini.iso</filename> pode ser escrito numa 'pen' USB da seguinte forma: <informalexample><screen> <prompt>#</prompt> <userinput>dd if=<replaceable>debian.iso</replaceable> of=/dev/<replaceable>sdX</replaceable></userinput> <prompt>#</prompt> <userinput>sync</userinput> </screen></informalexample> Para acrescentar firmware a uma 'pen' USB preparada desta forma, obtenha os ficheiros de firmware necessários. Veja <xref linkend="loading-firmware"/> para mais informações. De seguida retire e volte a colocar a 'pen' USB, e agora devem ser visíveis duas partições. Deve montar a segunda partição, e descompactar o firmware para lá.

source: To prepare a USB stick that installs packages from a CD image included on the stick, use the installer images found in the <filename>hd-media</filename> directory. Either the <quote>easy way</quote> or the <quote>flexible way</quote> can be used to copy the image to the USB stick. For this installation method you will also need to download a CD image. The installation image and the CD image must be based on the same release of &d-i;. If they do not match you are likely to get errors<footnote> <para> The error message that is most likely to be displayed is that no kernel modules can be found. This means that the version of the kernel module udebs included on the CD image is different from the version of the running kernel. </para> </footnote> during the installation.
pt: Para preparar uma 'pen' USB que instala pacotes a partir de uma imagem de CD incluída na 'pen', utilize as imagens do instalador que se encontram no directório <filename>hd-media</filename>. Pode ser utilizada a <quote>forma fácil</quote> ou a <quote>forma flexível</quote> para copiar a imagem para a 'pen' USB. Para este método de instalação irá necessitar também de obter uma imagem de CD. A imagem de instalação e a imagem de CD têm de ser baseadas no mesmo lançamento do &d-i;. Se não coincidirem é provável que obtenha erros <footnote> <para> A mensagem de erro mais provável que seja mostrada é que não puderam ser encontrados módulos do kernel. Isto significa que a versão dos udebs de módulos do kernel incluídos na imagem de CD são diferentes da versão do kernel em execução. </para></footnote> durante a instalação.

source: Note that the USB stick should be at least 256 MB in size (smaller setups are possible if you follow <xref linkend="usb-copy-flexible"/>).
fi: Huomaa, että USB-muistin olisi oltava kooltaan vähintään 256 Mt (pienempikin koko riittää jos noudatat ohjetta <xref linkend="usb-copy-flexible"/>).
pt: Note que o stick USB deverá ter no mínimo 256 MB de tamanho (são possíveis configurações mais pequenas se seguir a <xref linkend="usb-copy-flexible"/>).

source: Copying the files &mdash; the easy way
fi: Tiedostojen kopiointi &mdash; helppo tapa
pt: Copiar ficheiros &mdash; a maneira simples

source: There is an all-in-one file <filename>hd-media/boot.img.gz</filename> which contains all the installer files (including the kernel) <phrase arch="x86">as well as <classname>syslinux</classname> and its configuration file</phrase> <phrase arch="powerpc">as well as <classname>yaboot</classname> and its configuration file</phrase>.
pt: Existe um ficheiro tudo-em-um <filename>hd-media/boot.img.gz</filename> que contém todos os ficheiros do instalador (incluindo o kernel) <phrase arch="x86">assim como o <classname>syslinux</classname> e o seu ficheiro de configuração</phrase> <phrase arch="powerpc">assim como o <classname>yaboot</classname> e o seu ficheiro de configuração.</phrase>

source: Note that, although convenient, this method does have one major disadvantage: the logical size of the device will be limited to 256 MB, even if the capacity of the USB stick is larger. You will need to repartition the USB stick and create new file systems to get its full capacity back if you ever want to use it for some different purpose. A second disadvantage is that you cannot copy a full CD image onto the USB stick, but only the smaller businesscard or netinst CD images.
fi: Vaikka tämä tapa on mukava, kannattaa huomata sen vakava haitta: laitteen looginen koko rajoitetaan 256 Mtavuun, vaikka USB-muisti olisi suurempi. USB-muistille on tehtävä uudet osiot ja uudet tiedostojärjestelmät jotta sen täysi koko saadaan taas käyttöön jos sitä joskus halutaan käyttää johonkin muuhun. Toinen haitta on ettei USB-muistille voi kopioida täyttä romppuotosta, ainoastaan pienemmän businesscard- tai netinst-otoksen.
pt: Note que, embora conveniente, este método tem uma grande desvantagem: o volume lógico do dispositivo será limitado a 256 MB, mesmo que a capacidade da 'pen' USB seja maior. Terá de reparticionar a 'pen' USB e criar sistema de ficheiros novos para obter novamente toda a capacidade se alguma vez a quiser utilizar para um propósito diferente. A segunda desvantagem é que não pode copiar uma imagem de CD completa para a 'pen' USB, mas apenas as imagens de CD mais pequenas businesscard ou netinst.

source: To use this image simply extract it directly to your USB stick:
fi: Jos käytät tätä otosta, riittää purkaa se sellaisenaan USB-muistille:
pt: Para utilizar esta imagem simplesmente extraia-a directamente para a sua 'pen' USB:

source: Create a partition of type "Apple_Bootstrap" on your USB stick using <command>mac-fdisk</command>'s <userinput>C</userinput> command and extract the image directly to that:
fi: Luo tyyppiä "Apple_Bootstrap" oleva osio USB-muistille komennon <command>mac-fdisk</command> komennolla <userinput>C</userinput> ja pura otos suoraan siihen:
pt: Crie uma partição do tipo "Apple_Bootstrap" na sua 'pen' USB utilizando o comando <userinput>C</userinput> do <command>mac-fdisk</command> e extraia a imagem directamente para lá:

source: After that, mount the USB memory stick <phrase arch="x86">(<userinput>mount /dev/<replaceable>sdX</replaceable> /mnt</userinput>),</phrase> <phrase arch="powerpc">(<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>),</phrase> which will now have <phrase arch="x86">a FAT filesystem</phrase> <phrase arch="powerpc">an HFS filesystem</phrase> on it, and copy a &debian; netinst or businesscard ISO image to it. Unmount the stick (<userinput>umount /mnt</userinput>) and you are done.
fi: Tämän jälkeen liitetään USB-muisti <phrase arch="x86">(<userinput>mount <replaceable>/dev/sdX</replaceable> /mnt</userinput>),</phrase> <phrase arch="powerpc">(<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>),</phrase> jossa on nyt <phrase arch="x86">FAT-tiedostojärjestelmä</phrase> <phrase arch="powerpc">HFS-tiedostojärjestelmä</phrase>, ja kopioidaan &debian;in netinst tai businesscard ISO-otos siihen. Irrota muisti (<userinput>umount /mnt</userinput>) ja homma on valmis.
pt: Depois disso, monte a 'pen' USB <phrase arch="x86">(<userinput>mount /dev/<replaceable>sdX</replaceable> /mnt</userinput>,</phrase> <phrase arch="powerpc">(<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>),</phrase> que terá agora <phrase arch="x86">um sistema de ficheiros FAT</phrase> <phrase arch="powerpc">um sistema de ficheiros HFS</phrase>, e copie para lá uma imagem ISO &debian; netinst ou businesscard. Desmonte a 'pen' (<userinput>umount /mnt</userinput>) e pronto está feito.

source: Copying the files &mdash; the flexible way
fi: Tiedostojen kopiointi &mdash; joustava tapa
pt: Copiar ficheiros &mdash; da maneira flexível

source: If you like more flexibility or just want to know what's going on, you should use the following method to put the files on your stick. One advantage of using this method is that &mdash; if the capacity of your USB stick is large enough &mdash; you have the option of copying a full CD ISO image to it.
fi: Jos USB-muistin sisältöä halutaan muokata tai halutaan tietää tarkemmin mitä tapahtuu, olisi tiedostot kopioitava muistille seuraavalla tavalla. Tämän tavan eräs etu on &mdash; mikäli USB-muisti on riittävän suuri&mdash; mahdollisuus kopioida kokonainen CD-levyn ISO-otos sille.
pt: Se você gostar de mais flexibilidade ou se apenas quiser saber o que se está a passar, pode utilizar o seguinte método para colocar os ficheiros na sua 'pen'. Uma vantagem deste método é que &mdash; se a capacidade da sua 'pen' USB tiver espaço suficiente &mdash; tem a opção de copiar uma imagem ISO completa de CD para lá.

source: Partitioning the USB stick
fi: Osioiden teko USB-muistille
pt: Particionar a 'pen' USB

source: We will show how to set up the memory stick to use the first partition, instead of the entire device.
fi: Nyt näytetään miten käytetään USB-muistin ensimmäistä osiota eikä koko muistia.
pt: Iremos demonstrar como preparar o memory stick para utilizar a primeira partição, em vez de todo o dispositivo.

source: Since most USB sticks come pre-configured with a single FAT16 partition, you probably won't have to repartition or reformat the stick. If you have to do that anyway, use <command>cfdisk</command> or any other partitioning tool to create a FAT16 partition<footnote> <para> Don't forget to set the <quote>bootable</quote> bootable flag. </para> </footnote>, and then create the filesystem using: <informalexample><screen> # mkdosfs /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Take care that you use the correct device name for your USB stick. The <command>mkdosfs</command> command is contained in the <classname>dosfstools</classname> &debian; package.
fi: Koska useimmissa USB-muisteissa on tehtaan jäljiltä yksi FAT16-osio, ei liene tarpeen tehdä osioita uudestaan tai formatoida muistia. Jos niin kuitenkin on tehtävä, tee FAT16-osio komennolla <command>cfdisk</command> tai millä tahansa osiointityökalulla<footnote><para>Muista tehdä osiosta bootable.</para></footnote>, ja luo osiolle sitten tiedostojärjestelmä seuraavasti:<informalexample><screen> # mkdosfs /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Varmistu käyttäväsi USB-muistin oikeaa laitenimeä. Komento <command>mkdosfs</command> sisältyy &debian;in pakettiin <classname>dosfstools</classname>.
pt: Dado que a maioria das 'pens' USB vêm preconfiguradas com uma única partição FAT16, provavelmente não terá de reparticionar ou reformatar a 'pen'. Se de qualquer forma tiver de o fazer, utilize o <command>cfdisk</command> ou qualquer outra ferramenta de particionamento para criar uma partição FAT16<footnote> <para> Não se esqueça de definir a flag de arranque <quote>bootable</quote>. </para> </footnote> e depois criar o sistema de ficheiros utilizando: <informalexample><screen> # mkdosfs /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Certifique-se de que utiliza o nome correcto do dispositivo para a sua 'pen' USB. O comando <command>mkdosfs</command> está no pacote &debian; <classname>dosfstools</classname>.

source: In order to start the kernel after booting from the USB stick, we will put a boot loader on the stick. Although any boot loader (e.g. <classname>lilo</classname>) should work, it's convenient to use <classname>syslinux</classname>, since it uses a FAT16 partition and can be reconfigured by just editing a text file. Any operating system which supports the FAT file system can be used to make changes to the configuration of the boot loader.
fi: Ytimen käynnistämiseksi USB-muistilta käynnistettäessä tallennetaan muistille käynnistyslatain. Vaikkakin minkä tahansa käynnistyslataimen (esim. <classname>LILO</classname>) pitäisi toimia, on kätevintä käyttää <classname>SYSLINUX</classname>:ia, koska se käyttää FAT16-osiota ja sen asetuksia voidaan muuttaa tekstiedostoa muokkaamalla. Mitä tahansa FAT-tiedostojärjestelmää tukevaa käyttöjärjestelmää voidaan käyttää käynnistyslataimen asetustiedoston muuttamiseen.
pt: Com o intuito de iniciar o kernel após arrancar a partir da 'pen' USB, nós iremos colocar o gestor de arranque na 'pen'. Apesar de qualquer gestor de arranque deva funcionar (por exemplo o <command>lilo</command>), é conveniente utilizar o <command>syslinux</command>, dado que utiliza uma partição FAT16 e pode ser reconfigurado apenas editando um ficheiro de texto. Qualquer sistema operativo que suporte um sistema de ficheiros FAT pode ser utilizado para fazer alterações à configuração do gestor de arranque.

source: To put <classname>syslinux</classname> on the FAT16 partition on your USB stick, install the <classname>syslinux</classname> and <classname>mtools</classname> packages on your system, and do: <informalexample><screen> # syslinux /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Again, take care that you use the correct device name. The partition must not be mounted when starting <command>syslinux</command>. This procedure writes a boot sector to the partition and creates the file <filename>ldlinux.sys</filename> which contains the boot loader code.
fi: <classname>SYSLINUX</classname> saadaan tallennettua FAT16-osioon USB-muistille asentamalla paketit <classname>syslinux</classname> ja <classname>mtools</classname> järjestelmään, ja antamalla komento: <informalexample><screen> # syslinux /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Tarkista taas huolellisesti, että laitenimi on oikein. Osio ei saa olla liitettynä kun <classname>SYSLINUX</classname> käynnistetään. Komento kirjoittaa osioon käynnistyssektorin ja luo tiedoston <filename>ldlinux.sys</filename>, jossa on käynnistyslataimen koodi.
pt: Para colocar o <command>syslinux</command> na partição FAT16 da sua 'pen' USB, instale os pacotes <classname>syslinux</classname> e <classname>mtools</classname> no seu sistema, e faça: <informalexample><screen> # syslinux /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Mais uma vez certifique-se de que utiliza o nome correcto do dispositivo. A partição não pode estar montada quando iniciar o <command>syslinux</command>. Este procedimento escreve um sector de arranque para a partição e cria o ficheiro <filename>ldlinux.sys</filename> que contém o código do gestor de arranque.

source: Adding the installer image
fi: Asentimen levyotoksen lisääminen
pt: Acrescentar a imagem do instalador

source: Mount the partition (<userinput>mount /dev/<replaceable>sdX1</replaceable> /mnt</userinput>) and copy the following installer image files to the stick: <itemizedlist> <listitem><para> <filename>vmlinuz</filename> or <filename>linux</filename> (kernel binary) </para></listitem> <listitem><para> <filename>initrd.gz</filename> (initial ramdisk image) </para></listitem> </itemizedlist> You can choose between either the regular version or the graphical version of the installer. The latter can be found in the <filename>gtk</filename> subdirectory. If you want to rename the files, please note that <classname>syslinux</classname> can only process DOS (8.3) file names.
fi: Liitä osio (<userinput>mount /dev/<replaceable>sdX1</replaceable> /mnt</userinput>) ja kopioi seuraavat tiedostot &debian;in asennuspalvelimelta muistille: <itemizedlist> <listitem><para> <filename>vmlinuz</filename> tai <filename>linux</filename> (ytimen ohjelmatiedosto) </para></listitem> <listitem><para> <filename>initrd.gz</filename> (käynnistysmuistilevyn levyotos) </para></listitem> </itemizedlist> Asennin on valittavissa tavallisena tai graafisen käyttöliittymän kera. Jälkimmäinen on alihakemistossa <filename>gtk</filename>. Jos tiedostojen nimiä halutaan muuttaa, on huomattava ettei <classname>syslinux</classname> osaa käsitellä muita kuin DOS:n (8.3) tiedostonimiä.
pt: Monte a partição (<userinput>mount /dev/<replaceable>sdX1</replaceable> /mnt</userinput>) e copie os seguintes ficheiros de imagens para a 'pen': <itemizedlist> <listitem><para> <filename>vmlinuz</filename> ou <filename>linux</filename> (binário do kernel) </para></listitem> <listitem><para> <filename>initrd.gz</filename> (imagem ramdisk inicial) </para></listitem> </itemizedlist> Pode escolher entre a versão normal ou a versão gráfica do instalador. A última pode ser encontrada no directório <filename>gtk</filename>. Se quiser renomear os ficheiros, tenha atenção que o <command>syslinux</command> apenas consegue processar nomes de ficheiros DOS (8.3).

source: Next you should create a <filename>syslinux.cfg</filename> configuration file, which at a bare minimum should contain the following two lines (change the name of the kernel binary to <quote><filename>linux</filename></quote> if you used a <filename>netboot</filename> image): <informalexample><screen> default vmlinuz append initrd=initrd.gz </screen></informalexample> For the graphical installer you should add <userinput>vga=788</userinput> to the second line.
fi: Seuraavaksi olisi tehtävä asetustiedosto <filename>syslinux.cfg</filename>, jossa yksinkertaisimmillaan on seuraavat kaksi riviä (muuta ytimen ohjelmatiedoston nimeksi <quote><filename>linux</filename></quote> jos käytit <filename>netboot</filename>-otosta): <informalexample><screen> default vmlinuz append initrd=initrd.gz </screen></informalexample> Asentimen graafista käyttöliittymää varten olisi toiseen riviin lisättävä <userinput>vga=788</userinput>.
pt: De seguida deverá criar um ficheiro de configuração <filename>syslinux.cfg</filename> o qual, no mínimo, deve conter as seguintes duas linhas (mude o nome do binário do kernel para <quote><filename>linux</filename></quote> se utilizou uma imagem <filename>netboot</filename>): <informalexample><screen> default vmlinuz append initrd=initrd.gz </screen></informalexample> Para o instalador gráfico deve acrescentar <userinput>vga=788</userinput> na segunda linha.

source: If you used an <filename>hd-media</filename> image, you should now copy a &debian; ISO image<footnote> <para> You can use either a businesscard, a netinst or a full CD image (see <xref linkend="official-cdrom"/>). Be sure to select one that fits. Note that the <quote>netboot <filename>mini.iso</filename></quote> image is not usable for this purpose. </para> </footnote> onto the stick. When you are done, unmount the USB memory stick (<userinput>umount /mnt</userinput>).
fi: Jos käytit <filename>hd-media</filename>-otosta, on nyt kopioitava &debian;in ISO-otos<footnote> <para> voidaan käyttää joko businesscard, netinst tai täyttä CD-otosta (katso <xref linkend="official-cdrom"/>. Varmista valitsevasi se mikä mahtuu muistille. Huomaa ettei <quote>netboot <filename>mini.iso</filename></quote> -otos sovi tähän tarkoitukseen. </para> </footnote> tikulle. Kun tämä on valmista, irroita USB-muisti (<userinput>umount /mnt</userinput>).
pt: Se utilizou uma imagem <filename>hd-media</filename>, deve agora copiar uma imagem ISO &debian;<footnote> <para> Pode utilizar uma imagem de CD businesscard, netinst ou completa (veja <xref linkend="official-cdrom"/>). Assegure-se que escolhe uma que caiba. Tenha em conta que a imagem <quote>netboot <filename>mini.iso</filename></quote> não é utilizável para este propósito. </para> </footnote> para a 'pen'. Quando terminar, desmonte a 'pen' USB (<userinput>umount /mnt</userinput>).

source: Most USB sticks do not come pre-configured in such a way that Open Firmware can boot from them, so you will need to repartition the stick. On Mac systems, run <userinput>mac-fdisk /dev/<replaceable>sdX</replaceable></userinput>, initialise a new partition map using the <userinput>i</userinput> command, and create a new partition of type Apple_Bootstrap using the <userinput>C</userinput> command. (Note that the first "partition" will always be the partition map itself.) Then type <informalexample><screen> $ hformat /dev/<replaceable>sdX2</replaceable> </screen></informalexample> Take care that you use the correct device name for your USB stick. The <command>hformat</command> command is contained in the <classname>hfsutils</classname> &debian; package.
fi: Useimmat USB-muistit eivät tehtaan jäljiltä ole sellaisia että Open Firmware osaisi käynnistää niiltä, joten muistille on tehtävä uudet osiot. Mac-järjestelmillä käytetään komentoa <userinput>mac-fdisk /dev/<replaceable>sdX</replaceable></userinput>, tehdään uusi osiotaulu komennolla <userinput>i</userinput>, ja luodaan uusi osio tyypiltään Apple_Bootstrap komennolla <userinput>C</userinput>. (Huomaa, että ensimmäinen "osio" on aina osiotaulu itse.) Kirjoita sitten <informalexample><screen> $ hformat /dev/<replaceable>sdX2</replaceable> </screen></informalexample> Varmista käyttäväsi oikeaa laitenimä USB-muistille. Komento <command>hformat</command> on &debian;in paketissa <classname>hfsutils</classname>.
pt: A maioria das 'pens' USB não vêm configurados de forma a que o Open Firmware possa arrancar a partir delas, por isso vai necessitar de reparticionar a 'pen'. Em sistemas Mac, execute <userinput>mac-fdisk /dev/<replaceable>sdX</replaceable></userinput>, inicialize um novo mapa de partição utilizando o comando <userinput>i</userinput>, e crie uma nova partição do tipo Apple_Bootstrap utilizando o comando <userinput>C</userinput>. (Note que a primeira "partição" irá sempre ser o próprio mapa de partições.) Depois digite <informalexample><screen> $ hformat /dev/<replaceable>sdX2</replaceable> </screen></informalexample> Certifique-se de que utiliza o nome correcto da sua 'pen' USB. O comando <command>hformat</command> está contido no pacote &debian; <classname>hfsutils</classname>.

source: In order to start the kernel after booting from the USB stick, we will put a boot loader on the stick. The <command>yaboot</command> boot loader can be installed on an HFS filesystem and can be reconfigured by just editing a text file. Any operating system which supports the HFS file system can be used to make changes to the configuration of the boot loader.
fi: Ytimen käynnistämiseksi USB-muistilta käynnistettäessä tallennetaan muistille käynnistyslatain. Käynnistyslatain <command>yaboot</command> voidaan asentaa HFS-tiedostojärjestelmään ja sen asetuksia voidaan muuttaa tekstitiedostoa muokkaamalla. Mitä tahansa HFS-tiedostojärjestelmää tukevaa käyttöjärjestelmää voidaan käyttää käynnistyslataimen asetustiedoston muuttamiseen.
pt: Com o intuito de iniciar o kernel após arrancar de stick USB, nós iremos colocar um gestor de arranque no stick. O gestor de arranque <command>yaboot</command> pode ser instalado no sistema de ficheiros HFS e pode ser reconfigurado apenas editando um ficheiro de texto. Qualquer sistema operativo que suporte um sistema de ficheiros HFS pode ser utilizado para fazer alterações à configuração do gestor de arranque.
