Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/install-methods.po
Languages: fi, pt

source: To write the floppy disk image files to the floppy disks, you will probably need root access to the system. Place a good, blank floppy in the floppy drive. Next, use the command <informalexample><screen> $ dd if=<replaceable>filename</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample> where <replaceable>filename</replaceable> is one of the floppy disk image files. <filename>/dev/fd0</filename> is a commonly used name of the floppy disk device, it may be different on your workstation<phrase arch="sparc"> (on Solaris, it is <filename>/dev/fd/0</filename>)</phrase>. The command may return to the prompt before Unix has finished writing the floppy disk, so look for the disk-in-use light on the floppy drive and be sure that the light is out and the disk has stopped revolving before you remove it from the drive. On some systems, you'll have to run a command to eject the floppy from the drive <phrase arch="sparc"> (on Solaris, use <command>eject</command>, see the manual page)</phrase>.
fi: Jotta levyotostiedostoja voisi kirjoittaa levykkeille, tarvitaan luultavasti pääkäyttäjän oikeudet järjestelmään. Aseta hyvä tyhjä levyke levykeasemaan. Käytä seuraavaksi komentoa <informalexample><screen> $ dd if=<replaceable>tiedostonnimi</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample> missä <replaceable>tiedostonnimi</replaceable> on jokin levyotostiedostoista. <filename>/dev/fd0</filename> on yleinen levykeaseman laitenimi, se saattaa olla jotain muuta työasemallasi <phrase arch="sparc">(Solariksessa se on <filename>/dev/fd/0</filename>)</phrase>. Komento saattaa palata kehoitteeseen ennen kuin Unix on kirjoittanut levykkeen lopppuun asti, joten tarkkaile levykeaseman merkkivaloa ja varmistu valon sammuneen ja levykkeen lakanneen pyörimästä ennen kuin poistat sen asemasta. Joissakin järjestelmissä on käytettävä komentoa, joka työntää levykkeen ulos asemasta <phrase arch="sparc">(Solariksessa käytetään komentoa <command>eject</command>, katso man-sivua)</phrase>.
pt: Para escrever os ficheiros de imagem de disquete para as disquetes, você provavelmente necessitará de aceder ao sistema como root. Coloque uma disquete vazia em boas condições na drive de disquetes. De seguida, utilize o comando <informalexample><screen> $ dd if=<replaceable>ficheiro</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample> onde <replaceable>ficheiro</replaceable> é um dos ficheiros da imagem de disquete. <filename>/dev/fd0</filename> é o nome normalmente utilizado para o dispositivo de disquetes, poderá ser diferente na sua máquina <phrase arch="sparc">(em Solaris, é <filename>/dev/fd/0</filename>)</phrase>. O comando pode voltar à linha de comandos antes do Unix ter terminado de escrever na disquete, verifique se a luz de disquete em utilização na drive de disquetes está apagada e se o disco parou antes de remover a disquete da drive. Em alguns sistemas, terá de executar um comando para ejectar a disquete <phrase arch="sparc">(em Solaris, utilize <command>eject</command>, veja a página do manual)</phrase>.

source: Some systems attempt to automatically mount a floppy disk when you place it in the drive. You might have to disable this feature before the workstation will allow you to write a floppy in <emphasis>raw mode</emphasis>. Unfortunately, how to accomplish this will vary based on your operating system. <phrase arch="sparc"> On Solaris, you can work around volume management to get raw access to the floppy. First, make sure that the floppy is auto-mounted (using <command>volcheck</command> or the equivalent command in the file manager). Then use a <command>dd</command> command of the form given above, just replace <filename>/dev/fd0</filename> with <filename>/vol/rdsk/<replaceable>floppy_name</replaceable></filename>, where <replaceable>floppy_name</replaceable> is the name the floppy disk was given when it was formatted (unnamed floppies default to the name <filename>unnamed_floppy</filename>). On other systems, ask your system administrator. </phrase>
fi: Jotkin järjestelmät yrittävät liittää levykkeen automaattisesti kun se asetetaan asemaan. Tämä ominaisuus on ehkä otettava pois käytöstä ennen kuin työasema sallii levykkeen kirjoittamisen <emphasis>käsittelemättömässä</emphasis> muodossa. Harmittavasti on käyttöjärjestelmäkohtaista miten tämä saadaan pois käytöstä. <phrase arch="sparc"> Solariksesssa voidaan volume management kiertää ja päästä siten käyttämään levykeasemaa suoraan. Varmikstu ensin levykeen olevan liitetty automaattisesti (komennolla <command>volcheck</command> tai tiedostojenhallinnan vastaavalla toiminnolla). Käytä sitten komentoa <command>dd</command> kuten yllä, mutta <filename>/dev/fd0</filename> tilalle kirjoitetaan <filename>/vol/rdsk/<replaceable>levykkeen_nimi</replaceable></filename>, missä <replaceable>levykkeen_nimi</replaceable> on se nimi joka levykkeelle annettiin kun se alustettiin (nimeämättömän levykkeen nimeksi tulee <filename>unnamed_floppy</filename>). Muiden järjestelmien käyttäjien on parasta kysyä järjestelmän ylläpitäjältä.</phrase>
pt: Alguns sistemas tentam automaticamente montar a disquete quando esta é colocada na drive. Você poderá ter de desactivar esta característica antes da máquina permitir efectuar a gravação da disquete em <emphasis>modo raw</emphasis>. Infelizmente, isto poderá variar consoante o sistema operativo. <phrase arch="sparc">No Solaris, você poderá encontrar uma maneira de conseguir acesso raw à disquete na gestão de volumes. Primeiro, certifique-se que a disquete é automaticamente montada (utilizando <command>volcheck</command> ou um comando equivalente no gestor de ficheiros). Execute então o comando <command>dd</command> da forma dada acima, substitua somente <filename>/dev/fd0</filename> por <filename>/vol/rdsk/<replaceable>nome da disquete</replaceable></filename>, onde <replaceable>nome da disquete</replaceable> é o nome dado à disquete na altura da sua formatação (o nome por omissão das disquetes é <filename>unnamed_floppy</filename>). Noutros sistemas, pergunte ao seu administrador de sistema. </phrase>

source: If writing a floppy on powerpc Linux, you will need to eject it. The <command>eject</command> program handles this nicely; you might need to install it.
fi: Jos kirjoitetaan levyke powerpc-Linuxilla, se on poistettava asemasta. Ohjelma <command>eject</command> tekee sen mukavasti; ohjelma on ehkä asennettava.
pt: Se está a escrever nas disquetes num Linux em powerpc, necessitará de as ejectar. O programa <command>eject</command> é o apropriado; você pode ter de o instalar.

source: Writing Disk Images From DOS, Windows, or OS/2
fi: Levyotosten kirjoittaminen DOS:ssa, Windowsissa tai OS/2:ssa
pt: Escrever Imagens de Disco a partir de DOS, Windows, ou OS/2

source: If you have access to an i386 or amd64 machine, you can use one of the following programs to copy images to floppies.
fi: Jos käytettävissä on i386- tai amd64-kone, voidaan otokset kirjoittaa levykkeille seuraavilla ohjelmilla.
pt: Se você tem acesso a uma máquina i386 ou amd64, pode utilizar um dos seguintes programas para copiar imagens para disquetes.

source: The <command>rawrite1</command> and <command>rawrite2</command> programs can be used under MS-DOS. To use these programs, first make sure that you are booted into DOS. Trying to use these programs from within a DOS box in Windows, or double-clicking on these programs from the Windows Explorer is <emphasis>not</emphasis> expected to work.
fi: Ohjelmia <command>rawrite1</command> ja <command>rawrite2</command> voidaan käyttää MS-DOS:ssa. Ohjelmia käytettäessä on ensin varmistuttava, että on käynnistetty DOS. Ohjelmien <emphasis>ei pitäisikään</emphasis> toimia Windowsin DOS-ikkunassa tai kaksoisnapsauttamalla niitä Windowsin tiedostoselaimessa.
pt: Os programas <command>rawrite1</command> e <command>rawrite2</command> podem ser utilizados em MS-DOS. <emphasis>Não</emphasis> é esperado que funcionem se tentar utilizar estes programas numa consola DOS no Windows ou fazendo duplo-click a partir do Explorador do Windows.

source: The <command>rwwrtwin</command> program runs on Windows 95, NT, 98, 2000, ME, XP and probably later versions. To use it you will need to unpack diskio.dll in the same directory.
fi: Ohjelma <command>rwwrtwin</command> toimii Windowseissa 95, NT, 98, 2000, ME, XP ja luultavasti uudemmissa versioissa. Sitä käytettäessä on diskio.dll purettava samaan hakemistoon.
pt: O programa <command>rwwrtwin</command> corre em Windows 95, NT, 98, 2000, ME, XP e provavelmente em versões posteriores. Para o utilizar terá de descompactar diskio.dll no mesmo directório.

source: These tools can be found on the Official &debian; CD-ROMs under the <filename>/tools</filename> directory.
fi: Nämä työkalut löytyvät virallisilta &debian;-rompuilta hakemistosta <filename>/tools</filename>.
pt: Estes utilitários podem ser encontrados nos CD-ROMs Oficiais de &debian; no directório <filename>/tools</filename>.

source: Writing Disk Images From MacOS
fi: Levykeotosten kirjoittaminen MacOS:ssä
pt: Escrever Imagens de Disco a partir de MacOS

source: An AppleScript, <application>Make &debian; Floppy</application>, is available for burning floppies from the provided disk image files. It can be downloaded from <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/d/de/debian-imac/MakeDebianFloppy.sit"></ulink>. To use it, just unstuff it on your desktop, and then drag any floppy image file to it. You must have Applescript installed and enabled in your extensions manager. Disk Copy will ask you to confirm that you wish to erase the floppy and proceed to write the file image to it.
fi: Saatavilla on AppleScript-sovellus, <application>Make Debian Floppy</application>, kirjoittamaan levykkeitä annetuista levykeotostiedostoista. Se voidaan noutaa osoitteesta <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/d/de/debian-imac/MakeDebianFloppy.sit"></ulink>. Sitä käytetään purkamalla (unstuff) se työpöydälle. Sitten levykeotostiedosto vedetään sen kuvakkeeseen. Applescriptin on oltava asennettuna ja merkittynä käyttöön extensions managerissa. Disk Copy pyytää varmistusta levykkeen pyyhkimiseen ja levykeotostiedoston kirjoittamiseen.
pt: Está disponível um AppleScript, <application>Make Debian Floppy</application>, para gravar disquetes a partir dos ficheiros de imagens de disco fornecidos. Poderá ser efectuado o download a partir <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/d/de/debian-imac/MakeDebianFloppy.sit"></ulink>. Para utilizar, basta descompactar para o ambiente de trabalho, e então arrastar para cima qualquer ficheiro de imagem de disquete. Tem de ter o Applescript instalado e disponibilizado no gestor de extensões. Disk Copy irá solicitar confirmação para apagar a disquete e continuar com a gravação da imagem para lá.

source: You can also use the MacOS utility <command>Disk Copy</command> directly, or the freeware utility <command>suntar</command>. The <filename>root.bin</filename> file is an example of a floppy image. Use one of the following methods to create a floppy from the floppy image with these utilities.
fi: Voidaan käyttää myös suoraan MacOS:n apuohjelmaa <command>Disk Copy</command>, tai ilmaisohjelmaa <command>suntar</command>. Tiedosto <filename>root.bin</filename> on esimerkki levykeotoksesta. Tee levyke levykeotoksesta jollain seuraavista tavoista näillä apuohjelmilla.
pt: Você pode também utilizar directamente o utilitário <command>Disk Copy</command> do MacOS, ou o <command>suntar</command> que é um utilitário livre. O ficheiro <filename>root.bin</filename> é um exemplo de uma imagem de disquete. Utilize um dos seguintes métodos para criar uma disquete a partir da imagem de disquetes com estes utilitários.

source: Writing Disk Images with <command>Disk Copy</command>
fi: Levykeotosten kirjoittaminen apuohjelmalla <command>Disk Copy</command>
pt: Escrever Imagens de Disco com <command>Disk Copy</command>

source: If you are creating the floppy image from files which were originally on the official &debian-gnu; CD, then the Type and Creator are already set correctly. The following <command>Creator-Changer</command> steps are only necessary if you downloaded the image files from a &debian; mirror.
fi: Jos levykeotos luodaan tiedostoista jotka olivat alunperin virallisisilla &debian-gnu; -rompuilla, on kentillä Type ja Creator jo oikea arvo. Seuraavat <command>Creator-Changer</command>-vaiheet ovat tarpeen vain jos otostiedostot noudettiin &debian;in asennuspalvelimelta.
pt: Se está a criar as imagens de disquetes a partir de ficheiros que estavam originalmente no CD oficial &debian-gnu;, então o Type e Creator já estão definidos correctamente. Os seguintes passos, <command>Creator-Changer</command> apenas são necessários se fez o download da imagem a partir de um mirror &debian;.

source: Obtain <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink> and use it to open the <filename>root.bin</filename> file.
fi: Hanki <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink> ja avaa sillä tiedosto <filename>root.bin</filename>.
pt: Obtenha <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink> e utilize-o para abrir o ficheiro <filename>root.bin</filename>.

source: Change the Creator to <userinput>ddsk</userinput> (Disk Copy), and the Type to <userinput>DDim</userinput> (binary floppy image). The case is sensitive for these fields.
fi: Muuta kenttään Creator arvo <userinput>ddsk</userinput> (Disk Copy), ja kenttään Type arvo <userinput>DDim</userinput> (binary floppy image). Nämä kentät ovat aakkoslajit erottavia.
pt: Alterar o Creator para <userinput>ddsk</userinput> (Disk Copy), e o Type para <userinput>DDim</userinput> (imagem binária de disquete). Estes campos são sensíveis à capitalização.

source: <emphasis>Important:</emphasis> In the Finder, use <userinput>Get Info</userinput> to display the Finder information about the floppy image, and <quote>X</quote> the <userinput>File Locked</userinput> check box so that MacOS will be unable to remove the boot blocks if the image is accidentally mounted.
fi: <emphasis>Tärkeää:</emphasis> Käytä Finderissa <userinput>Get Info</userinput>:a näyttämään Finderin tiedot levykeotoksesta, ja pistä <quote>X</quote> valintaruutuun <userinput>File Locked</userinput>, jotta MacOs ei voi poistaa käynnistyslohkoja jos otos vahingossa liitetään.
pt: <emphasis>Importante:</emphasis> No Finder, use <userinput>Get Info</userinput> para expor a informação sobre a imagem de disquete encontrada pelo Finder, e marque com <quote>X</quote> a check box <userinput>File Locked</userinput> para que o MacOS fique impossibilitado de remover os blocos de arranque se a imagem for acidentalmente montada.

source: Obtain <command>Disk Copy</command>; if you have a MacOS system or CD it will very likely be there already, otherwise try <ulink url="&url-powerpc-diskcopy;"></ulink>.
fi: Hanki <command>Disk Copy</command>; jos käytössä on MacOS-järjestelmä tai MacOS-romppu, sovellus luultavasti on jo käytettävissä, muussa tapauksessa etsi osoitteesta <ulink url="&url-powerpc-diskcopy;"></ulink>.
pt: Obtenha <command>Disk Copy</command>; se tem um sistema MacOS ou CD é muito provável que já lá esteja, caso contrário tente em <ulink url="&url-powerpc-diskcopy;"></ulink>.

source: Run <command>Disk Copy</command>, and select <menuchoice> <guimenu>Utilities</guimenu> <guimenuitem>Make a Floppy</guimenuitem> </menuchoice>, then select the <emphasis>locked</emphasis> image file from the resulting dialog. It will ask you to insert a floppy, then ask if you really want to erase it. When done it should eject the floppy.
fi: Käynnistä <command>Disk Copy</command>, ja valitse <menuchoice> <guimenu>Utilities</guimenu> <guimenuitem>Make a Floppy</guimenuitem> </menuchoice>. Valitse sitten <emphasis>locked</emphasis> otostiedosto valintaikkunassa. Se pyytää asettamaan levykkeen asemaan, sitten varmistusta levykkeen pyyhkimiselle. Kun on valmista pitäisi sen työntää levyke ulos.
pt: Execute <command>Disk Copy</command>, e seleccione <menuchoice> <guimenu>Utilities</guimenu> <guimenuitem>Make a Floppy</guimenuitem> </menuchoice>, e depois seleccione o ficheiro da imagem <emphasis>locked</emphasis>. Ser-lhe-á pedido que insira uma disquete, em seguida ser-lhe-á perguntado se quer mesmo apagá-la. Quando terminado a disquete deverá ser ejectada.

source: Writing Disk Images with <command>suntar</command>
fi: Levykeotosten kirjoittaminen komennolla <command>suntar</command>
pt: Escrever Imagens de Disco com <command>suntar</command>

source: Obtain <command>suntar</command> from <ulink url="&url-powerpc-suntar;"> </ulink>. Start the <command>suntar</command> program and select <quote>Overwrite Sectors...</quote> from the <userinput>Special</userinput> menu.
fi: Hanki <command>suntar</command> osoitteesta <ulink url="&url-powerpc-suntar;"> </ulink>. Käynnistä ohjelma <command>suntar</command> ja valitse <quote>Overwrite Sectors...</quote> valikosta <userinput>Special</userinput>.
pt: Obtenha <command>suntar</command> em <ulink url="&url-powerpc-suntar;"> </ulink>. Inicie o programa <command>suntar</command> e seleccione <quote>Overwrite Sectors...</quote> do menu <userinput>Special</userinput>.

source: Insert the floppy disk as requested, then hit &enterkey; (start at sector 0).
fi: Aseta levyke asemaan pyynnön mukaan, paina sitten &enterkey; (aloita sektorista 0).
pt: Insira a disquete conforme pedido, pressione a tecla &enterkey; (Começar no sector 0).

source: Select the <filename>root.bin</filename> file in the file-opening dialog.
fi: Valitse tiedosto <filename>root.bin</filename> tiedostonavausvalintaikkunassa.
pt: Seleccione o ficheiro <filename>root.bin</filename> na caixa de diálogo de abertura de ficheiro.

source: After the floppy has been created successfully, select <menuchoice> <guimenu>File</guimenu> <guimenuitem>Eject</guimenuitem> </menuchoice>. If there are any errors writing the floppy, simply toss that floppy and try another.
fi: Kun levyke on onnistuttu luomaan, valitaan <menuchoice> <guimenu>File</guimenu> <guimenuitem>Eject</guimenuitem> </menuchoice>. Mikäli levykettä kirjoitettaessa tulee virheitä, heitä levyke roskiin ja yritä toisella levykkeellä.
pt: Depois da disquete ser criada com sucesso, seleccione <menuchoice> <guimenu>File</guimenu> <guimenuitem>Eject</guimenuitem> </menuchoice>. Se existirem quaisquer erros durante a escrita na disquete, simplesmente deite-a fora e tente com outra.

source: Before using the floppy you created, <emphasis>set the write protect tab</emphasis>! Otherwise if you accidentally mount it in MacOS, MacOS will helpfully ruin it.
fi: Ennen kuin luotua levykettä käytetään, <emphasis>muistetaan pistää kirjoitussuoja päälle</emphasis>! Muuten MacOS avuliaasti pilaa levykkeen, jos epähuomiossa liittää sen MacOS:ssä.
pt: Antes de utilizar a disquete que criou, <emphasis>ajuste a patilha de protecção contra escrita</emphasis>! Caso contrário se você acidentalmente montá-la em MacOS, MacOS irá arruiná-la.

source: Preparing Files for USB Memory Stick Booting
fi: Tiedostojen valmistelu käynnistettäessä USB-muistilta
pt: Preparar Ficheiros para iniciar a partir de USB Memory Stick

source: There are two installation methods possible when booting from USB stick. The first is to only use the USB stick to boot the installer, and then install completely from the network. The second is to also copy a CD image onto the USB stick and use that as a source for packages, possibly in combination with a mirror.
pt: Existem dois métodos de instalação possíveis ao arrancar a partir de uma 'pen' USB. O primeiro é utilizar a pen sub para arrancar o instalador, e depois instalar tudo a partir da rede. O segundo é copiar também uma imagem de CD para a 'pen' USB e utiliza-la como fonte de pacotes, possivelmente em combinação com um 'mirror'.

source: To prepare the USB stick, you will need a system where GNU/Linux is already running and where USB is supported. With current GNU/Linux systems the USB stick should be automatically recognized when you insert it. If it is not you should check that the usb-storage kernel module is loaded. When the USB stick is inserted, it will be mapped to a device named <filename>/dev/sdX</filename>, where the <quote>X</quote> is a letter in the range a-z. You should be able to see to which device the USB stick was mapped by running the command <command>dmesg</command> after inserting it. To write to your stick, you may have to turn off its write protection switch.
fi: USB-muistin valmisteluun tarvitaan järjestelmä, jossa GNU/Linux on jo toiminnassa ja jossa USB on tuettu. Nykyisissä GNU/Linux-järjestelmissä USB-muisti pitäisi tunnistua automaattisesti kun se kytketään koneeseen. Jos se ei tunnistu, olisi varmistuttava ytimen moduulin usb-storage olevan ladattuna. Kun USB-muisti kytketään, se kuvataan laitteeseen nimeltä <filename>/dev/sdX</filename>, missä <quote>X</quote> on jokin kirjaimista a-z. Kyseisen laitteen pitäisi ilmetä komennon <command>dmesg</command> tulosteesta sen jälkeen kun muisti on kytketty. Kun muistille kirjoitetaan, on sen kirjoitussuoja ehkä otettava pois päältä.
pt: Para preparar o stick USB você irá necessitar dum sistema GNU/Linux que já esteja em funcionamento e onde seja suportado USB. Em sistemas GNU/Linux actuais a pen USB deve ser reconhecida automaticamente quando a inserir. Se não for o caso deve verificar se o módulo usb-storage está carregado. Quando a pen for inserida será mapeada para um dispositivo chamado <filename>/dev/sdX</filename>, onde <quote>X</quote> é uma letra na gama a-z. Deverá ser capaz de ver para qual dispositivo foi a 'pen' USB mapeada correndo o comando <command>dmesg</command> depois de a inserir. Para escrever para a sua 'pen', poderá ter de desligar o botão de protecção de escrita.

source: The procedures described in this section will destroy anything already on the device! Make very sure that you use the correct device name for your USB stick. If you use the wrong device the result could be that all information on for example a hard disk could be lost.
fi: Tässä osiossa kuvatut toiminnot tuhoavat kaiken mitä laitteella jo on. Varmistu käyttäväsi USB-muistin oikeaa laitenimeä. Jos käytät väärää laitenimeä, saatat tuhota kaiken tiedon esimerkiksi koneen kiintolevyltä.
pt: Os procedimentos descritos nesta secção irão destruir tudo o que já esteja no dispositivo! Assegure-se que utiliza o nome correcto do dispositivo para a sua 'pen' USB. Se utilizar o dispositivo errado o resultado poderá ser que toda a informação no, por exemplo, disco rígido seja perdida.

source: To prepare a USB stick that only boots the installer, which then proceeds to install entirely from the network, you'll need to download the <filename>mini.iso</filename> image from the <filename>netboot</filename> directory (at the location mentioned in <xref linkend="where-files"/>), and write this file directly to the USB stick, overwriting its current contents. This method will work with very small USB sticks, only a few megabytes in size.
pt: Para preparar uma 'pen' USB que apenas arranca o instalador, e que depois prossegue com a instalação totalmente a partir da rede, vai necessitar obter a imagem <filename>mini.iso</filename> a partir do directório <filename>netboot</filename> (no local mencionado em <xref linkend="where-files"/>), e escrever este ficheiro directamente na 'pen' USB, sobrescrevendo o seu conteúdo actual. Este método irá funcionar com 'pens' USB de capacidade reduzida, apenas com alguns megabytes.
