Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/install-methods.po
Languages: fi, pt

source: The normal <command>ybin</command> tool that comes with <command>yaboot</command> does not yet understand USB storage devices, so you will have to install <command>yaboot</command> by hand using the <classname>hfsutils</classname> tools. Type <informalexample><screen> $ hmount /dev/<replaceable>sdX2</replaceable> $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> Again, take care that you use the correct device name. The partition must not be otherwise mounted during this procedure. This procedure writes the boot loader to the partition, and uses the HFS utilities to mark it in such a way that Open Firmware will boot it. Having done this, the rest of the USB stick may be prepared using the normal Unix utilities.
fi: Vakiona <command>yaboot</command>:n kanssa tuleva komento <command>ybin</command> ei vielä ymmärrä USB-massamuisteja, joten <command>yaboot</command> on asennettava itse paketin <classname>hfsutils</classname> työkaluilla. Kirjoita <informalexample><screen> $ hmount /dev/<replaceable>sdX2</replaceable> $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> Varmistu taas, että käytetään oikeaa laitenimeä. Osio ei saa olla liitettynä muuanne tätä tehtäessä. Tässä tallennetaan osioon käynnistyslatain, ja merkitään se HFS:n työkaluilla siten että Open Firmware käynnistää sen. Kun tämä on tehty, voidaan muu osa USB-muistista valmistella tavallisilla Unixin työkaluilla.
pt: A ferramenta <command>ybin</command> que por norma vem com o <command>yaboot</command> ainda não reconhece dispositivos de armazenamento USB, por isso terá de instalar, manualmente, o <command>yaboot</command> utilizando as ferramentas <classname>hfsutils</classname>. Escreva <informalexample><screen> $ hmount /dev/<replaceable>sdX2</replaceable> $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> Mais uma vez, certifique-se de que está a utilizar o nome correcto do dispositivo. A partição não pode estar montada durante este procedimento. Este procedimento escreve o gestor de arranque na partição, e utiliza os utilitários HFS para marcá-lo de maneira a que Open Firmware arranque a partir dele. Tendo isto feito, O resto da 'pen' USB pode ser preparada utilizando os utilitários Unix comuns.

source: Mount the partition (<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>) and copy the following installer image files to the stick:
fi: Liitä osio (<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>) ja kopioi &debian;in asennuspalvelimesta seuraavat tiedsotot USB-muistille:
pt: Monte a partição (<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>) e copie para a 'pen' os seguintes ficheiros de imagem do instalador:

source: <filename>vmlinux</filename> (kernel binary)
fi: <filename>vmlinux</filename> (ytimen ohjelmatiedosto)
pt: <filename>vmlinux</filename> (binário do kernel)

source: <filename>initrd.gz</filename> (initial ramdisk image)
fi: <filename>initrd.gz</filename> (käynnistysmuistilevyn levyotos)
pt: <filename>initrd.gz</filename> (imagem ramdisk inicial)

source: <filename>yaboot.conf</filename> (yaboot configuration file)
fi: <filename>yaboot.conf</filename> (yabootin asetustiedosto)
pt: <filename>yaboot.conf</filename> (ficheiro de configuração yaboot)

source: <filename>boot.msg</filename> (optional boot message)
fi: <filename>boot.msg</filename> (valinnainen käynnistysviesti)
pt: <filename>boot.msg</filename> (mensagem opcional de arranque)

source: The <filename>yaboot.conf</filename> configuration file should contain the following lines: <informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000 read-only </screen></informalexample> Please note that the <userinput>initrd-size</userinput> parameter may need to be increased, depending on the image you are booting.
fi: Asetustiedostossa <filename>yaboot.conf</filename> tulisi olla seuraavat rivit: <informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000 read-only </screen></informalexample> Huomaa, että parametrin <userinput>initrd-size</userinput> arvoa voidaan joutua kasvattamaan asennettavan otoksen mukaan.
pt: O ficheiro de configuração <filename>yaboot.conf</filename> deve conter as seguintes linhas:<informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000 read-only </screen></informalexample> Por favor note que o parâmetro <userinput>initrd-size</userinput> pode necessitar ser aumentado, dependendo da imagem de que está a iniciar.

source: If you used an <filename>hd-media</filename> image, you should now copy a &debian; ISO image (businesscard, netinst or full CD image; be sure to select one that fits) onto the stick. When you are done, unmount the USB memory stick (<userinput>umount /mnt</userinput>).
fi: Jos käytit <filename>hd-media</filename>-otosta, on nyt kopioitava &debian;in ISO-otos (businesscard, netinst tai täysi CD-otos; varmista valitsevasi se mikä mahtuu) muistille. Kun tämä on valmista, irroita USB-muisti (<userinput>umount /mnt</userinput>).
pt: Se utilizou uma imagem <filename>hd-media</filename>, deve agora copiar uma imagem ISO &debian; (businesscard, netinst, ou imagem completa de CD; assegure-se que escolhe uma que caiba) para a 'pen'. Quando terminar, desmonte a 'pen' USB (<userinput>umount /mnt</userinput>).

source: Booting the USB stick
fi: Käynnistäminen USB-muistilta
pt: Arrancar do stick USB

source: If your system refuses to boot from the memory stick, the stick may contain an invalid master boot record (MBR). To fix this, use the <command>install-mbr</command> command from the package <classname>mbr</classname>:
fi: Jos tietokone ei käynnisty USB-muistilta, on muistilla ehkä kelvoton pääkäynnistyslohko (MBR). Tämä korjataan komennolla <command>install-mbr</command> joka on paketissa <classname>mbr</classname>:
pt: Se o seu sistema se recusa a arrancar a partir do stick de memória, este stick pode conter um master boot record (MBR) inválido. Para solucionar isto, utilize o comando <command>install-mbr</command> do pacote <classname>mbr</classname>:

source: Preparing Files for Hard Disk Booting
fi: Tiedostojen valmistelu käynnistettäessä kiintolevyltä
pt: Preparar Ficheiros para Arrancar a Partir de Disco Rígido.

source: The installer may be booted using boot files placed on an existing hard drive partition, either launched from another operating system or by invoking a boot loader directly from the BIOS.
fi: Asennin voidaan käynnistää käyttämällä koneessa jo olevalle kiintolevyn osiolle tallennettuja käynnistystiedostoja, joko toisesta käyttöjärjestelmästä tai käynnistämällä käynnistyslatain suoraan BIOS:sta.
pt: O instalador pode ser iniciado utilizando os ficheiros de arranque colocados numa partição do disco rígido, quer seja lançado a partir de outro sistema operativo ou invocando directamente o gestor de arranque da BIOS.

source: A full, <quote>pure network</quote> installation can be achieved using this technique. This avoids all hassles of removable media, like finding and burning CD images or struggling with too numerous and unreliable floppy disks.
fi: Kokonaan ja <quote>pelkästään verkosta</quote> tapahtuva asennus on tehtävissä tällä tavalla. Tällöin vältetään kaikki vaihdettaviin taltioihin liittyvä sählinki, kuten romppuotosten etsiminen ja polttaminen tai liian lukuisten ja epäluotettavien levykkeiden kanssa tappeleminen.
pt: Uma instalação completa <quote>pure network</quote> pode ser conseguida utilizando esta técnica. Isto evita todo o aborrecimento do media amovível, tal como encontrar e gravar imagens de CD ou lutar com um número elevado de imagens de disquetes que não são fiáveis.

source: The installer cannot boot from files on an HFS+ file system. MacOS System 8.1 and above may use HFS+ file systems; NewWorld PowerMacs all use HFS+. To determine whether your existing file system is HFS+, select <userinput>Get Info</userinput> for the volume in question. HFS file systems appear as <userinput>Mac OS Standard</userinput>, while HFS+ file systems say <userinput>Mac OS Extended</userinput>. You must have an HFS partition in order to exchange files between MacOS and Linux, in particular the installation files you download.
fi: Asennin ei osaa käynnistää HFS+-tiedostojärjestelmälle tallennetuista tiedostoista. MacOS System 8.1 ja uudemmat saattavat käyttää HFS+-tiedostojärjestelmiä; NewWorld PowerMacit käyttävät kaikki HFS+:aa. Voit tarkistaa onko käytetty tiedostojärjestelmä HFS+ valitsemalla kyseiselle levyniteelle <userinput>Get Info</userinput>. HFS-tiedostojärjestelmien kohdalla näkyy <userinput>Mac OS Standard</userinput>, kun taas HFS+-tiedostojärjestelmin kohdalla on <userinput>Mac OS Extended</userinput>. Tiedostojen vaihtamiseksi MacOS:n ja Linuxin välilä on oltava HFS-osio, erityisesti noudettavien asennustiedostojen kopioimiseen.
pt: O instalador não pode iniciar dos ficheiros num sistema de ficheiros HFS+. O sistema MacOS 8.1 e abaixo pode utilizar o sistema de ficheiros HFS+; NewWorld PowerMacs utilizam todos HFS+. Para determinar se os seu sistema de ficheiros é HFS+, seleccione <userinput>Get Info</userinput> para o volume em questão. O sistema de ficheiros HFS aparecem como <userinput>Mac OS Standard</userinput>, enquanto sistemas de ficheiros HFS+ são conhecidos como <userinput>Mac OS Extended</userinput>. Você deve ter uma partição HFS com o intuito de trocar ficheiros entre MacOS e Linux, em particular os ficheiros de instalação dos quais fez download.

source: Different programs are used for hard disk installation system booting, depending on whether the system is a <quote>NewWorld</quote> or an <quote>OldWorld</quote> model.
fi: Laitemallin mukaan (<quote>NewWorld</quote> tai <quote>OldWorld</quote>) käytetään eri ohjelmia kiintolevylle tallennetun asennusjärjestelmän käynnistämiseen.
pt: Diferentes programas são utilizados para iniciar uma instalação de um disco rígido, dependendo se o sistema é do modelo <quote>NewWorld</quote> ou um <quote>OldWorld</quote>.

source: Hard disk installer booting using <command>LILO</command> or <command>GRUB</command>
fi: Kiintolevylle tallennetun asentimen käynnistäminen sovelluksilla <command>LILO</command> tai <command>GRUB</command>
pt: Arrancar o Instalador de disco rígido com o <command>LILO</command> ou <command>GRUB</command>

source: This section explains how to add to or even replace an existing linux installation using either <command>LILO</command> or <command>GRUB</command>.
fi: Tässä luvussa selitetään kuinka käynnistysvalikkoon lisätään tai jopa korvataan koneessa oleva Linux-asennus käyttämällä sovelluksia <command>LILO</command> tai <command>GRUB</command>.
pt: Esta secção explica como adicionar ou substituir uma instalação de Linux existente utilizando tanto o <command>LILO</command> como o <command>GRUB</command>.

source: At boot time, both bootloaders support loading in memory not only the kernel, but also a disk image. This RAM disk can be used as the root file-system by the kernel.
fi: Käynnistyksen aikana molemmat käynnistylataimet tukevat ei vain ytimen vaan myös levyotoksen lataamista muistiin. Ydin voi käyttää tätä muistilevyä juuritiedostojärjestelmänä.
pt: Na altura do arranque, ambos os gestores de arranque suportam carregar para a memória, não apenas o kernel, mas também a imagem de disco. Este disco RAM pode ser utilizado pelo kernel como sistema de ficheiros root.

source: Copy the following files from the &debian; archives to a convenient location on your hard drive (note that LILO can not boot from files on an NTFS file system), for instance to <filename>/boot/newinstall/</filename>.
pt: Copie os seguintes ficheiros dos arquivos &debian; para uma localização conveniente no seu disco, (note que o LILO não consegue arrancar a partir de ficheiros num sistema de ficheiros NTFS) por exemplo para a <filename>/boot/newinstall/</filename>.

source: <filename>vmlinuz</filename> (kernel binary)
fi: <filename>vmlinuz</filename> (ytimen ohjelmatiedosto)
pt: <filename>vmlinuz</filename> (binário kernel)

source: <filename>initrd.gz</filename> (ramdisk image)
fi: <filename>initrd.gz</filename> (muistilevyn levyotos)
pt: <filename>initrd.gz</filename> (imagem ramdisk)

source: Finally, to configure the bootloader proceed to <xref linkend="boot-initrd"/>.
fi: Tee lopuksi käynnistyslataimen asetukset jatkamalla kohtaan <xref linkend="boot-initrd"/>.
pt: Finalmente, para configurar o gestor de arranque prossiga para a <xref linkend="boot-initrd"/>.

source: Hard disk installer booting using <command>loadlin</command>
pt: Arrancar o Instalador de disco rígido com o <command>loadlin</command>

source: This section explains how to prepare your hard drive for booting the installer from DOS using <command>loadlin</command>.
pt: Esta secção explica como preparar um disco rígido para arrancar o instalador a partir do DOS utilizando o <command>loadlin</command>.

source: Copy the following directories from a &debian; CD image to <filename>c:\</filename>.
pt: Copie os seguintes directórios de uma imagem de CD &debian; para <filename>c:\</filename>.

source: <filename>/&x86-install-dir;</filename> (kernel binary and ramdisk image)
pt: <filename>/&x86-install-dir;</filename> (binário do kernel e imagem ramdisk)

source: <filename>/tools</filename> (loadlin tool)
pt: <filename>/tools</filename> (ferramenta loadlin)

source: Hard Disk Installer Booting for OldWorld Macs
fi: Kiintolevylle tallennetun asentimen käynnistäminen OldWorld Maceilla
pt: Instalador para Disco Rígido para Macs OldWorld

source: The <filename>boot-floppy-hfs</filename> floppy uses <application>miBoot</application> to launch Linux installation, but <application>miBoot</application> cannot easily be used for hard disk booting. <application>BootX</application>, launched from MacOS, supports booting from files placed on the hard disk. <application>BootX</application> can also be used to dual-boot MacOS and Linux after your &debian; installation is complete. For the Performa 6360, it appears that <command>quik</command> cannot make the hard disk bootable. So <application>BootX</application> is required on that model.
fi: Levyke <filename>boot-floppy-hfs</filename> käynnistää Linux-asennuksen ohjelmalla <application>miBoot</application>, <application>miBoot</application>ia ei kovin helposti voi käyttää kiintolevyltä käynnistämiseen. MacOS:stä käynnistettävä <application>BootX</application> tukee käynnistämistä kiintolevylle tallennetuista tiedostoista. <application>BootX</application>ää voi käyttää myös MacOS:n ja Linuxin kaksoiskäynnistämiseen jahka &debian;in asennus on valmis. Näyttää siltä, että mallissa Performa 6360 <command>quik</command> ei osaa tehdä kiintolevyä käynnistyväksi. Niinpä <application>BootX</application> on pakollinen tuolla mallilla.
pt: A disquete <filename>boot-floppy-hfs</filename> utiliza <application>miBoot</application> para iniciar a instalação de Linux, mas <application>miBoot</application> não pode facilmente ser utilizado para iniciar a partir de um disco rígido. <application>BootX</application> pode também ser usado para MacOS dual-boot e Linux após a sua instalação &debian; estar completa. Para Performa 6360, parece que <command>quik</command> não pode iniciar a partir do disco rígido. Portanto <application>BootX</application> é requerido nesse modelo.

source: Download and unstuff the <application>BootX</application> distribution, available from <ulink url="&url-powerpc-bootx;"></ulink>, or in the <filename>dists/woody/main/disks-powerpc/current/powermac</filename> directory on &debian; http/ftp mirrors and official &debian; CDs. Use <application>Stuffit Expander</application> to extract it from its archive. Within the package, there is an empty folder called <filename>Linux Kernels</filename>. Download <filename>linux.bin</filename> and <filename>ramdisk.image.gz</filename> from the <filename>disks-powerpc/current/powermac</filename> folder, and place them in the <filename>Linux Kernels</filename> folder. Then place the <filename>Linux Kernels</filename> folder in the active System Folder.
fi: Nouda ja pura (unstuff) <application>BootX</application>-jakelu, joka on saatavilla osoitteesta <ulink url="&url-powerpc-bootx;"></ulink>, tai hakemistosta <filename>dists/woody/main/disks-powerpc/current/powermac</filename> &debian;in http/ftp-asennuspalvelimilla ja virallisilla &debian;-rompuilla. Käytä <application>Stuffit Expander</application>ia sen purkamiseen arkistosta. Paketissa on tyhjä kansio nimeltä <filename>Linux Kernels</filename>. Nouda <filename>linux.bin</filename> ja <filename>ramdisk.image.gz</filename> kansiosta <filename>disks-powerpc/current/powermac</filename>, ja tallenna ne kansioon <filename>Linux Kernels</filename>. Sijoita sitten kansio <filename>Linux Kernels</filename> käytössä olevaan System-kansioon.
pt: Faça o download e descomprima a distribuição <application>BootX</application>, disponível a partir de <ulink url="&url-powerpc-bootx;"></ulink>, ou o directório <filename>dists/woody/main/disks-powerpc/current/powermac</filename> nos mirrors http/ftp &debian; e nos CDs oficiais de &debian;. Utilize <application>Stuffit Expander</application> para extraí-lo do seu arquivo. Dentro do pacote está um directório vazio com o nome de <filename>Linux Kernels</filename>. Faça download do <filename>linux.bin</filename> e <filename>ramdisk.image.gz</filename> a partir do directório <filename>disks-powerpc/current/powermac</filename>, e coloque-os no directório <filename>Linux Kernels</filename>. Coloque então o directório <filename>Linux Kernels</filename> no directório activo System Folder.

source: Hard Disk Installer Booting for NewWorld Macs
fi: Kiintolevylle tallennetun asentimen käynnistäminen NewWorld Maceilla
pt: Arrancar o Instalador a partir do Disco Rígido em Macs NewWorld

source: NewWorld PowerMacs support booting from a network or an ISO9660 CD-ROM, as well as loading ELF binaries directly from the hard disk. These machines will boot Linux directly via <command>yaboot</command>, which supports loading a kernel and RAMdisk directly from an ext2 partition, as well as dual-booting with MacOS. Hard disk booting of the installer is particularly appropriate for newer machines without floppy drives. <command>BootX</command> is not supported and must not be used on NewWorld PowerMacs.
fi: NewWorld PowerMacit tukevat käynnistystä verkosta tai ISO9660-rompulta, sekä ELF-ohjelmatiedostojen lataamista suoraan kiintolevyltä. Nämä koneet käynnistävät Linuxin suoraan <command>yaboot</command>:lla, joka tukee ytimen ja muistilevyn lataamista suoraan ext2-osiolta, sekä kaksoiskäynnistystä MacOS:n kanssa. Asentimen käynnistäminen kiintolevyltä on erityisen sovelias uusilla koneilla joissa ei ole levykeasemaa. <command>BootX</command> ei ole tuettu eikä sitä saa käyttää NewWorld PowerMaceilla.
pt: PowerMacs NewWorld suportam iniciar a partir da rede ou de um CD-ROM ISO9660, assim como carregar binários ELF directamente do disco rígido. Estas máquinas irão arrancar de Linux directamente através de <command>yaboot</command>, que suporta carregar um kernel e RAMdisk directamente de uma partição ext2, tal como o dual-booting com MacOS. Iniciar o instalador a partir do disco rígido é particularmente apropriado para máquinas recentes sem drive de disquetes. <command>BootX</command> não é suportado e não deve ser utilizado em PowerMacs NewWorld.

source: <emphasis>Copy</emphasis> (not move) the following four files which you downloaded earlier from the &debian; archives, onto the root level of your hard drive (this can be accomplished by <keycap>option</keycap>-dragging each file to the hard drive icon).
fi: <emphasis>Kopioi</emphasis> (älä siirrä) seuraavat neljä aiemmin &debian;in asennuspalvelimelta noudettua tiedostoa kiintolevyn juurihakemistoon (voidaan tehdä vetämällä jokainen tiedosto <keycap>option</keycap>-pohjassa kiintolevyn kuvakkeeseen.
pt: <emphasis>Copie</emphasis> (não mova) os seguintes quatro ficheiros que fez download anteriormente dos arquivos &debian;, para o nível de root do seu disco rígido (isto pode ser feito com <keycap>option</keycap>-arrastando cada ficheiro para o ícone do disco rígido).

source: Make a note of the partition number of the MacOS partition where you place these files. If you have the MacOS <command>pdisk</command> program, you can use the <command>L</command> command to check for the partition number. You will need this partition number for the command you type at the Open Firmware prompt when you boot the installer.
fi: Kirjoita muistiin sen MacOS-osion numero johon nämä tiedostot sijoitetaan. Jos käytettävissä on MacOS:n komento <command>pdisk</command>, voidaan sen komennolla <command>L</command> tarkistaa osion numero. Tämä osion numero tarvitaan Open Firmwaren komennossa kun asenninta käynnistetään.
pt: Tome nota do número da partição MacOS onde colocou estes ficheiros. Se tem o programa <command>pdisk</command> de MacOS, pode utilizar o comando <command>L</command> para verificar o número da partição. Vai necessitar deste número de partição para o comando que vai escrever na prompt do Open Firmware quando iniciar o instalador.

source: To boot the installer, proceed to <xref linkend="boot-newworld"/>.
fi: Käynnistä asennin jatkamalla kohtaan <xref linkend="boot-newworld"/>.
pt: Para iniciar o instalador, prossiga para a <xref linkend="boot-newworld"/>.

source: Preparing Files for TFTP Net Booting
fi: Tiedostojen valmistelu verkosta käynnistämiseen TFTP:llä
pt: Preparar Ficheiros para Arrancar Através da Rede por TFTP

source: If your machine is connected to a local area network, you may be able to boot it over the network from another machine, using TFTP. If you intend to boot the installation system from another machine, the boot files will need to be placed in specific locations on that machine, and the machine configured to support booting of your specific machine.
fi: Jos tietokone on kytketty paikallisverkkoon, se voidaan ehkä käynnistää verkosta toisella koneella olevista tiedostoista TFTP:tä käyttäen. Jos asennusjärjestelmä käynnistetään toiselta koneelta, on käynnistystiedostot tallennettava toisella koneella tiettyihin paikkoihin, ja sen asetukset tehtävä siten, että asennettavan koneen käynnistämistä tuetaan.
pt: Se a sua máquina estiver ligada a uma rede local poderá, utilizando TFTP, conseguir arrancar pela rede a partir de outra máquina. Se tencionar iniciar a instalação do sistema a partir de outra máquina, os ficheiros de arranque terão de ser colocados numa localização específica dessa máquina, e a máquina terá de ser configurada para suportar o arranque da sua máquina especifica.

source: You need to set up a TFTP server, and for many machines a DHCP server<phrase condition="supports-rarp">, or RARP server</phrase><phrase condition="supports-bootp">, or BOOTP server</phrase>.
fi: On asennettava TFTP-palvelin, ja useille koneille tarvitaan DHCP-palvelin<phrase condition="supports-rarp"> tai RARP-palvelin</phrase><phrase condition="supports-bootp"> tai BOOTP-palvelin</phrase>.
pt: Terá de configurar um servidor de TFTP, e para muitas máquinas, um servidor de DHCP<phrase condition="supports-rarp">, ou um servidor de RARP</phrase> <phrase condition="supports-bootp">, ou um servidor de BOOTP</phrase>.
