Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/install-methods.po
Languages: fi, pt

source: <phrase condition="supports-rarp">The Reverse Address Resolution Protocol (RARP) is one way to tell your client what IP address to use for itself. Another way is to use the BOOTP protocol.</phrase> <phrase condition="supports-bootp">BOOTP is an IP protocol that informs a computer of its IP address and where on the network to obtain a boot image.</phrase> The DHCP (Dynamic Host Configuration Protocol) is a more flexible, backwards-compatible extension of BOOTP. Some systems can only be configured via DHCP.
fi: <phrase condition="supports-rarp">Reverse Address Resolution Protocol (RARP) on yksi tapa kertoa asiakaskoneelle sen IP-osoite. Toinen tapa on BOOTP-protokolla. </phrase> <phrase condition="supports-bootp">BOOTP on IP-protokolla, joka kertoo tietokoneelle sen IP-osoitteen ja verkosta löytyvän käynnistysotoksen sijainnin. </phrase> DHCP (Dynamic Host Configuration Protocol) on joustavampi alaspäin yhteensopiva BOOTP:n laajennus. Joissakin järjestelmissä verkkoasetukset voidaan tehdä vain DHCP:llä.
pt: <phrase condition="supports-rarp"> O Reverse Address Resolution Protocol (RARP) é uma forma de informar o cliente do IP que deve utilizar para o próprio. Outra forma será utilizar o protocolo BOOTP. </phrase> <phrase condition="supports-bootp">BOOTP é um protocolo IP que informa um computador do seu endereço IP e em que local da rede obtém uma imagem de arranque.</phrase> O DHCP (Dynamic Host Configuration Protocol) é mais flexível, compatível com extensões anteriores do BOOTP. Alguns sistemas apenas podem ser configurados via DHCP.

source: For PowerPC, if you have a NewWorld Power Macintosh machine, it is a good idea to use DHCP instead of BOOTP. Some of the latest machines are unable to boot using BOOTP.
fi: PowerPC:n käyttäjien olisi NewWorld Power Macintosh -koneilla käytettävä DHCP:tä eikä BOOTP:tä. Jotkin uusimmat mallit eivät osaa käynnistyä BOOTP:llä.
pt: Para PowerPC, se tiver uma máquina Macintosh Power NewWorld, é uma boa ideia utilizar DHCP em vez de BOOTP. Algumas das máquinas mais recentes não são capazes de utilizar BOOTP.

source: Some older HPPA machines (e.g. 715/75) use RBOOTD rather than BOOTP. There is an <classname>rbootd</classname> package available in &debian;.
fi: Jotkin vanhat HPPA-koneet (esim. 715/75) käyttävät RBOOTD:tä eikä BOOTP:tä. &debian;issa on saatavilla paketti <classname>rbootd</classname>.
pt: Algumas máquinas HPPA mais antigas (p.e.: 715/75) utilizam RBOOTD em vez de BOOTP. Está disponível um pacote <classname>rbootd</classname> em &debian;.

source: The Trivial File Transfer Protocol (TFTP) is used to serve the boot image to the client. Theoretically, any server, on any platform, which implements these protocols, may be used. In the examples in this section, we shall provide commands for SunOS 4.x, SunOS 5.x (a.k.a. Solaris), and GNU/Linux.
fi: Trivial File Transfer Protocol (TFTP) siirtää käynnistyslevyn otoksen asiakaskoneelle. Periaatteessa voidaan käyttää mitä tahansa nämä protokollat toteuttavaa palvelinta millä tahansa laitealustalla. Tämän luvun esimerkeissä näytetään käyttöjärjestelmissä SunOS 4.x, SunOS 5.x (eli Solaris) ja GNU/Linux käytettävät komennot.
pt: O Trivial File Transfer Protocol (TFTP) é utilizado para servir a imagem de arranque ao cliente. Teoricamente, qualquer servidor, em qualquer plataforma, que implemente estes protocolos, pode ser utilizado. Nos exemplos desta secção, iremos disponibilizar comandos para SunOS 4.x, SunOS 5.x (a.k.a. Solaris), e GNU/Linux.

source: For a &debian-gnu; server we recommend <classname>tftpd-hpa</classname>. It's written by the same author as the <classname>syslinux</classname> bootloader and is therefore least likely to cause issues. A good alternative is <classname>atftpd</classname>.
fi: &debian-gnu;-palvelimelle suositellaan sovellusta <classname>tftpd-hpa</classname>. Siinä on tekijä sama kuin käynnistyslataimella <classname>syslinux</classname>, joten todennäköisesti yhteistoiminnan kanssa on vähiten vaikeuksia. Hyvä vaihtoehto on <classname>atftpd</classname>.
pt: Para um servidor &debian-gnu; nós recomendamos o <classname>tftpd-hpa</classname>. É escrito pelo mesmo autor do gestor de arranque <classname>syslinux</classname> e por isso pouco provável que cause problemas. Uma boa alternativa é o <classname>atftpd</classname>.

source: Setting up RARP server
fi: RARP-palvelimen asetukset
pt: Configurar o servidor RARP

source: To set up RARP, you need to know the Ethernet address (a.k.a. the MAC address) of the client computers to be installed. If you don't know this information, you can <phrase arch="sparc"> pick it off the initial OpenPROM boot messages, use the OpenBoot <userinput>.enet-addr</userinput> command, or </phrase> boot into <quote>Rescue</quote> mode (e.g., from the rescue floppy) and use the command <userinput>ip addr show dev eth0</userinput>.
fi: RARP:n asetuksia varten on tiedettävä asennettavien asiakaskoneiden Ethernet-osoitteet (eli Mac-osoitteet). Jos nämä osoitteet eivät ole tiedosssa, voidaan <phrase arch="sparc"> katsoa se OpenROM:n ensimmäisistä käynnistysviesteistä, käytä OpenBootin komentoa <userinput>.enet-addr</userinput>, tai </phrase> käynnistää <quote>Rescue</quote>-tilaan (esim. hätäkäynnistyslevykkeeltä) ja komentaa <userinput>ip addr show dev eth0</userinput>.
pt: Para configurar o RARP, necessita saber o endereço de Ethernet ( o endereço MAC) dos computadores clientes a serem instalados. Se não sabe esta informação, pode-a <phrase arch="sparc"> obter nas mensagens iniciais de arranque do OpenPROM, use o comando OpenBoot <userinput>.enet-addr</userinput>, ou pode </phrase> arrancar no modo <quote>Rescue</quote> (e.g., a partir da disquete de recuperação) e utilizar o comando <userinput>ip endereço show dev eth0</userinput>.

source: On a RARP server system using a Linux 2.4 or 2.6 kernel, or Solaris/SunOS, you use the <command>rarpd</command> program. You need to ensure that the Ethernet hardware address for the client is listed in the <quote>ethers</quote> database (either in the <filename>/etc/ethers</filename> file, or via NIS/NIS+) and in the <quote>hosts</quote> database. Then you need to start the RARP daemon. Issue the command (as root): <userinput>/usr/sbin/rarpd -a</userinput> on most Linux systems and SunOS 5 (Solaris 2), <userinput>/usr/sbin/in.rarpd -a</userinput> on some other Linux systems, or <userinput>/usr/etc/rarpd -a</userinput> in SunOS 4 (Solaris 1).
fi: RARP-palvelimella jossa käytetään Linux-ydintä 2.4 tai 2.6, tai käyttöjärjestelmää Solaris/SunOS, käytetään ohjelmaa <command>rarpd</command>. On varmistuttava, että asiakaskoneen Ethernet-laiteosoite on mainittu <quote>ethers</quote>-tietokannassa (joko tiedostossa <filename>/etc/ethers</filename> tai NIS/NIS+:n kautta) ja <quote>hosts</quote>-tietokannassa. Sitten on käynnistettävä RARP-taustaprosessi. Anna (pääkäyttäjänä) komento: <userinput>/usr/sbin/rarpd -a</userinput> useimmissa Linux-järjestelmissä ja käyttöjärjestelmässä SunOS 5 (Solaris 2), <userinput>/usr/sbin/in.rarpd -a</userinput> joissakin muissa Linux-järjestelmissä tai <userinput>/usr/etc/rarpd -a</userinput> käyttöjärjestelmässä SunOS 4 (Solaris 1).
pt: Num sistema servidor RARP que utilize um kernel Linux 2.4 ou 2.6, ou Solaris/SunOS, você utiliza o programa <command>rarpd</command>. Você necessita assegurar-se que o endereço de hardware Ethernet para o cliente está listado na base de dados <filename>/etc/ethers</filename> (ou no ficheiro <filename>/etc/ethers</filename>, ou via NIS/NIS+) na base de dados <quote>hosts</quote>. De seguida necessita iniciar o daemon RARP. Envie o comando (como root): na maioria dos sistemas Linux SunOS 5 (Solaris 2) <userinput>/usr/sbin/rarpd -a</userinput>, <userinput>/usr/sbin/in.rarpd -a</userinput> em alguns outros sistemas Linux, ou <userinput>/usr/etc/rarpd -a</userinput> em SunOS 4 (Solaris 1).

source: Setting up a DHCP server
fi: DHCP-palvelimen asetukset
pt: Configurar um servidor DHCP

source: One free software DHCP server is ISC <command>dhcpd</command>. For &debian-gnu;, the <classname>dhcp3-server</classname> package is recommended. Here is a sample configuration file for it (see <filename>/etc/dhcp3/dhcpd.conf</filename>):
fi: Eräs vapaa DHCP-palvelinohjelmisto on ISC <command>dhcpd</command>. &debian-gnu;ille suositellaan pakettia <classname>dhcp3-server</classname>. Tässä on esimerkki sen asetustiedostosta (katso <filename>/etc/dhcp3/dhcpd.conf</filename>):
pt: O ISC <command>dhcpd</command> é um software livre servidor de DHCP. Para &debian-gnu; é recomendado o pacote <classname>dhcp3-server</classname>. Aqui está um exemplo de ficheiro de configuração (veja <filename>/etc/dhcp3/dhcpd.conf</filename>):

source: In this example, there is one server <replaceable>servername</replaceable> which performs all of the work of DHCP server, TFTP server, and network gateway. You will almost certainly need to change the domain-name options, as well as the server name and client hardware address. The <replaceable>filename</replaceable> option should be the name of the file which will be retrieved via TFTP.
fi: Tässä esimerkissa on yksi palvelin, <replaceable>servername</replaceable>, joka tekee kaikki DHCP-palvelimen, TFTP-palvelimen ja verkon yhdyskäytävän työt. Asetuksen domain-name arvoa joudut lähes varmasti muuttamaan, samoin kuin palvelimen nimen ja asiakaskoneen MAC-osoitteen. Asetuksen <replaceable>filename</replaceable> on oltava TFTP:llä noudettavan tiedoston nimi.
pt: Neste exemplo, existe um servidor <replaceable>servername</replaceable> que executa todo o trabalho de servidor DHCP, de servidor TFTP e gateway de rede. Irá muito provavelmente necessitar de alterar as opções de domain-name, tal como o nome do servidor e o endereço de hardware do cliente. A opção <replaceable>filename</replaceable> deverá ser o nome do ficheiro obtido por TFTP.

source: After you have edited the <command>dhcpd</command> configuration file, restart it with <userinput>/etc/init.d/dhcp3-server restart</userinput>.
fi: Kun <command>dhcpd</command>:n asetustiedosto on muokattu, käynnistetään se uudestaan komennolla <userinput>/etc/init.d/dhcp3-server restart</userinput>.
pt: Após ter editado o ficheiro de configuração <command>dhcpd</command>, reinicie-o com <userinput>/etc/init.d/dhcp3-server restart</userinput>.

source: Enabling PXE Booting in the DHCP configuration
fi: PXE-käynnistyksen käyttöönotto DHCP-asetuksissa
pt: Possibilitar o Arranque PXE na configuração DHCP

source: Here is another example for a <filename>dhcp.conf</filename> using the Pre-boot Execution Environment (PXE) method of TFTP. <informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # The next paragraph needs to be modified to fit your case subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option broadcast-address 192.168.1.255; # the gateway address which can be different # (access to the internet for instance) option routers 192.168.1.1; # indicate the dns you want to use option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # tftp client hardware address hardware ethernet 00:10:DC:27:6C:15; filename "/pxelinux.0"; } } </screen></informalexample> Note that for PXE booting, the client filename <filename>pxelinux.0</filename> is a boot loader, not a kernel image (see <xref linkend="tftp-images"/> below).
fi: Tässä on toinen esimerkki tiedostosta <filename>dhcp.conf</filename>. Tässä käytetään TFTP:n käynnistystapaa Pre-boot Execution Environment (PXE). <informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # The next paragraph needs to be modified to fit your case subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option broadcast-address 192.168.1.255; # the gateway address which can be different # (access to the internet for instance) option routers 192.168.1.1; # indicate the dns you want to use option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # tftp client hardware address hardware ethernet 00:10:DC:27:6C:15; filename "/pxelinux.0"; } } </screen></informalexample> Huomaa, että PXE-käynnistyksessä asiakkaan tiedostonimi <filename>pxelinux.0</filename> on käynnistyslatain eikä ytimen ohjelmatiedosto (katso <xref linkend="tftp-images"/> tuonnempana).
pt: Aqui está outro exemplo para um <filename>dhcp.conf</filename> utilizando o método Pre-boot Execution Environment (PXE) de TFTP. <informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # O próximo parágrafo necessita ser alterado para se adequar com o seu caso subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option broadcast-address 192.168.1.255; # O endereço de gateway que pode ser diferente # (acesso à internet por exemplo) option routers 192.168.1.1; # indica o dns que quer utilizar option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # endereço de hardware do cliente tftp hardware ethernet 00:10:DC:27:6C:15; filename "/pxelinux.0"; } } </screen></informalexample> Note que para um arranque PXE, o ficheiro do cliente com o nome de <filename>pxelinux.0</filename>, é o gestor de arranque, não uma imagem de kernel (veja a <xref linkend="tftp-images"/> abaixo).

source: Setting up a BOOTP server
fi: BOOTP-palvelimen käyttöönotto
pt: Configurar o servidor BOOTP

source: There are two BOOTP servers available for GNU/Linux. The first is CMU <command>bootpd</command>. The other is actually a DHCP server: ISC <command>dhcpd</command>. In &debian-gnu; these are contained in the <classname>bootp</classname> and <classname>dhcp3-server</classname> packages respectively.
fi: GNU/Linuxille on saatavilla kaksi BOOTP-palvelinta. Ensimmäinen on CMU <command>bootpd</command>. Toinen on itse asiassa DHCP-palvelin: ISC <command>dhcpd</command>. &debian-gnu;issa ne sisältyvät paketteihin <classname>bootp</classname> ja <classname>dhcp3-server</classname>.
pt: Estão disponíveis dois servidores de BOOTP para GNU/Linux. O primeiro é o CMU <command>bootpd</command>. O outro é na verdade um servidor de DHCP: o ISC <command>dhcpd</command>. Em &debian-gnu; estes estão contidos respectivamente nos pacotes <classname>bootp</classname> e <classname>dhcp3-server</classname>.

source: To use CMU <command>bootpd</command>, you must first uncomment (or add) the relevant line in <filename>/etc/inetd.conf</filename>. On &debian-gnu;, you can run <userinput>update-inetd --enable bootps</userinput>, then <userinput>/etc/init.d/inetd reload</userinput> to do so. Just in case your BOOTP server does not run &debian;, the line in question should look like: <informalexample><screen> bootps dgram udp wait root /usr/sbin/bootpd bootpd -i -t 120 </screen></informalexample> Now, you must create an <filename>/etc/bootptab</filename> file. This has the same sort of familiar and cryptic format as the good old BSD <filename>printcap</filename>, <filename>termcap</filename>, and <filename>disktab</filename> files. See the <filename>bootptab</filename> manual page for more information. For CMU <command>bootpd</command>, you will need to know the hardware (MAC) address of the client. Here is an example <filename>/etc/bootptab</filename>: <informalexample><screen> client:\ hd=/tftpboot:\ bf=tftpboot.img:\ ip=192.168.1.90:\ sm=255.255.255.0:\ sa=192.168.1.1:\ ha=0123456789AB: </screen></informalexample> You will need to change at least the <quote>ha</quote> option, which specifies the hardware address of the client. The <quote>bf</quote> option specifies the file a client should retrieve via TFTP; see <xref linkend="tftp-images"/> for more details. <phrase arch="mips"> On SGI machines you can just enter the command monitor and type <userinput>printenv</userinput>. The value of the <userinput>eaddr</userinput> variable is the machine's MAC address. </phrase>
pt: Para utilizar o CMU <command>bootpd</command>, primeiro você tem de retirar o comentário (ou adicionar) da linha relevante em <filename>/etc/inetd.conf</filename>. Em &debian-gnu;, você pode executar <userinput>update-inetd --enable bootps</userinput>, para o fazer. No caso do seu servidor de BOOTP não correr em &debian;, a linha em questão deve parecer-se com: <informalexample><screen> bootps dgram udp wait root /usr/sbin/bootpd bootpd -i -t 120 </screen></informalexample>Agora, você tem de criar um ficheiro <filename>/etc/bootptab</filename>. Este tem o mesmo tipo de formato familiar e críptico do bom velho BSD <filename>printcap</filename>, <filename>termcap</filename>, e <filename>disktab</filename>. Para mais informações veja a página do manual de <filename>bootptab</filename>. Para o CMU <command>bootpd</command>, você vai necessitar saber o endereço de hardware (MAC) do cliente. Aqui está um <filename>/etc/bootptab</filename> de exemplo: <informalexample><screen> client:\ hd=/tftpboot:\ bf=tftpboot.img:\ ip=192.168.1.90:\ sm=255.255.255.0:\ sa=192.168.1.1:\ ha=0123456789AB: </screen></informalexample>Você tem de alterar pelo menos a opção <quote>ha</quote>, que especifica o endereço de hardware do cliente. A opção <quote>bf</quote> especifica o ficheiro que o cliente deve obter via TFTP; para mais detalhes veja a <xref linkend="tftp-images"/>. <phrase arch="mips">Em máquinas SGI você pode apenas entrar no monitor de comandos e escrever <userinput>printenv</userinput>. O valor da variável <userinput>eaddr</userinput> é o endereço MAC da máquina. </phrase>

source: By contrast, setting up BOOTP with ISC <command>dhcpd</command> is really easy, because it treats BOOTP clients as a moderately special case of DHCP clients. Some architectures require a complex configuration for booting clients via BOOTP. If yours is one of those, read the section <xref linkend="dhcpd"/>. Otherwise you will probably be able to get away with simply adding the <userinput>allow bootp</userinput> directive to the configuration block for the subnet containing the client in <filename>/etc/dhcp3/dhcpd.conf</filename>, and restart <command>dhcpd</command> with <userinput>/etc/init.d/dhcp3-server restart</userinput>.
fi: Tähän verrattuna BOOTP:n asetusten tekeminen ISC <command>dhcpd</command>:llä on todella helppoa, koska se käsittelee BOOTP-asiakkaat DHCP-asiakkaiden erikoistapauksena. Joissakin suoritinperheissä on käytettävä monimutkaisia asetuksia asiakkaiden käynnistämiseen BOOTP:llä. Jos koneesi on joku niistä, lue <xref linkend="dhcpd"/>. Muussa tapauksessa luultavasti riittää direktiivin <userinput>allow bootp</userinput> lisääminen asiakaskoneen aliverkon asetusten lohkoon tiedostossa <filename>/etc/dhcp3/dhcpd.conf</filename> ja <command>dhcpd</command>:n käynnistäminen uudelleen komennolla <userinput>/etc/init.d/dhcp3-server restart</userinput>.
pt: Por contraste, configurar BOOTP com ISC <command>dhcpd</command> é realmente fácil, porque trata os clientes de BOOTP como casos moderadamente especiais de clientes de DHCP. Algumas arquitecturas necessitam duma configuração complexa para arrancarem os clientes por BOOTP. Se o seu caso é um desses, leia a secção <xref linkend="dhcpd"/>. Caso contrário poderá ser capaz de o conseguir simplesmente acrescentando a directiva <userinput>allow bootp</userinput> ao bloco de configuração para a subnet que contém o cliente em <filename>/etc/dhcp3/dhcpd.conf</filename>, e reiniciar o <command>dhcpd</command> com <userinput>/etc/init.d/dhcp3-server restart</userinput>.

source: Enabling the TFTP Server
fi: TFTP-palvelimen käyttöönotto
pt: Disponibilizar o Servidor TFTP

source: To get the TFTP server ready to go, you should first make sure that <command>tftpd</command> is enabled.
fi: Valmisteltaessa TFTP-palvelimen käyttöönottoa tulisi ensin tarkistaa komennon <command>tftpd</command> olevan käytettävissä.
pt: Para ter o servidor de TFTP pronto, primeiro deve assegurar-se que o <command>tftpd</command> está activo.

source: In the case of <classname>tftpd-hpa</classname> there are two ways the service can be run. It can be started on demand by the system's <classname>inetd</classname> daemon, or it can be set up to run as an independent daemon. Which of these methods is used is selected when the package is installed and can be changed by reconfiguring the package.
fi: Palvelua <classname>tftpd-hpa</classname> voidaan käyttää kahdella tavalla. Järjestelmän taustaprosessi <classname>inetd</classname> voi käynnistää sen tarvittaessa tai se voidaan käynnistää omana taustaprosessinaan. Käyttötapa valitaan pakettia asennettaessa ja sitä voidaan vaihtaan tekemällä paketin asetukset uudestaan.
pt: No caso do <classname>tftpd-hpa</classname> o serviço pode ser corrido de duas formas. Pode ser iniciado a pedido pelo daemon <classname>inet</classname> do sistema, ou pode ser configurado para correr como um daemon independente. O método a utilizar é escolhido quando o pacote é instalado e pode ser alterado reconfigurando o pacote.

source: Historically, TFTP servers used <filename>/tftpboot</filename> as directory to serve images from. However, &debian-gnu; packages may use other directories to comply with the <ulink url="&url-fhs-home;">Filesystem Hierarchy Standard</ulink>. For example, <classname>tftpd-hpa</classname> by default uses <filename>/srv/tftp</filename>. You may have to adjust the configuration examples in this section accordingly.
fi: Perinteisesti TFTP-palvelimet ovat jakaneet hakemiston <filename>/tftpboot</filename> tiedostoja. &debian-gnu;in paketit voivat kuitenkin käyttää muita hakemistoja, jotta ne noudattaisivat <ulink url="&url-fhs-home;">Filesystem Hierarchy Standard</ulink>-määrittelyä. Esimerkiksi <classname>tftpd-hpa</classname> käyttää oletusarvona hakemistoa <filename>/var/lib/tftpboot</filename>. Saatat joutua säätämään tämän luvun asetusesimerkkejä vastaavasti.
pt: Historicamente, os servidores TFTP utilizavam o directório <filename>/tftpboot</filename> para servir imagens. No entanto, os pacotes &debian-gnu; podem utilizar outros directórios em conformidade com o <ulink url="&url-fhs-home;">Filesystem Hierarchy Standard</ulink>. Por exemplo, <classname>tftpd-hpa</classname> utiliza, por predefinição, <filename>/var/lib/tftpboot</filename>. Poderá ter de ajustar de acordo os exemplos de configuração nesta secção.

source: All <command>in.tftpd</command> alternatives available in &debian; should log TFTP requests to the system logs by default. Some of them support a <userinput>-v</userinput> argument to increase verbosity. It is recommended to check these log messages in case of boot problems as they are a good starting point for diagnosing the cause of errors.
fi: Kaikissa komennon <command>in.tftpd</command> vaihtoehdoissa &debian;issa on vakiona asetus lokin kirjoittamisesta järjestelmälokiin. Jotkin niistä tukevat tarkenninta <userinput>-v</userinput> jolla lokiin kirjoitetaan yksityiskohtaisempaa tietoa. Näiden lokitietojen lukemista suositellaan mikäli käynnistyksessä on pulmia, lokitiedoilla pääsee hyvään alkuun virheiden syytä etsittäessä.
pt: Todas as alternativas do <command>in.tftpd</command> disponíveis em &debian; devem registar, por predefinição, os pedidos TFTP no registo do sistema. Algumas suportam um argumento <userinput>-v</userinput> para aumentar o detalhe. É recomendado verificar essas mensagens de registo no caso de ocorrerem problemas de arranque já que são um bom ponto de partida para diagnosticar a causa dos erros.
