Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/post-install.po
Languages: pt

source: To correctly set up <command>reportbug</command> to use an external mail server, please run the command <command>reportbug --configure</command> and answer <quote>no</quote> to the question if an MTA is available. You will then be asked for the SMTP server to be used for submitting bug reports.
pt: Para configurar correctamente o <command>reportbug</command> para utilizar um servidor de mail externo, por favor corra o comando <command>reportbug --configure</command> e responda <quote>não</quote> à questão se está disponível um MTA. Então ser-lhe-á questionado por um servidor de SMTP para ser utilizado para submeter relatórios de bugs.

source: Configuring the Exim4 Mail Transport Agent
pt: Configurando o Mail Transport Agent Exim4

source: If you would like your system to also handle external e-mail, you will need to reconfigure the <classname>exim4</classname> package<footnote> <para> You can of course also remove <classname>exim4</classname> and replace it with an alternative MTA/MDA. </para> </footnote>:
pt: Se quiser que o seu sistema também lide com e-mail externo, irá necessitar de reconfigurar o pacote <classname>exim4</classname><footnote> <para> Pode, claro, também remover o <classname>exim4</classname> e substitui-lo por um MTA/MDA alternativo. </para> </footnote>:

source: After entering that command (as root), you will be asked if you want split the configuration into small files. If you are unsure, select the default option.
pt: Após introduzir esse comando (como root), ser-lhe-á perguntado se deseja dividir a configuração em pequenos ficheiros. Se não tiver a certeza, escolha a opção por omissão.

source: Next you will be presented with several common mail scenarios. Choose the one that most closely resembles your needs.
pt: De seguida ser-lhe-ão apresentados vários cenários comuns. Escolha o que mais se aproxima das suas necessidades.

source: internet site
pt: site de internet

source: Your system is connected to a network and your mail is sent and received directly using SMTP. On the following screens you will be asked a few basic questions, like your machine's mail name, or a list of domains for which you accept or relay mail.
pt: O seu sistema está ligado a uma rede e o seu correio é enviado e recebido directamente usando o SMTP. Nos ecrãs seguinte ser-lhe-á perguntado algumas questões básicas, como o nome para o correio da sua máquina, ou uma lista de domínios para os quais deseja aceitar e encaminhar o correio.

source: mail sent by smarthost
pt: correio enviado por smarthost

source: In this scenario your outgoing mail is forwarded to another machine, called a <quote>smarthost</quote>, which takes care of sending the message on to its destination. The smarthost also usually stores incoming mail addressed to your computer, so you don't need to be permanently online. That also means you have to download your mail from the smarthost via programs like fetchmail.
pt: Neste cenário o seu mail de saída é encaminhado para outra máquina, chamada de <quote>smarthost</quote>, que se encarrega de enviar a mensagem para o seu destino. O smarthost normalmente também guarda o mail que chega endereçado ao seu computador, para que não necessite de estar sempre online. Isso também significa que tem de fazer o download do seu mail a partir do smarthost com programas como o fetchmail.

source: In a lot of cases the smarthost will be your ISP's mail server, which makes this option very suitable for dial-up users. It can also be a company mail server, or even another system on your own network.
pt: Em muitos casos o smarthost será o servidor de mail do seu ISP, o que torna esta opção muito indicada para utilizadores com dial-up. Pode também ser o servidor de mail de uma empresa, ou mesmo outro sistema na sua rede.

source: mail sent by smarthost; no local mail
pt: mail enviado pelo smarthost; sem mail local

source: This option is basically the same as the previous one except that the system will not be set up to handle mail for a local e-mail domain. Mail on the system itself (e.g. for the system administrator) will still be handled.
pt: Esta opção é basicamente a mesma que a anterior excepto que o sistema não será configurado para lidar com mail para um domínio de e-mail local. Mail do próprio sistema (e.g. para o administrador de sistema) será na mesma tratado.

source: local delivery only
pt: distribuição local apenas

source: This is the option your system is configured for by default.
pt: Esta é a opção, por omissão, com a qual o seu sistema é configurado.

source: no configuration at this time
pt: sem configuração neste momento

source: Choose this if you are absolutely convinced you know what you are doing. This will leave you with an unconfigured mail system &mdash; until you configure it, you won't be able to send or receive any mail and you may miss some important messages from your system utilities.
pt: Escolha esta opção se está absolutamente convencido de que sabe o que está a fazer. Esta opção irá deixar-lhe com o sistema de correio desconfigurado &mdash; até que o configure, não será capaz de enviar ou receber qualquer mail e pode perder algumas mensagens importantes dos utilitários do seu sistema.

source: If none of these scenarios suits your needs, or if you need a finer grained setup, you will need to edit configuration files under the <filename>/etc/exim4</filename> directory after the installation is complete. More information about <classname>exim4</classname> may be found under <filename>/usr/share/doc/exim4</filename>; the file <filename>README.Debian.gz</filename> has further details about configuring <classname>exim4</classname> and explains where to find additional documentation.
pt: Se nenhum destes cenários se adequa ás suas necessidades, ou se necessita de uma configuração mais detalhada, após a instalação estar concluída terá de editar os ficheiros de configuração sob o directório <filename>/etc/exim4</filename>. Mais informação acerca do <classname>exim4</classname> pode ser encontrada sob <filename>/usr/share/doc/exim4</filename>; o ficheiro <filename>README.Debian.gz</filename> tem mais detalhes acerca de como configurar o <classname>exim4</classname> e explica onde encontrar documentação adicional.

source: Note that sending mail directly to the Internet when you don't have an official domain name, can result in your mail being rejected because of anti-spam measures on receiving servers. Using your ISP's mail server is preferred. If you still do want to send out mail directly, you may want to use a different e-mail address than is generated by default. If you use <classname>exim4</classname> as your MTA, this is possible by adding an entry in <filename>/etc/email-addresses</filename>.
pt: Note que enviar mail directamente para a Internet quando não tem um nome de domínio oficial, pode resultar no seu mail ser rejeitado devido a medidas de anti-spam nos servidores que o recebem. É preferível utilizar o servidor de mail do seu ISP. Se mesmo assim quer enviar mail directamente, pode querer utilizar um endereço de e-mail diferente do que é gerado por omissão. Se utilizar o <classname>exim4</classname> como o seu MTA, isto é possível acrescentando uma entrada em <filename>/etc/email-addresses</filename>.

source: Compiling a New Kernel
pt: Compilando um Novo Kernel

source: Why would someone want to compile a new kernel? It is often not necessary since the default kernel shipped with &debian; handles most configurations. Also, &debian; often offers several alternative kernels. So you may want to check first if there is an alternative kernel image package that better corresponds to your hardware. However, it can be useful to compile a new kernel in order to:
pt: Porque é que alguém irá querer compilar um novo kernel? Na grande maioria das vezes não é necessário uma vez que o kernel que vem por omissão com Debian funciona com a maioria das configurações. Além disso, normalmente Debian oferece vários kernels alternativos. Por isso poderá querer verificar se existe um pacote com uma imagem de kernel alternativa que melhor corresponda ao seu hardware. No entanto, poderá ser útil compilar um novo kernel, para:

source: handle special hardware needs, or hardware conflicts with the pre-supplied kernels
pt: tratar de necessidades específicas em termos de hardware, ou conflitos do mesmo com os kernels pré-compilados

source: use options of the kernel which are not supported in the pre-supplied kernels (such as high memory support)
pt: usar opções do kernel que não são suportadas pelos kernels pré-fornecidos (tais como suporte para muita memória)

source: optimize the kernel by removing useless drivers to speed up boot time
pt: optimizar o kernel removendo drivers inúteis para diminuir o tempo de arranque

source: create a monolithic instead of a modularized kernel
pt: criar um kernel monolítico em vez de um kernel modular

source: run an updated or development kernel
pt: correr um kernel actualizado ou de desenvolvimento

source: learn more about linux kernels
pt: aprender mais acerca de kernels linux

source: Kernel Image Management
pt: Gestão das Imagens dos Kernel

source: Don't be afraid to try compiling the kernel. It's fun and profitable.
pt: Não tenha medo de tentar compilar o kernel. É divertido e lucrativo.

source: To compile a kernel the &debian; way, you need some packages: <classname>fakeroot</classname>, <classname>kernel-package</classname>, <classname>linux-source-2.6</classname> and a few others which are probably already installed (see <filename>/usr/share/doc/kernel-package/README.gz</filename> for the complete list).
pt: Para compilar um kernel à maneira Debian, necessita de alguns pacotes: <classname>fakeroot</classname>, <classname>kernel-package</classname>, <classname>kernel-source-2.6</classname> e mais alguns que provavelmente já estarão instalados (veja <filename>/usr/share/doc/kernel-package/README.gz</filename> para a lista completa).

source: This method will make a .deb of your kernel source, and, if you have non-standard modules, make a synchronized dependent .deb of those too. It's a better way to manage kernel images; <filename>/boot</filename> will hold the kernel, the System.map, and a log of the active config file for the build.
pt: Este método irá fazer um .deb da fonte do seu kernel, e, se tiver módulos não-standard, fazer igualmente um .deb dependente sincronizado. É a melhor maneira de gerir as imagens dos kernel; <filename>/boot</filename> irá guardar o kernel, o System.map e um log do ficheiro de configuração activo para a build.

source: Note that you don't <emphasis>have</emphasis> to compile your kernel the <quote>&debian; way</quote>; but we find that using the packaging system to manage your kernel is actually safer and easier. In fact, you can get your kernel sources right from Linus instead of <classname>linux-source-2.6</classname>, yet still use the <classname>kernel-package</classname> compilation method.
pt: Note que você não <emphasis>tem</emphasis> de compilar o seu kernel <quote>à maneira Debian</quote>; mas nós achamos que usar o sistema de pacotes para gerir o seu kernel é na verdade mais seguro e fácil. De facto, pode obter a fonte do kernel directamente do Linus, em vez de <classname>linux-source-2.6</classname>, ainda assim utilize o método de compilação <classname>kernel-package</classname>.

source: Note that you'll find complete documentation on using <classname>kernel-package</classname> under <filename>/usr/share/doc/kernel-package</filename>. This section just contains a brief tutorial.
pt: Note que irá encontrar documentação completa utilizando <classname>kernel-package</classname> sob <filename>/usr/share/doc/kernel-package</filename>. Esta secção apenas contém um breve tutorial.

source: Hereafter, we'll assume you have free rein over your machine and will extract your kernel source to somewhere in your home directory<footnote> <para> There are other locations where you can extract kernel sources and build your custom kernel, but this is easiest as it does not require special permissions. </para> </footnote>. We'll also assume that your kernel version is &kernelversion;. Make sure you are in the directory to where you want to unpack the kernel sources, extract them using <userinput>tar xjf /usr/src/linux-source-&kernelversion;.tar.bz2</userinput> and change to the directory <filename>linux-source-&kernelversion;</filename> that will have been created.
pt: A partir daqui, iremos assumir que tem as rédeas da sua máquina, e irá extrair o seu código-fonte do kernel para algum local dentro do seu directório home<footnote> <para> Existem outras localizações para onde pode extrair o código-fonte dos kernel e construir o seu kernel personalizado, mas esta é a mais simples, uma vez que não requer permissões especiais. </para> </footnote>. Iremos também assumir que a sua versão do kernel é &kernelversion;. Assegure-se que está no directório para onde deseja descompactar as fontes do kernel, extraia-as com <userinput>tar xjf /usr/src/linux-source-&kernelversion;.tar.bz2</userinput> e mude-se para o directório <filename>kernel-source-&kernelversion;</filename> que terá sido criado.

source: Now, you can configure your kernel. Run <userinput>make xconfig</userinput> if X11 is installed, configured and being run; run <userinput>make menuconfig</userinput> otherwise (you'll need <classname>libncurses5-dev</classname> installed). Take the time to read the online help and choose carefully. When in doubt, it is typically better to include the device driver (the software which manages hardware peripherals, such as Ethernet cards, SCSI controllers, and so on) you are unsure about. Be careful: other options, not related to a specific hardware, should be left at the default value if you do not understand them. Do not forget to select <quote>Kernel module loader</quote> in <quote>Loadable module support</quote> (it is not selected by default). If not included, your &debian; installation will experience problems.
pt: Agora, pode configurar o seu kernel. Corra <userinput>make xconfig</userinput> se o seu X11 está instalado, configurado e a correr; corra <userinput>make menuconfig</userinput> caso contrário (irá necessitar da <classname>libncurses5-dev</classname> instalada). Dispense tempo para ler a ajuda online e escolher cuidadosamente as opções. Quando em dúvida, a melhor opção será incluir o gestor de periféricos (o software responsável por gerir os periféricos de hardware, tais como placas de rede - Ethernet -, controladores SCSI e mais) sobre o que está em dúvida. Tenha cuidado: outras opções, não relacionadas com hardware específico, devem ser deixadas com os valores pré-definidos se não compreender o que significam. Não se esqueça de seleccionar o <quote>Kernel module loader</quote> em <quote>Loadable module support</quote> (não está seleccionado de origem). Se não for incluído, a sua instalação Debian poderá vir a ter problemas.

source: Clean the source tree and reset the <classname>kernel-package</classname> parameters. To do that, do <userinput>make-kpkg clean</userinput>.
pt: Limpe a árvore da origem (source tree) e faça reset aos parâmetros do <classname>kernel-package</classname> . Para fazer isso, faça <userinput>make-kpkg clean</userinput>.

source: Now, compile the kernel: <userinput>fakeroot make-kpkg --initrd --revision=custom.1.0 kernel_image</userinput>. The version number of <quote>1.0</quote> can be changed at will; this is just a version number that you will use to track your kernel builds. Likewise, you can put any word you like in place of <quote>custom</quote> (e.g., a host name). Kernel compilation may take quite a while, depending on the power of your machine.
pt: Agora, compile o kernel: <userinput>fakeroot make-kpkg --initrd --revision=custom.1.0 kernel_image</userinput>. O número da versão <quote>1.0</quote> pode ser alterado à vontade; isto é apenas um número de versão que irá usar para manter o registo das suas compilações. Da mesma forma, pode colocar qualquer palavra que deseje no lugar de <quote>custom</quote> (e.g., um host name). A compilação do kernel poderá demorar um pouco, dependendo da capacidade da sua máquina.

source: Once the compilation is complete, you can install your custom kernel like any package. As root, do <userinput>dpkg -i ../&kernelpackage;-&kernelversion;-<replaceable>subarchitecture</replaceable>_custom.1.0_&architecture;.deb</userinput>. The <replaceable>subarchitecture</replaceable> part is an optional sub-architecture, <phrase arch="i386"> such as <quote>686</quote>, </phrase> depending on what kernel options you set. <userinput>dpkg -i</userinput> will install the kernel, along with some other nice supporting files. For instance, the <filename>System.map</filename> will be properly installed (helpful for debugging kernel problems), and <filename>/boot/config-&kernelversion;</filename> will be installed, containing your current configuration set. Your new kernel package is also clever enough to automatically update your boot loader to use the new kernel. If you have created a modules package, you'll need to install that package as well.
pt: Quando a compilação estiver completa, poderá instalar o seu kernel personalizado como qualquer outro pacote. Como root, faça <userinput>dpkg -i ../&kernelpackage;-&kernelversion;-<replaceable>subarchitecture</replaceable>_custom.1.0_&architecture;.deb</userinput>. A parte <replaceable>subarchitecture</replaceable> é uma sub-arquitectura opcional, <phrase arch="i386"> tal como <quote>686</quote>, </phrase> dependendo das opções com que configurou o kernel. <userinput>dpkg -i</userinput> irá instalar o kernel, juntamente com alguns outros ficheiros de suporte. Por exemplo, o <filename>System.map</filename> irá ser correctamente instalado (ajuda a fazer debug de problemas no kernel), e <filename>/boot/config-&kernelversion;</filename> irá ser instalado, contendo a sua configuração actual. O seu novo pacote de kernel é também suficiente esperto para actualizar automaticamente o seu gestor de arranque para utilizar o novo kernel. Se criou um pacote de módulos, necessita instalar também esse pacote.

source: It is time to reboot the system: read carefully any warning that the above step may have produced, then <userinput>shutdown -r now</userinput>.
pt: É altura de re-iniciar o sistema; leia cuidadosamente qualquer aviso que o passo acima possa ter produzido, e de seguida faça <userinput>shutdown -r now</userinput>.

source: For more information on &debian; kernels and kernel compilation, see the <ulink url="&url-kernel-handbook;">Debian Linux Kernel Handbook</ulink>. For more information on <classname>kernel-package</classname>, read the fine documentation in <filename>/usr/share/doc/kernel-package</filename>.
pt: Para mais informação acerca de kernels Debian e a compilação do kernel, veja a <ulink url="&url-kernel-handbook;">Debian Linux Kernel Handbook</ulink>. Para mais informação acerca de <classname>kernel-package</classname>, leia a boa documentação em <filename>/usr/share/doc/kernel-package</filename>.

source: Recovering a Broken System
pt: Recuperar um Sistema Estragado

source: Sometimes, things go wrong, and the system you've carefully installed is no longer bootable. Perhaps the boot loader configuration broke while trying out a change, or perhaps a new kernel you installed won't boot, or perhaps cosmic rays hit your disk and flipped a bit in <filename>/sbin/init</filename>. Regardless of the cause, you'll need to have a system to work from while you fix it, and rescue mode can be useful for this.
pt: Por vezes, as coisas correm mal, e o sistema que você instalou cuidadosamente já não arranca. Talvez a configuração do carregador de arranque se tenha estragado enquanto experimentava uma alteração, ou talvez o novo kernel que você instalou não arranque, ou talvez raios cósmicos tenham atingido o seu disco rígido e tenham trocado um bit em <filename>/sbin/init</filename>. Seja qual for a causa, você precisa de um sistema que funcione enquanto você o compõe, e o modo de recuperação pode ser útil para isso.

source: To access rescue mode, type <userinput>rescue</userinput> at the <prompt>boot:</prompt> prompt, or boot with the <userinput>rescue/enable=true</userinput> boot parameter. You'll be shown the first few screens of the installer, with a note in the corner of the display to indicate that this is rescue mode, not a full installation. Don't worry, your system is not about to be overwritten! Rescue mode simply takes advantage of the hardware detection facilities available in the installer to ensure that your disks, network devices, and so on are available to you while repairing your system.
pt: Para aceder ao modo de recuperação, escreva <userinput>rescue</userinput> na prompt <prompt>boot:</prompt>, ou arranque com o parâmetro de arranque <userinput>rescue/enable=true</userinput>. Ser-lhe-ão mostrados os primeiros ecrãs do instalador, com uma nota no canto do seu monitor a indicar que este é o modo de recuperação, e não uma instalação completa. Não se preocupe, o seu sistema não está prestes a ser reescrito! O modo de recuperação apenas tira partido das capacidades de detecção de hardware disponíveis no instalador para se certificar que os seus discos, dispositivos de rede, e por aí fora estão disponíveis para si enquanto você repara o seu sistema.

source: Instead of the partitioning tool, you should now be presented with a list of the partitions on your system, and asked to select one of them. Normally, you should select the partition containing the root file system that you need to repair. You may select partitions on RAID and LVM devices as well as those created directly on disks.
pt: Em vez da ferramenta de particionamento, deve ser-lhe apresentada uma lista das partições no seu sistema, e ser-lhe-á pedido que seleccione uma delas. Normalmente, você deverá escolher a partição que contém o sistema de ficheiros raiz que você necessita reparar. Você pode escolher partições em dispositivos RAID e LVM assim como as criadas directamente nos discos.

source: If possible, the installer will now present you with a shell prompt in the file system you selected, which you can use to perform any necessary repairs. <phrase arch="any-x86"> For example, if you need to reinstall the GRUB boot loader into the master boot record of the first hard disk, you could enter the command <userinput>grub-install '(hd0)'</userinput> to do so. </phrase>
pt: Se possível, o instalador irá agora apresentar-lhe uma prompt da shell no sistema de ficheiros que você seleccionou, o qual pode utilizar para executar quaisquer reparações necessárias. <phrase arch="any-x86"> Por exemplo, se você necessitar reinstalar o carregador de arranque GRUB no master boot record do primeiro disco, você pode introduzir o comando <userinput>grub-install '(hd0)'</userinput> para o fazer. </phrase>
