Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/post-install.po
Languages: pt

source: Next Steps and Where to Go From Here
pt: Próximos Passos e Onde Ir a Partir Daqui

source: Shutting down the system
pt: A desligar o sistema

source: To shut down a running &debian-gnu; system, you must not reboot with the reset switch on the front or back of your computer, or just turn off the computer. &debian-gnu; should be shut down in a controlled manner, otherwise files might get lost and/or disk damage might occur. If you run a desktop environment, there is usually an option to <quote>log out</quote> available from the application menu that allows you to shutdown (or reboot) the system.
pt: Para desligar um sistema &debian-gnu; em execução, não deve fazer reboot com o botão de reset na parte da frente ou detrás do seu computador, ou muito simplesmente desligar o computador. &debian-gnu; deve ser desligado de uma forma controlada, caso contrário podem peder-se ficheiros e/ou pode-se danificar o disco. Se corre um ambiente de desktop, normalmente existe disponível uma opção para fazer <quote>log out</quote> a partir do menu de aplicações que lhe permite desligar (ou reiniciar) o sistema.

source: Alternatively you can press the key combination <keycombo> <keycap>Ctrl</keycap> <keycap>Alt</keycap> <keycap>Del</keycap> </keycombo> <phrase arch="powerpc"> or <keycombo> <keycap>Control</keycap> <keycap>Shift</keycap> <keycap>Power</keycap> </keycombo> on Macintosh systems</phrase>. A last option is to log in as root and type one of the commands <command>poweroff</command>, <command>halt</command> or <command>shutdown -h now</command> if either of the key combinations do not work or you prefer to type commands; use <command>reboot</command> to reboot the system.
pt: Em alternativa pode pressionar a combinação de teclas <keycombo> <keycap>Ctrl</keycap> <keycap>Alt</keycap> <keycap>Del</keycap> </keycombo> <phrase arch="powerpc"> ou <keycombo> <keycap>Control</keycap> <keycap>Shift</keycap> <keycap>Power</keycap> </keycombo> em sistemas Macintosh</phrase>. A última opção é fazer login como root e escrever um dos comandos <command>poweroff</command>, <command>halt</command> ou <command>shutdown -h now</command> se as combinações de teclas não funcionarem ou se preferir escrever comandos; utilize <command>reboot</command> para reiniciar o sistema.

source: If You Are New to Unix
pt: Se Você é Novo em Unix

source: If you are new to Unix, you probably should go out and buy some books and do some reading. A lot of valuable information can also be found in the <ulink url="&url-debian-reference;">Debian Reference</ulink>. This <ulink url="&url-unix-faq;">list of Unix FAQs</ulink> contains a number of UseNet documents which provide a nice historical reference.
pt: Se você é novo em Unix, você provavelmente deve sair e comprar alguns livros e fazer algumas leituras. Muita informação valiosa pode também ser encontrada em <ulink url="&url-debian-reference;">Debian Reference</ulink>. Esta <ulink url="&url-unix-faq;">lista de FAQs de Unix</ulink> contém um número de documentos da UseNet que disponibilizam boas referências históricas.

source: Linux is an implementation of Unix. The <ulink url="&url-ldp;">Linux Documentation Project (LDP)</ulink> collects a number of HOWTOs and online books relating to Linux. Most of these documents can be installed locally; just install the <classname>doc-linux-html</classname> package (HTML versions) or the <classname>doc-linux-text</classname> package (ASCII versions), then look in <filename>/usr/share/doc/HOWTO</filename>. International versions of the LDP HOWTOs are also available as &debian; packages.
pt: O Linux é uma implementação de Unix. O <ulink url="&url-ldp;"> Projecto de Documentação de Linux (LDP)</ulink> junta inúmeros HOWTOs e livros online relacionados com Linux. A maioria destes documentos pode ser instalada localmente; basta que instale o pacote <classname>doc-linux-html</classname> (versão HTML) ou o pacote <classname>doc-linux-text</classname> (versão ASCII), e depois procure em <filename>/usr/share/doc/HOWTO</filename>. Versões internacionais dos HOWTOs LDP também estão disponíveis como pacotes &debian;.

source: Orienting Yourself to &debian;
pt: Oriente-se Para &debian;

source: &debian; is a little different from other distributions. Even if you're familiar with Linux in other distributions, there are things you should know about &debian; to help you to keep your system in a good, clean state. This chapter contains material to help you get oriented; it is not intended to be a tutorial for how to use &debian;, but just a very brief glimpse of the system for the very rushed.
pt: O &debian; é ligeiramente diferente das outras distribuições. Mesmo se está familiarizado com outras distribuições de Linux, há algumas coisas que deverá saber sobre &debian; para o ajudar a manter o seu sistema limpo e eficiente. Este capítulo contém material para o orientar; não é intenção ser um tutorial sobre como usar &debian;, mas apenas um breve piscar de olhos do sistema, para os muito apressados.

source: &debian; Packaging System
pt: Sistema de Pacotes &debian;

source: The most important concept to grasp is the &debian; packaging system. In essence, large parts of your system should be considered under the control of the packaging system. These include: <itemizedlist> <listitem><para> <filename>/usr</filename> (excluding <filename>/usr/local</filename>) </para></listitem> <listitem><para> <filename>/var</filename> (you could make <filename>/var/local</filename> and be safe in there) </para></listitem> <listitem><para> <filename>/bin</filename> </para></listitem> <listitem><para> <filename>/sbin</filename> </para></listitem> <listitem><para> <filename>/lib</filename> </para></listitem> </itemizedlist> For instance, if you replace <filename>/usr/bin/perl</filename>, that will work, but then if you upgrade your <classname>perl</classname> package, the file you put there will be replaced. Experts can get around this by putting packages on <quote>hold</quote> in <command>aptitude</command>.
pt: O conceito mais importante para realçar é o sistema de pacotes Debian. Na sua essência, grande parte do seu sistema deve ser considerado sob o controlo do sistema de pacotes. Incluem-se: <itemizedlist> <listitem><para> <filename>/usr</filename> (excluindo <filename>/usr/local</filename>) </para></listitem> <listitem><para> <filename>/var</filename> (poderá fazer <filename>/var/local</filename> e ficar lá seguro) </para></listitem> <listitem><para> <filename>/bin</filename> </para></listitem> <listitem><para> <filename>/sbin</filename> </para></listitem> <listitem><para> <filename>/lib</filename> </para></listitem> </itemizedlist> Por exemplo, se substituir <filename>/usr/bin/perl</filename>, isso irá funcionar, mas se fizer um upgrade ao seu pacote <classname>perl</classname> , o ficheiro que lá puser irá ser substituído. Utilizadores mais avançados poderão contornar isto, ao colocar pacotes como hold no <command>aptitude</command>.

source: One of the best installation methods is apt. You can use the command line version <command>apt-get</command> or full-screen text version <application>aptitude</application>. Note apt will also let you merge main, contrib, and non-free so you can have export-restricted packages as well as standard versions.
pt: Um dos melhores métodos de instalação é o apt. Pode usar a versão de linha de comandos <command>apt-get</command> ou a versão de texto em ecrã inteiro <application>aptitude</application>. Note que o apt deixá-lo-á fazer a junção de main, contrib e non-free, de forma a que possa ter pacotes com restrições de exportação assim como versões padrão.

source: Application Version Management
pt: Aplicação de Gestão de Versões

source: Alternative versions of applications are managed by update-alternatives. If you are maintaining multiple versions of your applications, read the update-alternatives man page.
pt: Versões alternativas das aplicações são geridas por alternativas de actualização. Se está a manter múltiplas versões das suas aplicações, leia a página do manual update-alternatives.

source: Cron Job Management
pt: Gestão dos Cron Jobs

source: Any jobs under the purview of the system administrator should be in <filename>/etc</filename>, since they are configuration files. If you have a root cron job for daily, weekly, or monthly runs, put them in <filename>/etc/cron.{daily,weekly,monthly}</filename>. These are invoked from <filename>/etc/crontab</filename>, and will run in alphabetic order, which serializes them.
pt: Quaisquer tarefas debaixo do âmbito do administrador do sistema, devem estar colocadas em <filename>/etc</filename>, uma vez que são ficheiros de configuração. Se tem um cron job para root, para correr diariamente, semanalmente, ou mensalmente, coloque-os em <filename>/etc/cron.{daily,weekly,monthly}</filename>. Estes serão invocados a partir de <filename>/etc/crontab</filename>, e correrão por ordem alfabética o que os serializa.

source: On the other hand, if you have a cron job that (a) needs to run as a special user, or (b) needs to run at a special time or frequency, you can use either <filename>/etc/crontab</filename>, or, better yet, <filename>/etc/cron.d/whatever</filename>. These particular files also have an extra field that allows you to stipulate the user account under which the cron job runs.
pt: Por outro lado, se tem um cron job que (a) necessita de ser corrido como um utilizador especial ou, (b) necessita ser corrido num tempo ou frequência especiais, pode usar tanto <filename>/etc/crontab</filename>, ou, melhor ainda, <filename>/etc/cron.d/whatever</filename>. Estes ficheiros também têm um campo extra que lhe permite estipular a conta do utilizador que sob a qual corre o cron job.

source: In either case, you just edit the files and cron will notice them automatically. There is no need to run a special command. For more information see cron(8), crontab(5), and <filename>/usr/share/doc/cron/README.Debian</filename>.
pt: Em qualquer um dos casos, basta editar os ficheiros e o cron irá notá-lo automaticamente. Não há necessidade de correr um comando especial. Para mais informação veja cron(8), crontab(5), e <filename>/usr/share/doc/cron/README.Debian</filename>.

source: Further Reading and Information
pt: Leitura e Informação Adicional

source: If you need information about a particular program, you should first try <userinput>man <replaceable>program</replaceable></userinput>, or <userinput>info <replaceable>program</replaceable></userinput>.
pt: Se necessita de informação sobre um programa em particular, deverá tentar primeiro o programa <userinput>man <replaceable>program</replaceable></userinput>, ou <userinput>info <replaceable>program</replaceable></userinput>.

source: There is lots of useful documentation in <filename>/usr/share/doc</filename> as well. In particular, <filename>/usr/share/doc/HOWTO</filename> and <filename>/usr/share/doc/FAQ</filename> contain lots of interesting information. To submit bugs, look at <filename>/usr/share/doc/debian/bug*</filename>. To read about &debian;-specific issues for particular programs, look at <filename>/usr/share/doc/(package name)/README.Debian</filename>.
pt: Há uma grande quantidade de informação útil em <filename>/usr/share/doc</filename>. Em particular, <filename>/usr/share/doc/HOWTO</filename> e <filename>/usr/share/doc/FAQ</filename> contêm grande quantidade de informação interessante. Para enviar bugs, veja o ficheiro <filename>/usr/share/doc/debian/bug*</filename>. Para ler sobre assuntos específicos de Debian relativos a determinados programas, veja o ficheiro <filename>/usr/share/doc/(package name)/README.Debian</filename>.

source: The <ulink url="http://www.debian.org/">Debian web site</ulink> contains a large quantity of documentation about &debian;. In particular, see the <ulink url="http://www.debian.org/doc/FAQ/">Debian GNU/Linux FAQ</ulink> and the <ulink url="http://www.debian.org/doc/user-manuals#quick-reference">Debian Reference</ulink>. An index of more &debian; documentation is available from the <ulink url="http://www.debian.org/doc/ddp">Debian Documentation Project</ulink>. The &debian; community is self-supporting; to subscribe to one or more of the Debian mailing lists, see the <ulink url="http://www.debian.org/MailingLists/subscribe"> Mail List Subscription</ulink> page. Last, but not least, the <ulink url="http://lists.debian.org/">Debian Mailing List Archives</ulink> contain a wealth of information on &debian;.
pt: O <ulink url="http://www.debian.org/">website Debian</ulink> contém uma grande quantidade de documentação acerca de Debian. Veja em particular o <ulink url="http://www.debian.org/doc/FAQ/">Debian FAQ</ulink> e a <ulink url="http://www.debian.org/doc/user-manuals#quick-reference">Referência Debian</ulink>. Está disponível um índice com mais documentação Debian a partir do <ulink url="http://www.debian.org/doc/ddp">Debian Documentation Project</ulink>. A comunidade Debian é auto-suportada; para subscrever uma ou mais mailing lists Debian, veja a página <ulink url="http://www.debian.org/MailingLists/subscribe"> Mail List Subscription</ulink>. E por último, mas não menos importante, <ulink url="http://lists.debian.org/">os arquivos das Mailing Lists Debian</ulink> contêm informação rica acerca de Debian.

source: A general source of information on GNU/Linux is the <ulink url="http://www.tldp.org/">Linux Documentation Project</ulink>. There you will find the HOWTOs and pointers to other very valuable information on parts of a GNU/Linux system.
pt: Uma fonte genérica de informação sobre GNU/Linux é o <ulink url="http://www.tldp.org/">Projecto de Documentação Linux</ulink>. Aí, irá encontrar HOWTOs e caminhos para outras informações valiosas sobre partes de um sistema GNU/Linux.

source: Setting Up Your System To Use E-Mail
pt: Configurar o Seu Sistema Para Utilizar E-Mail

source: Today, email is an important part of many people's life. As there are many options as to how to set it up, and as having it set up correctly is important for some &debian; utilities, we will try to cover the basics in this section.
pt: Actualmente, o email é uma parte importante da vida de muitas pessoas. Como existem muitas opções para o configurar, e tê-lo correctamente configurado é importante para alguns utilitários Debian, nós tentaremos cobrir o básico nesta secção.

source: There are three main functions that make up an e-mail system. First there is the <firstterm>Mail User Agent</firstterm> (MUA) which is the program a user actually uses to compose and read mails. Then there is the <firstterm>Mail Transfer Agent</firstterm> (MTA) that takes care of transferring messages from one computer to another. And last there is the <firstterm>Mail Delivery Agent</firstterm> (MDA) that takes care of delivering incoming mail to the user's inbox.
pt: Existem três funções principais que compõem um sistema de e-mail. Primeiro existe o <firstterm>Mail User Agent</firstterm> (MUA) que é o programa que o utilizador utiliza para escrever e para ler mails. Depois existe o <firstterm>Mail Transfer Agent</firstterm> (MTA) que toma conta da transferência de mensagens de um computador para outro. E por último existe o <firstterm>Mail Delivery Agent</firstterm> (MDA) que toma conta da entrega do mail que chega á caixa de correio do utilizador.

source: These three functions can be performed by separate programs, but they can also be combined in one or two programs. It is also possible to have different programs handle these functions for different types of mail.
pt: Estas três funções podem ser executadas por programas distintos, mas eles também podem ser combinados num ou dois programas. Também é possível ter diferentes programas para lidar com estas funções para diferentes tipos de mail.

source: On Linux and Unix systems <command>mutt</command> is historically a very popular MUA. Like most traditional Linux programs it is text based. It is often used in combination with <command>exim</command> or <command>sendmail</command> as MTA and <command>procmail</command> as MDA.
pt: Em sistemas Linux e Unix o <command>mutt</command> é historicamente uma MUA muito popular. Tal como a maioria dos programas tradicionais de Linux é em modo de texto. É muitas vezes utilizado em combinação com o <command>exim</command> ou com o <command>sendmail</command> como MTA e com o <command>procmail</command> como MDA.

source: With the increasing popularity of graphical desktop systems, the use of graphical e-mail programs like GNOME's <command>evolution</command>, KDE's <command>kmail</command> or Mozilla's <command>thunderbird</command> (in &debian; available as <command>icedove</command><footnote> <para> The reason that <command>thunderbird</command> has been renamed to <command>icedove</command> in &debian; has to do with licensing issues. Details are outside the scope of this manual. </para> </footnote>) is becoming more popular. These programs combine the function of a MUA, MTA and MDA, but can &mdash; and often are &mdash; also be used in combination with the traditional Linux tools.
pt: Com a crescente popularidade dos sistemas desktop gráficos, a utilização de programas de e-mail gráficos, tais como o <command>evolution</command> do GNOME, o <command>kmail</command> do KDE ou o <command>thunderbird</command> da Mozilla (em Debian disponível como <command>icedove</command><footnote> <para> A razão porque o <command>thunderbird</command> foi renomeado para <command>icedove</command> em Debian tem a ver com problemas com licenças. Os detalhes estão fora do âmbito deste manual. </para> </footnote>) estão-se a tornar mais populares. Estes programas combinam as funções de uma MUA, MTA e MDA, mas podem &mdash; e muitas vezes são &mdash; também utilizados em combinação com as ferramentas tradicionais de Linux.

source: Default E-Mail Configuration
pt: Configuração Predefinida de E-Mail

source: Even if you are planning to use a graphical mail program, it is important that a traditional MTA/MDA is also installed and correctly set up on your &debian-gnu; system. Reason is that various utilities running on the system<footnote> <para> Examples are: <command>cron</command>, <command>quota</command>, <command>logcheck</command>, <command>aide</command>, &hellip; </para> </footnote> can send important notices by e-mail to inform the system administrator of (potential) problems or changes.
pt: Mesmo que esteja a planear utilizar um programa de mail gráfico, é importante que um MTA/MDA tradicional também esteja instalado e correctamente configurado no seu sistema &debian-gnu;. A razão é que vários utilitários que correm no sistema<footnote> <para> Exemplos são: <command>cron</command>, <command>quota</command>, <command>logcheck</command>, <command>aide</command>, &hellip; </para> </footnote> podem enviar avisos importantes por e-mail para informar o administrador do sistema de (potenciais) problemas ou alterações.

source: For this reason the packages <classname>exim4</classname> and <classname>mutt</classname> will be installed by default (provided you did not unselect the <quote>standard</quote> task during the installation). <classname>exim4</classname> is a combination MTA/MDA that is relatively small but very flexible. By default it will be configured to only handle e-mail local to the system itself and e-mails addressed to the system administrator (root account) will be delivered to the regular user account created during the installation<footnote> <para> The forwarding of mail for root to the regular user account is configured in <filename>/etc/aliases</filename>. If no regular user account was created, the mail will of course be delivered to the root account itself. </para> </footnote>.
pt: Por esta razão serão, por omissão, instalados os pacotes <classname>exim4</classname> e <classname>mutt</classname> (desde que não desseleccione a tarefa <quote>standard</quote> durante a instalação). O <classname>exim4</classname> é uma combinação MTA/MDA que é relativamente pequena mas muito flexível. Por omissão será configurado para apenas lidar com e-mail local ao próprio sistema e e-mails endereçados ao administrador de sistema (conta root) serão entregues á conta de utilizador regular criada durante a instalação<footnote> <para> O encaminhamento do mail para o root para a conta de utilizador regular é configurado em <filename>/etc/aliases</filename>. Se não tiver sido criada nenhuma conta de utilizador regular, o mail irá, claro, ser entregue para a própria conta root. </para> </footnote>.

source: When system e-mails are delivered they are added to a file in <filename>/var/mail/<replaceable>account_name</replaceable></filename>. The e-mails can be read using <command>mutt</command>.
pt: Quando os e-mails são entregues são acrescentados a um ficheiro <filename>/var/mail/<replaceable>nome_da_conta</replaceable></filename>. Os e-mails podem ser lidos utilizando o <command>mutt</command>.

source: Sending E-Mails Outside The System
pt: Enviar E-Mails Para Fora do Sistema

source: As mentioned earlier, the installed &debian; system is only set up to handle e-mail local to the system, not for sending mail to others nor for receiving mail from others.
pt: Tal como foi mencionado anteriormente, o sistema Debian instalado é apenas configurado para lidar com e-mail local ao sistema, e não para enviar e-mail para outros nem para receber mail de outros.

source: If you would like <classname>exim4</classname> to handle external e-mail, please refer to the next subsection for the basic available configuration options. Make sure to test that mail can be sent and received correctly.
pt: Se quiser que o <classname>exim4</classname> lide com e-mail externo, para as opções de configuração básica disponíveis por favor veja a sub-secção seguinte. Assegure-se que testa se o mail pode ser correctamente entregue e recebido.

source: If you intend to use a graphical mail program and use a mail server of your Internet Service Provider (ISP) or your company, there is not really any need to configure <classname>exim4</classname> for handling external e-mail. Just configure your favorite graphical mail program to use the correct servers to send and receive e-mail (how is outside the scope of this manual).
pt: Se tenciona utilizar um programa de mail gráfico e utilizar um servidor de mail do seu Provedor de Serviço de Internet (ISP) ou da sua empresa, não há necessidade de configurar o <classname>exim4</classname> para lidar com e-mail externo. Configure apenas o seu programa de mail gráfico para utilizar os servidores correctos para enviar e para receber e-mail (como, está fora do âmbito deste manual).

source: However, in that case you may need to configure individual utilities to correctly send e-mails. One such utility is <command>reportbug</command>, a program that facilitates submitting bug reports against &debian; packages. By default it expects to be able to use <classname>exim4</classname> to submit bug reports.
pt: No entanto, nesse caso pode ter de configurar utilitários individuais para enviar e-mails correctamente. Um desses utilitários é o <command>reportbug</command>, um programa que facilita a submissão de relatos de bugs acerca de pacotes Debian. Por omissão este espera ser capaz de utilizar o <classname>exim4</classname> para submeter relatos de bugs.
