Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/post-install.po
Languages: pt

source: If the installer cannot run a usable shell in the root file system you selected, perhaps because the file system is corrupt, then it will issue a warning and offer to give you a shell in the installer environment instead. You may not have as many tools available in this environment, but they will often be enough to repair your system anyway. The root file system you selected will be mounted on the <filename>/target</filename> directory.
pt: Se o instalador não conseguir correr uma shell utilizável no sistema de ficheiros raiz que você escolheu, talvez porque o sistema de ficheiros está corrompido, então irá lançar um aviso e oferecer-se para em vez disso dar-lhe uma shell no ambiente do instalador. Você poderá não ter tantos utilitários disponíveis neste ambiente, mas muitas vezes serão suficientes para reparar o seu sistema. O sistema de ficheiros raiz que você seleccionou será montado no directório <filename>/target</filename>.

source: In either case, after you exit the shell, the system will reboot.
pt: Em qualquer dos casos, após você sair da shell, o sistema irá reiniciar.

source: Finally, note that repairing broken systems can be difficult, and this manual does not attempt to go into all the things that might have gone wrong or how to fix them. If you have problems, consult an expert.
pt: Finalmente, note que reparar sistemas estragados pode ser difícil, e este manual não tenta desenvolver todas as coisas que possam ter corrido mal e como as corrigir. Se você tiver problemas, consulte um especialista.
