Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/using-d-i.po
Languages: es

source: &d-i; allows you to set up encrypted partitions. Every file you write to such a partition is immediately saved to the device in encrypted form. Access to the encrypted data is granted only after entering the <firstterm>passphrase</firstterm> used when the encrypted partition was originally created. This feature is useful to protect sensitive data in case your laptop or hard drive gets stolen. The thief might get physical access to the hard drive, but without knowing the right passphrase, the data on the hard drive will look like random characters.
es: &d-i; permite la configuración de particiones cifradas. Cualquier fichero que se guarde en una partición de estas características se guardará al dispositivo cifrado. El acceso a los datos sólo se puede conseguir una vez haya introducido la <firstterm>clave</firstterm> utilizada para crear originalmente la partición cifrada. Esta función es útil para proteger datos sensibles en caso de que alguien robe su portátil o disco duro. El ladrón podrá lograr acceder al disco duro pero los datos en el disco parecerán ser caracteres aleatorios y no podrá acceder a los mismos si no sabe la clave correcta.

source: The two most important partitions to encrypt are: the home partition, where your private data resides, and the swap partition, where sensitive data might be stored temporarily during operation. Of course, nothing prevents you from encrypting any other partitions that might be of interest. For example <filename>/var</filename> where database servers, mail servers or print servers store their data, or <filename>/tmp</filename> which is used by various programs to store potentially interesting temporary files. Some people may even want to encrypt their whole system. The only exception is the <filename>/boot</filename> partition which must remain unencrypted, because currently there is no way to load the kernel from an encrypted partition.
es: Las particiones más importantes a cifrar son: la partición «home» que es donde se guardan sus datos privados y la partición de intercambio («swap») ya que pueden guardarse datos sensibles en ésta durante la operación del sistema. Por supuesto, nada impide que vd. cifre otras particiones que podrían ser de interés. Por ejemplo <filename>/var</filename>, que es donde se guardan los datos de los sistemas de base de datos, servidores de correo o servidores de impresora, o <filename>/tmp</filename>, que lo utilizan algunos programas para almacenar algunos datos temporales que pudieran ser de interés. Algunos usuarios pueden querer incluso cifrar todo su sistema. La única excepción es que la partición <filename>/boot</filename> debe permanecer sin cifrar ya que de momento no hay ninguna forma de cargar un núcleo de una partición cifrada.

source: Please note that the performance of encrypted partitions will be less than that of unencrypted ones because the data needs to be decrypted or encrypted for every read or write. The performance impact depends on your CPU speed, chosen cipher and a key length.
es: Tenga en cuenta que el rendimiento de las particiones cifradas será peor que el de las particiones sin cifrar porque se tienen que descifrar o cifrar los datos en cada acceso de lectura o escritura. El impacto en el rendimiento dependen de la velocidad de su CPU, y del cifrado y longitud de clave escogidos.

source: To use encryption, you have to create a new partition by selecting some free space in the main partitioning menu. Another option is to choose an existing partition (e.g. a regular partition, an LVM logical volume or a RAID volume). In the <guimenu>Partition settings</guimenu> menu, you need to select <guimenuitem>physical volume for encryption</guimenuitem> at the <menuchoice> <guimenu>Use as:</guimenu> </menuchoice> option. The menu will then change to include several cryptographic options for the partition.
es: Debe crear una nueva partición en el menú de particionado seleccionando espacio libre si quiere utilizar el cifrado. Otra opción es utilizar una partición existente (p.ej. una partición normal, o un volumen lógico LVM o RAID). Tiene que seleccionar <guimenuitem>volumen físico para cifrado</guimenuitem> en el menú <guimenu>Configuración de la partición</guimenu> en la opción <menuchoice> <guimenu>Utilizar como:</guimenu> </menuchoice>. El menú cambiará para mostrar distintas opciones criptográficas para la partición.

source: &d-i; supports several encryption methods. The default method is <firstterm>dm-crypt</firstterm> (included in newer Linux kernels, able to host LVM physical volumes), the other is <firstterm>loop-AES</firstterm> (older, maintained separately from the Linux kernel tree). Unless you have compelling reasons to do otherwise, it is recommended to use the default.
es: Puede utilizar distintos métodos de cifrado en &d-i;. El método por omisión es <firstterm>dm-crypt</firstterm> (disponible en las últimas versiones del núcleo de Linux que pueden incluir volúmenes LVM físicos) y la otra es <firstterm>loop-AES</firstterm> (más antigua y mantenida de forma separada del árbol del núcleo de Linux). Se le recomienda la primera opción a no ser que tenga razones importantes para no utilizarla.

source: First, let's have a look at the options available when you select <userinput>Device-mapper (dm-crypt)</userinput> as the encryption method. As always: when in doubt, use the defaults, because they have been carefully chosen with security in mind.
es: En primer lugar veamos las opciones disponibles cuando seleccione como método de cifrado <userinput>Device-mapper (dm-crypt)</userinput>. Como siempre: cuando tenga dudas utilice los valores por omisión, se han escogido con mucho cuidado pensando en la seguridad de su sistema.

source: Encryption: <userinput>aes</userinput>
es: Cifrado: <userinput>aes</userinput>

source: This option lets you select the encryption algorithm (<firstterm>cipher</firstterm>) which will be used to encrypt the data on the partition. &d-i; currently supports the following block ciphers: <firstterm>aes</firstterm>, <firstterm>blowfish</firstterm>, <firstterm>serpent</firstterm>, and <firstterm>twofish</firstterm>. It is beyond the scope of this document to discuss the qualities of these different algorithms, however, it might help your decision to know that in 2000, <emphasis>AES</emphasis> was chosen by the American National Institute of Standards and Technology as the standard encryption algorithm for protecting sensitive information in the 21st century.
es: Esta opción le permite seleccionar el algoritmo de cifrado (<firstterm>cifra</firstterm>) que se utiliza para cifrar los datos en la partición. Actualmente &d-i; permite el uso de los siguientes cifrados de bloque: <firstterm>aes</firstterm>, <firstterm>blowfish</firstterm>, <firstterm>serpent</firstterm>, y <firstterm>twofish</firstterm>. La discusión de la calidad de los distintos algoritmos de cifrado queda fuera del alcance de este documento. Sin embargo, puede ayudarle a tomar una decisión el hecho de que en el año 2000 el Instituto Nacional de Estándares y Tecnología Norteamericano («American National Institute of Standards and Technology», NIST) escogió AES como el algoritmo de cifrado estándar para proteger información sensible en el siglo XXI.

source: Key size: <userinput>256</userinput>
es: Longitud de clave: <userinput>256</userinput>

source: Here you can specify the length of the encryption key. With a larger key size, the strength of the encryption is generally improved. On the other hand, increasing the length of the key usually has a negative impact on performance. Available key sizes vary depending on the cipher.
es: En este punto puede especificar la longitud de la clave de cifrado. El cifrado es mejor cuanto mayor sea la longitud de cifrado. Pero, por otro lado, un incremento en el tamaño de la clave de cifrado tiene un impacto negativo en el rendimiento. En función del cifrado utilizado dispondrá de distintos tamaños de longitud de clave.

source: IV algorithm: <userinput>cbc-essiv:sha256</userinput>
es: Algoritmo de VI: <userinput>cbc-essiv:sha256</userinput>

source: The <firstterm>Initialization Vector</firstterm> or <firstterm>IV</firstterm> algorithm is used in cryptography to ensure that applying the cipher on the same <firstterm>clear text</firstterm> data with the same key always produces a unique <firstterm>cipher text</firstterm>. The idea is to prevent the attacker from deducing information from repeated patterns in the encrypted data.
es: El algoritmo del <firstterm>Vector de Inicialización</firstterm> o <firstterm>VI</firstterm> (IV en inglés) se utiliza en criptografía para asegurar que la aplicación del cifrado en los mismos datos de <firstterm>texto en claro</firstterm> con la misma clave generan siempre un <firstterm>texto cifrado</firstterm> único. El objetivo es impedir que un atacante pueda deducir información basándose en patrones repetidos en los datos cifrados.

source: From the provided alternatives, the default <userinput>cbc-essiv:sha256</userinput> is currently the least vulnerable to known attacks. Use the other alternatives only when you need to ensure compatibility with some previously installed system that is not able to use newer algorithms.
es: De las alternativas disponibles el valor por omisión <userinput>cbc-essiv:sha256</userinput> es actualmente el menos vulnerable a ataques conocidos. Utilice las otras alternativas sólo si tiene que asegurar compatibilidad con algunos sistemas instalados previamente que no sean capaces de utilizar los nuevos algoritmos.

source: Encryption key: <userinput>Passphrase</userinput>
es: Clave de cifrado: <userinput>Frase de contraseña</userinput>

source: Here you can choose the type of the encryption key for this partition.
es: Aquí puede introducir el tipo de clave de cifrado para esta partición.

source: Passphrase
es: Frase de contraseña

source: The encryption key will be computed<footnote> <para> Using a passphrase as the key currently means that the partition will be set up using <ulink url="&url-luks;">LUKS</ulink>. </para></footnote> on the basis of a passphrase which you will be able to enter later in the process.
es: La clave de cifrado se computará<footnote> <para> La utilización de una contraseña como clave significa que la partición se configurará utilizando <ulink url="&url-luks;">LUKS</ulink>. </para></footnote> basándose en la contraseña que podrá introducir en el proceso más adelante.

source: Random key
es: Clave aleatoria

source: A new encryption key will be generated from random data each time you try to bring up the encrypted partition. In other words: on every shutdown the content of the partition will be lost as the key is deleted from memory. (Of course, you could try to guess the key with a brute force attack, but unless there is an unknown weakness in the cipher algorithm, it is not achievable in our lifetime.)
es: Se generará una nueva clave de cifrado con valores aleatorios cada vez que se arranque la partición cifrada. En otras palabras: cada vez que se reinicie el sistema el contenido de la partición se perderá al borrarse la clave de la memoria. Por supuesto, podría intentar adivinar la contraseña a través de un ataque de fuerza bruta pero, a no ser que haya una debilidad desconocida en el algoritmo de cifrado, no es algo realizable en un tiempo razonable.

source: Random keys are useful for swap partitions because you do not need to bother yourself with remembering the passphrase or wiping sensitive information from the swap partition before shutting down your computer. However, it also means that you will <emphasis>not</emphasis> be able to use the <quote>suspend-to-disk</quote> functionality offered by newer Linux kernels as it will be impossible (during a subsequent boot) to recover the suspended data written to the swap partition.
es: Las claves aleatorias son útiles para las particiones de intercambio porque no es deseable acordarse de una frase de contraseña ni es recomendable borrar la información sensible de dicha partición antes de apagar su sistema. Sin embargo esto también significa que <emphasis>no</emphasis> podrá utilizar la funcionalidad <quote>suspend-to-disk</quote> (suspensión a disco, N. del T.) ofrecida por los nuevos núcleos ya que será imposible (en el rearranque posterior del sistema) recuperar los datos de la suspensión del sistema guardados en la partición de intercambio.

source: Erase data: <userinput>yes</userinput>
es: Borrar los datos: <userinput>sí</userinput>

source: Determines whether the content of this partition should be overwritten with random data before setting up the encryption. This is recommended because it might otherwise be possible for an attacker to discern which parts of the partition are in use and which are not. In addition, this will make it harder to recover any leftover data from previous installations<footnote><para> It is believed that the guys from three-letter agencies can restore the data even after several rewrites of the magnetooptical media, though. </para></footnote>.
es: Indica si debería borrarse el contenido de la partición con datos aleatorios antes de configurar el cifrado. Se recomienda hacer esto porque en caso contrario un posible atacante podría determinar qué partes de la partición se están utilizando y cuáles no. Además, esto hará más difícil la recuperación de datos que permanecieran en la partición asociados a instalaciones previas<footnote><para> Se cree, sin embargo, que las personas que trabajan en agencias gubernamentales de «tres letras» (FBI, NSA, CIA, N. del T.) pueden recuperar los datos aunque se hayan realizado varias escrituras en medios magneto-ópticos. </para></footnote>.

source: If you select <menuchoice> <guimenu>Encryption method:</guimenu> <guimenuitem>Loopback (loop-AES)</guimenuitem> </menuchoice>, the menu changes to provide the following options:
es: El menú cambiará si selecciona <menuchoice> <guimenu>Método de cifrado:</guimenu> <guimenuitem>Loopback (loop-AES)</guimenuitem> </menuchoice> y se presentarán las siguientes opciones:

source: Encryption: <userinput>AES256</userinput>
es: Cifrado: <userinput>AES256</userinput>

source: For loop-AES, unlike dm-crypt, the options for cipher and key size are combined, so you can select both at the same time. Please see the above sections on ciphers and key sizes for further information.
es: En el caso de loop-AES, y a diferencia de dm-crypt, están combinadas las opciones de cifrado y tamaño de clave de forma que puede seleccionar ambas al mismo tiempo. Consulte la información previa sobre cifrados y longitudes de clave para más información.

source: Encryption key: <userinput>Keyfile (GnuPG)</userinput>
es: Clave de cifrado: <userinput>Fichero de clave (GnuPG)</userinput>

source: Here you can select the type of the encryption key for this partition.
es: Aquí puede seleccionar el tipo de clave de cifrado para esta partición.

source: Keyfile (GnuPG)
es: Fichero de clave (GnuPG)

source: The encryption key will be generated from random data during the installation. Moreover this key will be encrypted with <application>GnuPG</application>, so to use it, you will need to enter the proper passphrase (you will be asked to provide one later in the process).
es: La clave de cifrado se generará basándose en datos aleatorios durante la instalación. Sin embargo, esta clave se cifrará con <application>GnuPG</application> por lo que, para poder utilizarla, se le preguntará una contraseña (que se le solicitará durante el proceso).

source: Please see the section on random keys above.
es: Consulte la sección precedente si desea más información de las claves aleatorias.

source: Please see the the section on erasing data above.
es: Consulte la sección precedente si desea más información del borrado de datos.

source: After you have selected the desired parameters for your encrypted partitions, return back to the main partitioning menu. There should now be a new menu item called <guimenu>Configure encrypted volumes</guimenu>. After you select it, you will be asked to confirm the deletion of data on partitions marked to be erased and possibly other actions such as writing a new partition table. For large partitions this might take some time.
es: Una vez ha seleccionado los parámetros para su partición cifrada debe volver al menú de particionado principal. Aquí debería encontrar un nuevo elemento del menú llamado <guimenu>Configurar los volúmenes cifrados</guimenu>. Una vez lo seleccione se le pedirá confirmación para borrar los datos de las particiones marcadas para ser borradas así como otras opciones como, por ejemplo, la escritura de la tabla de particiones en disco. Estas tareas tardarán un tiempo si está trabajando con particiones grandes.

source: Next you will be asked to enter a passphrase for partitions configured to use one. Good passphrases should be longer than 8 characters, should be a mixture of letters, numbers and other characters and should not contain common dictionary words or information easily associable with you (such as birthdates, hobbies, pet names, names of family members or relatives, etc.).
es: A continuación se le pedirá que introduzca una frase de contraseña para las particiones que haya configurado para que la utilicen. Una buena frase de contraseña tendrá más de ocho caracteres, será una mezcla de letras, números y otros caracteres que no se pueden encontrar en palabras comunes del diccionario y que no estén relacionadas con información que pueda asociarse a vd. con facilidad (como son fecha de nacimiento, aficiones, nombre de mascotas, nombres de miembros de la familia, etc.).

source: Before you input any passphrases, you should have made sure that your keyboard is configured correctly and generates the expected characters. If you are unsure, you can switch to the second virtual console and type some text at the prompt. This ensures that you won't be surprised later, e.g. by trying to input a passphrase using a qwerty keyboard layout when you used an azerty layout during the installation. This situation can have several causes. Maybe you switched to another keyboard layout during the installation, or the selected keyboard layout might not have been set up yet when entering the passphrase for the root file system.
es: Antes de introducir cualquier frase de contraseña debería asegurarse de que su teclado está configurado adecuadamente y genera los caracteres que vd. supone. Si no está seguro debería cambiar a la segunda consola virtual y escribir algún texto en el indicador. Esto asegura que no vaya a sorprenderse más adelante, por ejemplo, si introduce su frase de contraseña en un teclado configurado como QWERTY cuando en realidad ha utilizado una configuración de teclado AZERTY durante la instalación. Esta situación puede provocarse por varias situaciones: quizás cambio de configuración de teclado durante la instalación, o la configuración de teclado que ha elegido no está disponible cuando vaya a introducir la frase de contraseña para el sistema de ficheros raíz.

source: If you selected to use methods other than a passphrase to create encryption keys, they will be generated now. Because the kernel may not have gathered a sufficient amount of entropy at this early stage of the installation, the process may take a long time. You can help speed up the process by generating entropy: e.g. by pressing random keys, or by switching to the shell on the second virtual console and generating some network and disk traffic (downloading some files, feeding big files into <filename>/dev/null</filename>, etc.). This will be repeated for each partition to be encrypted.
es: Si ha seleccionado para generar las claves de cifrado métodos distintos de la frase de contraseña se generarán ahora. El proceso puede tomar mucho tiempo dado que el núcleo puede no haber sido capaz de obtener suficiente información de entropía en este punto de la instalación. Puede ayudar a acelerar este proceso si genera entropía, por ejemplo: si pulsa teclas al azar o si cambia a la segunda consola virtual y genera tráfico de red o de disco (como pueda ser una descarga de algunos ficheros o enviar ficheros muy grandes a <filename>/dev/null</filename>, etc.). Este paso se repetirá para cada partición a cifrar.

source: After returning to the main partitioning menu, you will see all encrypted volumes as additional partitions which can be configured in the same way as ordinary partitions. The following example shows two different volumes. The first one is encrypted via dm-crypt, the second one via loop-AES. <informalexample><screen> Encrypted volume (<replaceable>sda2_crypt</replaceable>) - 115.1 GB Linux device-mapper #1 115.1 GB F ext3 Loopback (<replaceable>loop0</replaceable>) - 515.2 MB AES256 keyfile #1 515.2 MB F ext3 </screen></informalexample> Now is the time to assign mount points to the volumes and optionally change the file system types if the defaults do not suit you.
es: Verá todos los volúmenes cifrados como particiones adicionales que puede configurar igual que las particiones normales una vez vuelva al menú de particionado principal. El siguiente ejemplo muestra dos volúmenes distintos. El primero está cifrado con dm-crypt y el segundo con loop-AES. <informalexample><screen> Volumen cifrado (<replaceable>sda2_crypt0</replaceable>) - 115.1 GB Linux device-mapper #1 115.1 GB F ext3 Loopback (<replaceable>loop0</replaceable>) - 515.2 MB AES256 keyfile #1 515.2 MB F ext3 </screen></informalexample> Ahora es cuando puede asignar los puntos de montaje a los volúmenes y cambiar, opcionalmente, los tipos de sistema de ficheros si los valores por omisión no se ajustan a sus necesidades.

source: Pay attention to the identifiers in parentheses (<replaceable>sda2_crypt</replaceable> and <replaceable>loop0</replaceable> in this case) and the mount points you assigned to each encrypted volume. You will need this information later when booting the new system. The differences between the ordinary boot process and the boot process with encryption involved will be covered later in <xref linkend="mount-encrypted-volumes"/>.
es: Cabe destacar aquí la asociación entre los identificadores entre paréntesis (<replaceable>sda2_crypt0</replaceable> y <replaceable>loop0</replaceable> en este caso) y los puntos de montaje asignados a cada volumen cifrado. Necesitará conocer esta información más adelante cuando vaya a arrancar el sistema. Podrá encontrar más información sobre las diferencias entre el proceso de arranque normal y el proceso de arranque con volúmenes cifrados en <xref linkend="mount-encrypted-volumes"/>.

source: Once you are satisfied with the partitioning scheme, continue with the installation.
es: Continúe con la instalación cuando esté satisfecho con el esquema de particionado.

source: Installing the Base System
es: Instalar el sistema base

source: Although this stage is the least problematic, it consumes a significant fraction of the install because it downloads, verifies and unpacks the whole base system. If you have a slow computer or network connection, this could take some time.
es: Aunque esta etapa es la menos problemática, consume una gran parte del tiempo de instalación debido a que descarga, verifica y desempaqueta el sistema base completo. Si tiene un ordenador o conexión de red lentos, esto podría tomar algún tiempo.
