Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/using-d-i.po
Languages: es

source: Some technical details you might, or might not, find handy: the program assumes the network IP address is the bitwise-AND of your system's IP address and your netmask. The default broadcast address is calculated as the bitwise OR of your system's IP address with the bitwise negation of the netmask. It will also guess your gateway. If you can't find any of these answers, use the offered defaults &mdash; if necessary, you can change them by editing <filename>/etc/network/interfaces</filename> once the system has been installed.
es: A continuación se indican algunos detalles técnicos que posiblemente encuentre útiles (o no): el programa asume que la dirección IP de la red es el resultado de aplicar la operación «AND» a nivel de bit a la dirección IP de su sistema y a su máscara de red. Obtendrá la dirección de difusión («broadcast», N. del T.) por omisión a través de una operación «OR» a nivel de bit de la dirección IP de su sistema con el valor negado a nivel de bit de la máscara de red. También intentará adivinar su pasarela. Debería utilizar los valores sugeridos por el programa si no sabe las respuestas a algunas de las preguntas que se le presenten. Si fuera necesario, podrá cambiar estos valores editando el fichero <filename>/etc/network/interfaces</filename> una vez el sistema esté instalado.

source: Configuring the Clock and Time Zone
es: Configuración del reloj y zona horaria

source: The installer will first attempt to connect to a time server on the Internet (using the <firstterm>NTP</firstterm> protocol) in order to correctly set the system time. If this does not succeed, the installer will assume the time and date obtained from the system clock when the installation system was booted are correct. It is not possible to manually set the system time during the installation process.
es: El instalador intentará conectar a un servidor de tiempos en Internet (utilizando el protocolo <firstterm>NTP</firstterm>) para poder fijar correctamente la hora del sistema. Si esta operación no tiene éxito, el instalador asumirá que la fecha y hora obtenida del reloj del sistema cuando el sistema de instalación arrancó es la hora correcta. No es posible fijar la hora del sistema manualmente durante el proceso de instalación.

source: The installer does not modify the system clock on the s390 platform.
es: El instalador no modifica el reloj del sistema en la plataforma s390.

source: Depending on the location selected earlier in the installation process, you may be shown a list of time zones relevant for that location. If your location has only one time zone and you are doing a default installation, you will not be asked anything and the system will assume that time zone.
es: De acuerdo con el lugar seleccionado con anterioridad en el proceso de instalación, se le mostrará una lista de zonas horarias apropiadas. No se le hará ninguna pregunta si su ubicación tiene sólo una zona horaria ya que el sistema supondrá que vd. está en esa zona.

source: In expert mode or when installing at medium priority, you will have the additional option to select <quote>Coordinated Universal Time</quote> (UTC) as time zone.
es: En modo experto o al realizar una instalación con prioridad media, tendrá la opción adicional de seleccionar el <quote>Tiempo universal coordinado</quote> (UTC) como zona horaria.

source: If for some reason you wish to set a time zone for the installed system that does <emphasis>not</emphasis> match the selected location, there are two options.
es: Si por alguna razón desea establecer una zona horaria que <emphasis>no</emphasis> corresponde con la ubicación para el sistema instalado elegida, hay dos opciones:

source: The simplest option is to just select a different time zone after the installation has been completed and you've booted into the new system. The command to do this is:
es: La opción más sencilla implica elegir una zona horaria distinta después de terminada la instalación y haber reiniciado al nuevo sistema. La orden para lograrlo sería:

source: Alternatively, the time zone can be set at the very start of the installation by passing the parameter <userinput>time/zone=<replaceable>value</replaceable></userinput> when you boot the installation system. The value should of course be a valid time zone, for example <userinput>Europe/London</userinput> or <userinput>UTC</userinput>.
es: Por otra parte, la zona horaria puede establecerse justo al comienzo de la instalación utilizando el parámetro <userinput>time/zone=<replaceable>value</replaceable></userinput> cuando arranca el sistema de instalación. El valor tiene que ser una zona horaria válida, por ejemplo <userinput>Europe/London</userinput> o <userinput>UTC</userinput>.

source: For automated installations the time zone can be set to any desired value using preseeding.
es: En el caso de instalaciones automatizadas puede definir la zona horaria con cualquier valor usando la preconfiguración.

source: Setting Up Users And Passwords
es: Configurar usuarios y contraseñas

source: Just before configuring the clock, the installer will allow you to set up the <quote>root</quote> account and/or an account for the first user. Other user accounts can be created after the installation has been completed.
es: El instalador le permitirá configurar la cuenta del usuario <quote>root</quote> (superusuario, o usuario administrador, N. del T.) y/o una cuenta para el primer usuario después de configurar la hora. Puede crear otras cuentas de usuario una vez haya terminado el proceso de instalación.

source: Set the Root Password
es: Configurar la contraseña de root

source: The <emphasis>root</emphasis> account is also called the <emphasis>super-user</emphasis>; it is a login that bypasses all security protection on your system. The root account should only be used to perform system administration, and only used for as short a time as possible.
es: La cuenta de <emphasis>root</emphasis> también se la conoce como la cuenta de <emphasis>super-usuario</emphasis>. Se trata de una cuenta que puede saltarse todas las protecciones de seguridad del sistema. Es una cuenta que sólo debería utilizarse para realizar la administración del sistema y sólo durante un tiempo tan corto como sea posible.

source: Any password you create should contain at least 6 characters, and should contain both upper- and lower-case characters, as well as punctuation characters. Take extra care when setting your root password, since it is such a powerful account. Avoid dictionary words or use of any personal information which could be guessed.
es: Cualquier contraseña para esta cuenta debería tener al menos seis caracteres y debería tener tanto caracteres en mayúsculas como en minúsculas así como caracteres de puntuacion. Tenga mucho cuidado cuando configure la contraseña de root ya que es una cuenta con muchos privilegios. Evite el uso de palabras de diccionario o utilizar información personal que podría advinarse fácilmente.

source: If anyone ever tells you they need your root password, be extremely wary. You should normally never give your root password out, unless you are administering a machine with more than one system administrator.
es: Si alguien le pregunta alguna vez que necesita su contraseña de root sea extremadamente cuidadoso. Nunca debería entregar su contraseña de root, a no ser que haya más de una persona haciendo tareas de administración del equipo.

source: Create an Ordinary User
es: Crear un usuario normal

source: The system will ask you whether you wish to create an ordinary user account at this point. This account should be your main personal log-in. You should <emphasis>not</emphasis> use the root account for daily use or as your personal login.
es: El sistema le preguntará si desea o no crear una cuenta de usuario normal. Esta cuenta debería utilizarse como su cuenta personal para acceder al sistema. <emphasis>No</emphasis> debe utilizar la cuenta de root como su cuenta personal o de uso diario.

source: Why not? Well, one reason to avoid using root's privileges is that it is very easy to do irreparable damage as root. Another reason is that you might be tricked into running a <emphasis>Trojan-horse</emphasis> program &mdash; that is a program that takes advantage of your super-user powers to compromise the security of your system behind your back. Any good book on Unix system administration will cover this topic in more detail &mdash; consider reading one if it is new to you.
es: ¿Por qué no debe hacer esto? Una razón es que el uso de los privilegios de root hace muy fácil que pueda causar daños irreparables al sistema. Otra razón es que alguien le podría intentar engañar y hacer que entre en funcionamiento un <emphasis>caballo de Troya</emphasis> (un programa que parece inocuo pero que toma control de la seguridad de su sistema sin que vd. lo sepa gracias a los privilegios de root). Cualquier buen libro de administración de sistemas Unix cubre este tema en más detalle, le recomendamos que lea alguno si este tema es nuevo para vd.

source: You will first be prompted for the user's full name. Then you'll be asked for a name for the user account; generally your first name or something similar will suffice and indeed will be the default. Finally, you will be prompted for a password for this account.
es: Primero se le preguntará el nombre completo del usuario. Después se le pedirá un nombre para la cuenta de usuario. Habitualmente se utiliza su nombre o algo parecido y, de hecho, éste será el valor por omisión. A continuación se le pedirá una contraseña para esta cuenta.

source: If at any point after installation you would like to create another account, use the <command>adduser</command> command.
es: Si quiere crear otra cuenta de usuario después de la instalación, puede utilizar la orden <command>adduser</command>.

source: Partitioning and Mount Point Selection
es: Particionado y elección de punto de montaje

source: At this time, after hardware detection has been executed a final time, &d-i; should be at its full strength, customized for the user's needs and ready to do some real work. As the title of this section indicates, the main task of the next few components lies in partitioning your disks, creating filesystems, assigning mountpoints and optionally configuring closely related options like RAID, LVM or encrypted devices.
es: En este momento, después de que ha sido ejecutada la detección de hardware por última vez, &d-i; deberá estar en su total capacidad, adaptado para las necesidades del usuario y listo para realizar el verdadero trabajo. Como lo indica el título de esta sección, la tarea principal de los próximos componentes radica en particionar sus discos, crear sistemas de ficheros, asignar puntos de montaje y opcionalmente configurar opciones estrechamente relacionadas como LVM o dispositivos RAID.

source: If you are uncomfortable with partitioning, or just want to know more details, see <xref linkend="partitioning"/>.
es: Si no se siente a gusto particionando, o simplemente quiere conocer más detalles, lea el <xref linkend="partitioning"/>.

source: If a hard disk has previously used under Solaris, the partitioner may not detect the size of the drive correctly. Creating a new partition table does not fix this issue. What does help, is to <quote>zero</quote> the first few sectors of the drive: <informalexample><screen> # dd if=/dev/zero of=/dev/hd<replaceable>X</replaceable> bs=512 count=2; sync </screen></informalexample> Note that this will make any existing data on that disk inaccessible.
es: El instalador puede no ser capaz de detectar el tamaño de la unidad correctamente si el disco ya se ha utilizado previamente con Solaris. No se arregla este problema creando una nueva tabla de particiones. Lo que sí ayuda es poner a <quote>cero</quote> los primeros sectores de la unidad: <informalexample><screen> # dd if=/dev/zero of=/dev/hd<replaceable>X</replaceable> bs=512 count=2; sync </screen></informalexample> Tenga en cuenta que hacer esto hará que los datos que existan en el disco no vuelvan a ser accesibles.

source: First you will be given the opportunity to automatically partition either an entire drive, or available free space on a drive. This is also called <quote>guided</quote> partitioning. If you do not want to autopartition, choose <guimenuitem>Manual</guimenuitem> from the menu.
es: Primero se le dará la oportunidad de particionar automáticamente todo el disco o el espacio libre disponible en el disco. A esto también se le llama particionado <quote>guiado</quote>. Si no quiere autoparticionar, elija <guimenuitem>Manual</guimenuitem> en el menú.

source: Supported partitioning options
es: Opciones de particionado aceptados

source: The partitioner used in &d-i; is fairly versatile. It allows to create many different partitioning schemes, using various partition tables, file systems and advanced block devices.
es: El particionador usado en &d-i; is muy versátil. Permite crear muchos esquemas de particionado, usar distintas tablas de partición, sistemas de fichero y dispositivos de bloque avanzado.

source: Exactly which options are available depends mainly on the architecture, but also on other factors. For example, on systems with limited internal memory some options may not be available. Defaults may vary as well. The type of partition table used by default can for example be different for large capacity hard disks than for smaller hard disks. Some options can only be changed when installing at medium or low debconf priority; at higher priorities sensible defaults will be used.
es: Exactamente qué opciones están disponibles depende principalmente de la arquitectura, aunque también hay otros factores. Por ejemplo, puede que no todas las opciones estén disponibles en sistemas con una memoria interna limitada. Los valores predefinidos también pueden variar. El tipo de tabla de particionado usado por omisión puede ser muy distinto con discos duros de gran capacidad que el usado con discos duros más pequeños. Algunas opciones sólo se pueden cambiar al instalar con una prioridad debconf media o baja; se usarán valores predefinidos adecuados con prioridades más altas.

source: The installer supports various forms of advanced partitioning and use of storage devices, which in many cases can be used in combination.
es: El instalador permite varias formas de particionado avanzado y el uso de dispositivos de almacenamiento, que en la mayoría de los casos se pueden usar en combinación.

source: Logical Volume Management (LVM)
es: Gestor de Volúmenes Lógicos (LVM)

source: Supported are RAID levels 0, 1, 4, 5, 6 and 10.
es: Se aceptan los niveles de RAID 0, 1, 4, 5, 6 y 10.

source: Encryption
es: Cifrado

source: <emphasis>Serial ATA RAID</emphasis> (using <classname>dmraid</classname>)
es: <emphasis>Serial ATA RAID</emphasis> (usando <classname>dmraid</classname>)

source: Also called <quote>fake RAID</quote> or <quote>BIOS RAID</quote>. Support for Serial ATA RAID is currently only available if enabled when the installer is booted. Further information is available on <ulink url="&url-d-i-sataraid;">our Wiki</ulink>.
es: También llamado <quote>fake RAID</quote> (falso) o <quote>BIOS RAID</quote>. En la actualidad, Serial ATA RAID sólo está disponible al arrancar el instalador. Para más información consulte <ulink url="&url-d-i-sataraid;">nuestra wiki</ulink>.

source: See <ulink url="&url-d-i-multipath;">our Wiki</ulink> for information. Support for multipath is currently only available if enabled when the installer is booted.
es: Para más información consulte <ulink url="&url-d-i-multipath;">our Wiki</ulink>. La compatiblidad con «multipath» sólo está disponible si se activa al arrancar el instalador.

source: The following file systems are supported.
es: Se permiten los siguientes sistemas de fichero.

source: The default file system selected in most cases is ext3; for <filename>/boot</filename> partitions ext2 will be selected by default when guided partitioning is used.
es: El sistema de ficheros por omisión seleccionado en la mayoría de los casos es ext3; por omisión, se seleccionará ext2 para particiones <filename>/boot</filename> si se usa el particionado guiado.

source: <emphasis>jfs</emphasis> (not available on all architectures)
es: <emphasis>jfs</emphasis> (no disponible para todas las arquitecturas)

source: The default file system is UFS.
es: El sistema de ficheros predeterminado es UFS.

source: <emphasis>xfs</emphasis> (not available on all architectures)
es: <emphasis>xfs</emphasis> (no disponible para todas las arquitecturas)

source: As ZFS support in the installer is still in development, only a basic subset of ZFS features are supported. Some of them can be enabled manually after the initial install, but there are some caveats:
es: Ya que la compatibilidad del instalador con ZFS aún está en desarrollo, sólo dispondrá de un subconjunto de las funciones de ZFS. Algunas se pueden activar manualmente, después de la primera instalación, aunque con riesgos.

source: Each ZFS pool will host only one filesystem. After install is finished, more filesystems can be created on this pool by using the <quote>zfs create</quote> command.
es: Cada agrupación ZFS contiene un único sistema de ficheros. Tras la instalación puede crear sistemas de ficheros adicionales en esta agrupación mediante la orden <quote>zfs create</quote>.

source: Each ZFS pool will be composed of exactly one partition. After install is finished, a single-device ZFS pool can be converted into a multi-device pool by using the <quote>zpool add</quote> command, or into a mirrored pool by using the <quote>zpool attach</quote> command. However, you shouldn't do this on the pool that hosts root filesystem, as it would prevent GRUB from booting your system.
es: Cada agrupación ZFS esta compuesta de una única partición. Tras la instalación, una agrupación ZFS con un único dispositivo se puede convertir en una agrupación con varios dispositivos por medio de la orden <quote>zpool add</quote> o en una agrupación de réplica mediante la orden <quote>zpool attach</quote>. Sin embargo, no debería hacer esto en la agrupación que contiene el sistema de ficheros raíz ya que podría impedir que GRUB se iniciara en su sistema.

source: Compression is not currently supported. After the install is finished, compression can be enabled by setting the <quote>compression</quote> property via the <quote>zfs set</quote> command. However, if a compression algorithm other than the default (lzjb) is used on the pool that hosts your root filesystem, this may prevent GRUB from booting your system.
es: Actualmente no existe soporte para la compresión. Tras la instalación podrá activar la compresión estableciendo la propiedad <quote>compression</quote> por medio de la orden <quote>zfs set</quote>. Sin embargo, si utiliza un algoritmo de compresión distinto del predeterminado (lzjb) sobre la agrupación que contiene el sistema de ficheros raíz, podría impedir que GRUB se iniciara en su sistema.

source: <emphasis>reiserfs</emphasis> (optional; not available on all architectures)
es: <emphasis>reiserfs</emphasis> (opcional; no disponible para todas las arquitecturas)

source: Support for the Reiser file system is no longer available by default. When the installer is running at medium or low debconf priority it can be enabled by selecting the <classname>partman-reiserfs</classname> component. Only version 3 of the file system is supported.
es: El uso del sistema de ficheros Reiser no está disponible por omisión. Puede activarlo cuando el instalador se ejecuta con una prioridad de debconf media o baja seleccionando el componente <classname>partman-reiserfs</classname>. Sólo se permite la versión 3 del sistema de ficheros.

source: Used on some systems to read flash memory. It is not possible to create new jffs2 partitions.
es: Usado en algunos sistemas para leer memorias flash. No es posible crear particiones jffs2 nuevas.

source: Existing partitions will be recognized and it is possible to assign mount points for them. It is not possible to create new qnx4 partitions.
es: Se reconocerán las particiones existentes, y es posible asignar a éstos puntos de montaje. No es posible crear particiones qnx4 nuevas.

source: <emphasis>NTFS</emphasis> (read-only)
es: <emphasis>NTFS</emphasis> (sólo lectura)

source: Existing NTFS partitions can be resized and it is possible to assign mount points for them. It is not possible to create new NTFS partitions.
es: Se pueden redimensionar particiones NTFS, y es posible asignar a estos puntos de montaje. No es posible crear particiones NTFS nuevas.

source: Guided Partitioning
es: Particionado guiado

source: If you choose guided partitioning, you may have three options: to create partitions directly on the hard disk (classic method), or to create them using Logical Volume Management (LVM), or to create them using encrypted LVM<footnote> <para> The installer will encrypt the LVM volume group using a 256 bit AES key and makes use of the kernel's <quote>dm-crypt</quote> support. </para> </footnote>.
es: Si elije el particionado guiado, puede tener tres opciones: crear las particiones directamente en el disco duro (el método clásico), utilizar el Gestor de Volúmenes Lógicos («Logical Volumen Manager», LVM), o crearlas utilizando un LVM cifrado<footnote> <para> El instalador cifrará el grupo de volúmenes LVM con una clave AES de 256 bit y hace uso de la compatibilidad con <quote>dm-crypt</quote> en el núcleo. </para> </footnote>.

source: The option to use (encrypted) LVM may not be available on all architectures.
es: La opción de usar LVM (cifrado) puede no estar disponible en todas las arquitecturas.

source: When using LVM or encrypted LVM, the installer will create most partitions inside one big partition; the advantage of this method is that partitions inside this big partition can be resized relatively easily later. In the case of encrypted LVM the big partition will not be readable without knowing a special key phrase, thus providing extra security of your (personal) data.
es: Cuando utilice LVM o LVM cifrado el instalador creará la mayoría de las particiones dentro de una partición si escoge la segunda opción, la ventaja de este método es que las particiones dentro de una partición más grande pueden cambiarse de tamaño más adelante relativamente fácil. En el caso de LVM cifrado la partición más grande no será legible sin el conocimiento de una contraseña especial, lo que da un seguridad adicional en su datos (personales).

source: When using encrypted LVM, the installer will also automatically erase the disk by writing random data to it. This further improves security (as it makes it impossible to tell which parts of the disk are in use and also makes sure that any traces of previous installations are erased), but may take some time depending on the size of your disk.
es: El instalador borra automáticamente el disco escribiendo datos aleatorios en él antes de utilizar LVM cifrado. Esto mejora la seguridad (ya que hace imposible determinar qué partes del disco se están utilizando y también se asegura de que cualquier traza de instalación previa se borra). Sin embargo, esto puede llevar un tiempo dependiendo del tamaño de su disco.
