Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/using-d-i.po
Languages: es

source: Now let's switch to the other side of the wire. As a prerequisite, you need to configure your terminal for UTF-8 encoding, because that is what the installation system uses. If you do not, remote installation will be still possible, but you may encounter strange display artefacts like destroyed dialog borders or unreadable non-ascii characters. Establishing a connection with the installation system is as simple as typing: <informalexample><screen> <prompt>$</prompt> <userinput>ssh -l installer <replaceable>install_host</replaceable></userinput> </screen></informalexample> Where <replaceable>install_host</replaceable> is either the name or IP address of the computer being installed. Before the actual login the fingerprint of the remote system will be displayed and you will have to confirm that it is correct.
es: En el otro extremo de la comunicación, como prerequisito, deberá configuar su terminal para que utilice codificación UTF-8, porque es la que utiliza el sistema de instalación. Si no lo hace podrá hacer la instalación pero puede que vea caracteres extraños en la pantalla, como puedan ser bordes de cuadro de diálogo rotos o caracteres no americanos ilegibles. Para conectarse al sistema de instalación remoto sólo tiene que escribir: <informalexample><screen> <prompt>$</prompt> <userinput>ssh -l installer <replaceable>sistema_a_instalar</replaceable></userinput> </screen></informalexample> donde <replaceable>sistema_a_instalar</replaceable> es o bien el nombre o bien la dirección IP del equipo que está instalando. Antes de conectarse se le mostrará la huella digital del sistema remoto y deberá confirmar que es la correcta.

source: The <command>ssh</command> server in the installer uses a default configuration that does not send keep-alive packets. In principle, a connection to the system being installed should be kept open indefinitely. However, in some situations &mdash; depending on your local network setup &mdash; the connection may be lost after some period of inactivity. One common case where this can happen is when there is some form of Network Address Translation (NAT) somewhere between the client and the system being installed. Depending on at which point of the installation the connection was lost, you may or may not be able to resume the installation after reconnecting.
es: La orden <command>ssh</command> en el instalador usa una configuración predeteminada que no envía paquetes de keep-alive. En principio, una conexión al sistema que está instalándose debería mantener la conexión abierta de forma indefinida. Pero, en ciertas situaciones &mdash; dependiendo de su configuración local de red &mdash; la conexión puede interrumpirse después de un período de inactividad. Un caso común puede ocurrir cuando hay alguna modalidad de Traducción de Direcciónes de Red (NAT) en algún sitio entre el cliente y el sistema que está instalándose. Dependiendo del punto en el cual la conexión se perdió, podría resultar imposible dar continuidad a la instalación después de reconectarse.

source: You may be able to avoid the connection being dropped by adding the option <userinput>-o&nbsp;ServerAliveInterval=<replaceable>value</replaceable></userinput> when starting the <command>ssh</command> connection, or by adding that option in your <command>ssh</command> configuration file. Note however that in some cases adding this option may also <emphasis>cause</emphasis> a connection to be dropped (for example if keep-alive packets are sent during a brief network outage, from which <command>ssh</command> would otherwise have recovered), so it should only be used when needed.
es: Podría evitar que caiga la conexión añadiendo la opción <userinput>-o&nbsp;ServerAliveInterval=<replaceable>value</replaceable></userinput> cuando se hace la conexión <command>ssh</command>, o adicionar tal opción en su fichero de configuración de <command>ssh</command>. Pero tenga en cuenta que en algunos casos adicionar tal orden podría también <emphasis>causar</emphasis> la caída de la conexión (por ejemplo si los paquetes keep-alive se envían mientras haya una caída corta de la red, en la cuál la orden <command>ssh</command> se ha recuperado), por lo tanto debe usarse únicamente cuando sea necesario.

source: If you install several computers in turn and they happen to have the same IP address or hostname, <command>ssh</command> will refuse to connect to such host. The reason is that it will have different fingerprint, which is usually a sign of a spoofing attack. If you are sure this is not the case, you will need to delete the relevant line from <filename>~/.ssh/known_hosts</filename><footnote> <para> The following command will remove an existing entry for a host: <command>ssh-keygen -R &lt;<replaceable>hostname</replaceable>|<replaceable>IP&nbsp;address</replaceable>&gt;</command>. </para> </footnote> and try again.
es: Si instala muchos sistemas de forma consecutiva y, por casualidad, comparten la dirección IP o nombre de equipo, puede tener problemas para conectarse a éstos porque <command>ssh</command> se negará a conectarse a ellos, ya que cada sistema tiene una huella digital distinta, lo que para <command>ssh</command> es indicativo de un posible ataque de suplantación. Si está seguro de que no se trata de ningún ataque deberá eliminar la línea del equipo en cuestión del fichero <filename>~/.ssh/known_hosts</filename><footnote> <para> órden a continuación eliminará cualquier línea que existiera para un servidor: <command>ssh-keygen -R &lt;<replaceable>hostname</replaceable>|<replaceable>IP&nbsp;address</replaceable>&gt;</command>. </para> </footnote> and try again.

source: After the login you will be presented with an initial screen where you have two possibilities called <guimenuitem>Start menu</guimenuitem> and <guimenuitem>Start shell</guimenuitem>. The former brings you to the main installer menu, where you can continue with the installation as usual. The latter starts a shell from which you can examine and possibly fix the remote system. You should only start one SSH session for the installation menu, but may start multiple sessions for shells.
es: Después de acceder al sistema se le mostrará una pantalla de instalación inicial donde tendrá dos posibilidades: <guimenuitem>Arrancar menú</guimenuitem> y <guimenuitem>Arrancar consola</guimenuitem>. La primera de estas opciones le llevará al menú de instalación, donde podrá seguir con la instalación como lo hace habitualmente. La segunda de estas opciones ejecuta un intérprete de línea de órdenes desde el que puede examinar, y quizás arreglar, el sistema remoto. Sólo debería arrancar una sesión de SSH para el menú de instalación, aunque puede tener tantas sesiones como quiera con consolas remotas.

source: After you have started the installation remotely over SSH, you should not go back to the installation session running on the local console. Doing so may corrupt the database that holds the configuration of the new system. This in turn may result in a failed installation or problems with the installed system.
es: Una vez ha arrancado la instalación por SSH de forma remota no debería volver a la sesión de instalación que se está ejecutando en la consola local. Si lo hace, podría corromper la base de datos que guarda la configuración del nuevo sistema, al realizar accesos simultáneos a ella. Esto podría llevar a que la instalación fallara o a que tuviera problemas con el sistema que ha instalado.

source: Loading Missing Firmware
es: Carga de Firmware adicional

source: As described in <xref linkend="hardware-firmware"/>, some devices require firmware to be loaded. In most cases the device will not work at all if the firmware is not available; sometimes basic functionality is not impaired if it is missing and the firmware is only needed to enable additional features.
es: Como se indicó en <xref linkend="hardware-firmware"/>, ciertos dispositivos requieren la carga de firmware. La mayoría de veces el dispositivo no funcionará sin el firmware; en ciertas ocasiones estará disponible cierta funcionalidad básica sin que esté cargado el firmware, pero con este se podría contar con características adicionales.

source: If a device driver requests firmware that is not available, &d-i; will display a dialog offering to load the missing firmware. If this option is selected, &d-i; will scan available devices for either loose firmware files or packages containing firmware. If found, the firmware will be copied to the correct location (<filename>/lib/firmware</filename>) and the driver module will be reloaded.
es: Si un controlador de un dispositivo solicita firmware que no está disponible, el &d-i; mostrará un diálogo ofreciéndole la oportunidad de cargar el firmware faltante. Si selecciona esta opción, &d-i; buscará ficheros o paquetes que puedan contener el firmware en los dispositivos disponibles. Si los encuentra, copiará el firmware al lugar correcto(<filename>/lib/firmware</filename>) y se recargará el módulo del controlador.

source: Which devices are scanned and which file systems are supported depends on the architecture, the installation method and the stage of the installation. Especially during the early stages of the installation, loading the firmware is most likely to succeed from a FAT-formatted floppy disk or USB stick. <phrase arch="x86">On i386 and amd64 firmware can also be loaded from an MMC or SD card.</phrase>
es: De acuerdo con la arquitectura, el método de instalación y la etapa de instalación se buscará en los dispositivos y en los sistemas de ficheros. Especialmente en los primeros pasos de la instalación, la carga del firmware podría cargarse con mayor éxito desde una unidad de disquete o una memoria USB con formato FAT. <phrase arch="x86">El firmware también puede cargarse desde tarjetas MMC o SD en arquitecturas i386 y amd64.</phrase>

source: Note that it is possible to skip loading the firmware if you know the device will also function without it, or if the device is not needed during the installation.
es: Tenga en cuenta que es posible obviar la carga del firmware si sabe que el dispositivo funciona sin él, o si el dispositivo no se necesita durante la instalación.

source: Support for loading firmware is still relatively basic and is likely to be improved in future releases of the installer. Currently &d-i; will for example not display any warning if you choose to load missing firmware, but the requested firmware is not found. Please report any issues you encounter by filing an installation report (see <xref linkend="submit-bug"/>).
es: La funcionalidad de cargar el firmware en este momento es relativamente básico y debería mejorar en versiones futuras del instalador. En la actualidad, por ejemplo, &d-i; no mostrará advertencia alguna si elige cargar firmware adicional, pero tal firmware no se encuentra. Por favor reporte cualquier inconveniente que encuentre, para diligenciar un reporte de instalación (consulte <xref linkend="submit-bug"/>).

source: Preparing a medium
es: Preparación del medio

source: Although in some cases the firmware can also be loaded from a partition on a hard disk, the most common method to load firmware will be from some removable medium such as a floppy disk or a USB stick. The firmware files or packages must be placed in either the root directory or a directory named <filename>/firmware</filename> of the file system on the medium. The recommended file system to use is FAT as that is most certain to be supported during the early stages of the installation.
es: A pesar de que el firmware puede cargarse desde una partición del disco duro, el método más común para cargarlo será desde un medio removible tal como un disquete o una memoria USB. Los ficheros o paquetes del firmware deben colocarse en el directorio raíz o un directorio del sistema de ficheros o el medio llamado <filename>/firmware</filename>. El sistema de ficheros recomendado es FAT dado que su uso se permite con más seguridad durante los primeros pasos de la instalación.

source: Tarballs and zip files containing current packages for the most common firmware are available from: <itemizedlist> <listitem><para> <ulink url="&url-firmware-tarballs;"></ulink> </para></listitem> </itemizedlist> Just download the tarball or zip file for the correct release and unpack it to the file system on the medium.
es: Los archivos tar y zip que contienen los ficheros de firmware más comunes están disponibles en: <itemizedlist> <listitem><para> <ulink url="&url-firmware-tarballs;"></ulink> </para></listitem> </itemizedlist> Descargue el archivo tar o zip para la versión correcta y desempaquételo en el sistema de ficheros o en el dispositivo de almacenamiento.

source: If the firmware you need is not included in the tarball, you can also download specific firmware packages from the (non-free section of the) archive. The following overview should list most available firmware packages but is not guaranteed to be complete and may also contain non-firmware packages:
es: Si el firmware que necesita no está incluido en el paquete de archivos, puede descargar paquetes de firmware específico (de la sección no-libre) del archivo. La siguiente lista debería mostrar la mayoría de paquetes de firmware disponibles, pero no se garantiza que esté completa y puede contener paquetes que no son de firmware:

source: It is also possible to copy individual firmware files to the medium. Loose firmware could be obtained for example from an already installed system or from a hardware vendor.
es: También es posible copiar ficheros individuales de firmware. Otro firmware puede obtenerse por ejemplo de un sistema previamente instalado o de un proveedor de hardware.

source: Firmware and the Installed System
es: Firmware y el Sistema Instalado

source: Any firmware loaded during the installation will be copied automatically to the installed system. In most cases this will ensure that the device that requires the firmware will also work correctly after the system is rebooted into the installed system. However, if the installed system runs a different kernel version from the installer there is a slight chance that the firmware cannot be loaded due to version skew.
es: Cualquier firmware que se cargue durante la instalación se copiará automáticamente al sistema instalado. La mayoría de veces esto garantizará que los dispositivos que requieren el firmware también funcionarán correctamente después de que se ha reiniciado al sistema instalado. Sin embargo, si el sistema instalado se ejecuta con un núcleo diferente del núcleo del instalador, es probable que el firmware no pueda cargarse debido a la diferencia de versiones.

source: If the firmware was loaded from a firmware package, &d-i; will also install this package for the installed system and will automatically add the non-free section of the package archive in APT's <filename>sources.list</filename>. This has the advantage that the firmware should be updated automatically if a new version becomes available.
es: Si el firmware se cargó de un paquete de firmware, el &d-i; también instalará este paquete para el sistema instalado y añadirá automáticamente la sección non-free del archivo de paquetes en <filename>sources.list</filename> de APT. La ventaja de esto es que el firmware debería actualizarse automáticamente si está disponible una nueva versión.

source: If loading the firmware was skipped during the installation, the relevant device will probably not work with the installed system until the firmware (package) is installed manually.
es: Si se obvió la carga del firmware durante la instalación, los dispositivos en cuestión probablemente no funcionarán en el sistema instalado hasta que el (paquete de) firmware sea instalado manualmente.

source: If the firmware was loaded from loose firmware files, the firmware copied to the installed system will <emphasis>not</emphasis> be automatically updated unless the corresponding firmware package (if available) is installed after the installation is completed.
es: Si el firmware se cargó desde ficheros adicionales, el firmware copiado al sistema instalado <emphasis>no</emphasis> se actualizará automáticamente a menos que el correspondiente paquete de firmware (en caso de estar disponible) se instale después de finalizada la instalación.
