Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/using-d-i.po
Languages: es

source: During hardware detection &d-i; checks if any of the drivers for the hardware devices in your system require firmware to be loaded. If any firmware is requested but unavailable, a dialog will be displayed that allows the missing firmware to be loaded from a removable medium. See <xref linkend="loading-firmware"/> for further details.
es: Durante la detección de hardware &d-i; detecta si cualquiera de los controladores para los dispositivos hardware su sistema necesitan que se cargue un «firmware». Si es necesario un «firmware» pero no está disponible se mostrará un diálogo que le permite cargar el fichero de un medio removible. Para más información consulte <xref linkend="loading-firmware"/>.

source: Check available memory / low memory mode
es: Comprobación de la memoria disponible / modo de baja memoria

source: One of the first things &d-i; does, is to check available memory. If the available memory is limited, this component will make some changes in the installation process which hopefully will allow you to install &debian-gnu; on your system.
es: Una de las primeras cosas que realiza &d-i;, es comprobar la memoria disponible. Si esta es reducida, este componente realizará algunos cambios en el sistema de instalación que, con un poco de suerte, le permitirán instalar &debian-gnu; en su sistema.

source: The first measure taken to reduce memory consumption by the installer is to disable translations, which means that the installation can only be done in English. Of course, you can still localize the installed system after the installation has completed.
es: La primera medida que se toma para reducir el consumo de memoria en el instalador es deshabilitar las traducciones, lo que significa que la instalación sólo la podrá hacer en inglés. Por supuesto, puede localizar el sistema que haya instalado una vez haya terminado la instalación.

source: If that is not sufficient, the installer will further reduce memory consumption by loading only those components essential to complete a basic installation. This reduces the functionality of the installation system. You will be given the opportunity to load additional components manually, but you should be aware that each component you select will use additional memory and thus may cause the installation to fail.
es: Si no es suficiente, el instalador intentará reducir el consumo de memoria cargando solamente los componentes esenciales para completar una instalación básica. Esto reduce la funcionalidad del sistema de instalación. Se le dará la oportunidad de cargar componentes adicionales de forma manual pero debe tener en cuenta que cada componente que cargue consumirá más memoria y podría hacer que toda la instalación fallara.

source: If the installer runs in low memory mode, it is recommended to create a relatively large swap partition (64&ndash;128MB). The swap partition will be used as virtual memory and thus increases the amount of memory available to the system. The installer will activate the swap partition as early as possible in the installation process. Note that heavy use of swap will reduce performance of your system and may lead to high disk activity.
es: Si el instalador se ejecuta en modo de baja memoria es recomendable crear una partición de intercambio relativamente grande (64 a 128 MB). La partición de swap se utilizará como memoria virtual y por tanto incrementa la cantidad de memoria disponible al sistema. El instalador activará la partición de intercambio lo antes posible en el proceso de instalación. Tenga en cuenta que si se usa demasiado la zona de intercambio se degradará el rendimiento de su sistema y puede tener como consecuencia una alta actividad en el disco.

source: Despite these measures, it is still possible that your system freezes, that unexpected errors occur or that processes are killed by the kernel because the system runs out of memory (which will result in <quote>Out of memory</quote> messages on VT4 and in the syslog).
es: A pesar de estas medidas, es posible que su sistema se congele, que se produzcan errores inesperados o que el núcleo mate procesos porque el sistema se quede sin memoria (si esto sucede aparecerán mensajes diciendo <quote>Out of memory</quote>, es decir, «Sin memoria» en VT4 y en el syslog).

source: For example, it has been reported that creating a big ext3 file system fails in low memory mode when there is insufficient swap space. If a larger swap doesn't help, try creating the file system as ext2 (which is an essential component of the installer) instead. It is possible to change an ext2 partition to ext3 after the installation.
es: Por ejemplo, se ha reportado que la creación de un sistema de ficheros ext3 grande falla en el modo de baja memoria cuando no hay suficiente espacio de intercambio. Si el tener una partición de intercambio no ayuda, intente crear el sistema de ficheros como si fuera ext2 (que es un componente esencial del instalador). Puede cambiar una partición ext2 a ext3 después de la instalación.

source: It is possible to force the installer to use a higher lowmem level than the one based on available memory by using the boot parameter <quote>lowmem</quote> as described in <xref linkend="installer-args"/>.
es: Es posible forzar al instalador para que utilice un nivel superior de memoria baja que el valor que se utilizaría basándose en la memoria disponible. Para ello se puede utilizar el parámetro de arranque <quote>lowmem</quote> tal y como se describe en <xref linkend="installer-args"/>.

source: Selecting Localization Options
es: Seleccionar las opciones de localización

source: In most cases the first questions you will be asked concern the selection of localization options to be used both for the installation and for the installed system. The localization options consist of language, location and locales.
es: En la mayoría de los casos las primeras preguntas que se le harán estarán relacionadas con las opciones de localización que se van a utilizar tanto en la instalación como en el sistema instalado. Las opciones de localización consisten del idioma, el país y la ubicación geográfica.

source: The language you choose will be used for the rest of the installation process, provided a translation of the different dialogs is available. If no valid translation is available for the selected language, the installer will default to English.
es: El idioma que escoja se utilizará durante el resto del proceso de instalación, siempre que exista una traducción para los distintos mensajes que se muestran. Si no hay una traducción disponible para el idioma seleccionado el instalador mostrará los mensajes en inglés.

source: The selected geographic location (in most cases a country) will be used later in the installation process to select the correct time zone and a &debian; mirror appropriate for that country. Language and country together will help determine the default locale for your system and select the correct keyboard layout.
es: La ubicación geográfica seleccionada (habitualmente, un país) se utilizará más adelante en el proceso de instalación para seleccionar la zona horaria correcta y el servidor de réplica de &debian; más apropiada en función de ese país. El idioma y el país se utilizarán conjuntamente para ayudar a definir la locale predeterminada del sistema y seleccionar la distribución del teclado adecuada.

source: You will first be asked to select your preferred language. The language names are listed both in English (left side) and in the language itself (right side); the names on the right side are also shown in the proper script for the language. The list is sorted on the English names. At the top of the list is an extra option that allows you to select the <quote>C</quote> locale instead of a language. Choosing the <quote>C</quote> locale will result in the installation proceding in English; the installed system will have no localization support as the <classname>locales</classname> package will not be installed.
es: Primero se le preguntará cuál es su idioma preferido. Los nombres de idioma se muestran tanto en inglés (lado izquierdo) como en el propio idioma (lado derecho). También se utiliza la tipografía apropiada para su idioma en el lado derecho. La lista está ordenada alfabéticamente por el nombre en inglés. El primer elemento de la lista es una opción adicional que le permite seleccionar la locale <quote>C</quote> en lugar de un idioma concreto. Si escoge la locale <quote>C</quote> la instalación procederá en inglés, y el sistema instalado no tendrá la funcionalidad de localización ya que no se instalará el paquete <classname>locales</classname>.

source: Next you will be asked to select your geographic location. If you selected a language that is recognized as an official language for more than one country<footnote> <para> In technical terms: where multiple locales exist for that language with differing country codes. </para> </footnote>, you will be shown a list of only those countries. To select a country that is not in that list, choose <guimenuitem>other</guimenuitem> (the last option). You will then be presented with a list of continents; selecting a continent will lead to a list of relevant countries on that continent.
es: A continuación se le pedirá que seleccione su ubicación geográfica si ha seleccionado un idioma que es el idioma oficial de más de un país<footnote> <para> En términos técnicos esto significa que hay múltiples localizaciones para ese lenguaje con distintos códigos de país. </para> </footnote>, sólo se le mostrará una lista de esos países. Para seleccionar un país que no esté en la lista escoja la opción «<guimenuitem>otro</guimenuitem>», al final de la lista. Se le mostrará una lista de continentes; si escoje un continente se le mostrarán los países relevantes para este continente.

source: If the language has only one country associated with it, a list of countries will be displayed for the continent or region the country belongs to, with that country selected as the default. Use the <guibutton>Go Back</guibutton> option to select countries on a different continent.
es: Si el idioma elegido tiene sólo un país asociado, se mostrará una lista de países del continente o región al que pertenece, con tal país seleccionado de forma predeterminada. Use la opción <guibutton>Retroceder</guibutton> para seleccionar paises en un continente distinto.

source: It is important to select the country where you live or where you are located as it determines the time zone that will be configured for the installed system.
es: Es importante seleccionar dónde vive o su ubicación actual para determinar la zona horaria que se configurará para el sistema instalado.

source: If you selected a combination of language and country for which no locale is defined and there exist multiple locales for the language, then the installer will allow you to choose which of those locales you prefer as the default locale for the installed system<footnote> <para> At medium and low priority you can always select your preferred locale from those available for the selected language (if there's more than one). </para> </footnote>. In all other cases a default locale will be selected based on the selected language and country.
es: Si ha seleccionado una combinación del idioma y país para la cual no hay definida ninguna locale, y si existen varias locales para ese idioma, el instalador le permitirá seleccionar cuáles de esas configuraciones regionales prefiere como la predeterminada del sistema instalado.<footnote> <para> Siempre puede seleccionar con prioridad media y baja su locale preferida entre las disponibles para el idioma seleccionado (si hay más de una). </para> </footnote>. En todos los demás casos, se seleccionará una locale basada en el idioma y país seleccionado.

source: Any default locale selected as described in the previous paragraph will use <firstterm>UTF-8</firstterm> as character encoding.
es: Todas las locales definidas como se describe en el anterior párrafo usarán <firstterm>UTF-8</firstterm> para la codificación de caracteres.

source: If you are installing at low priority, you will have the option of selecting additional locales, including so-called <quote>legacy</quote> locales<footnote> <para> Legacy locales are locales which do not use UTF-8, but one of the older standards for character encoding such as ISO&nbsp;8859-1 (used by West European languages) or EUC-JP (used by Japanese). </para> </footnote>, to be generated for the installed system; if you do, you will be asked which of the selected locales should be the default for the installed system.
es: Si está haciendo una instalación con prioridad baja, tendrá la opción de seleccionar locales adicionales, incluyendo locales <quote>legacy</quote> (obsoletas)<footnote> <para> Las locales «legacy» son aquellas que no usan UTF-8, sino algún estándar de codificación de caracteres más antiguo como ISO&nbsp;8859-1 (usada para idiomas de Europa occidental) o EUC-JP (usada para el japonés). </para> </footnote>, para su generación para el sistema instalado; si hace esto, se le preguntará cual de las locales seleccionadas debería ser la predeterminada del sistema instalado.

source: Choosing a Keyboard
es: Elección del teclado

source: Keyboards are often tailored to the characters used in a language. Select a layout that conforms to the keyboard you are using, or select something close if the keyboard layout you want isn't represented. Once the system installation is complete, you'll be able to select a keyboard layout from a wider range of choices (run <command>dpkg-reconfigure keyboard-configuration</command> as root after you have completed the installation).
es: Normalmente los teclados están sujetos a los caracteres usados en un determinado idioma. Seleccione un teclado de acuerdo al modelo que use, o seleccione algo parecido a éste si no encuentra su modelo de teclado. Una vez que la instalación haya finalizado, podrá seleccionar un modelo de teclado de entre un rango más amplio de opciones (ejecute «dpkg-reconfigure keyboard-configuration» como superusuario cuando haya completado la instalación).

source: Move the highlight to the keyboard selection you desire and press &enterkey;. Use the arrow keys to move the highlight &mdash; they are in the same place in all national language keyboard layouts, so they are independent of the keyboard configuration. An 'extended' keyboard is one with <keycap>F1</keycap> through <keycap>F10</keycap> keys along the top row.
es: Mueva el cursor hacia la selección de teclado que desee y presione &enterkey;. Utilice las teclas de direccionado para mover el cursor &mdash; están en el mismo lugar en todos los modelos nacionales de teclado, así que son independientes de la configuración de teclado. Un teclado «extendido» es uno con las teclas <keycap>F1</keycap> a <keycap>F10</keycap> en la línea superior.

source: There are two keyboard layouts for US keyboards; the qwerty/mac-usb-us (Apple USB) layout will place the Alt function on the <keycap>Command/Apple</keycap> key (in the keyboard position next to the <keycap>space</keycap> key similar to <keycap>Alt</keycap> on PC keyboards), while the qwerty/us (Standard) layout will place the Alt function on the <keycap>Option</keycap> key (engraved with 'alt' on most Mac keyboards). In other respects the two layouts are similar.
es: Hay dos modelos para los teclados norteamericanos; el modelo qwerty/mac-usb-us (Apple USB) situará la función «Alt» en la tecla <keycap>Orden/Apple</keycap> (en el teclado ubicada junto a la <keycap>barra espaciadora</keycap>, parecida a <keycap>Alt</keycap> en los teclados PC), mientras que en el modelo (estándar) qwerty/us situará la función «Alt» en la tecla <keycap>Opción</keycap> (que lleva escrito «alt» en la mayoría de los teclados Mac). Ambos modelos son idénticos en cualquier otro aspecto.

source: Looking for the &debian; Installer ISO Image
es: Búsqueda de la imagen ISO del instalador de &debian;

source: When installing via the <emphasis>hd-media</emphasis> method, there will be a moment where you need to find and mount the &debian; Installer iso image in order to get the rest of the installation files. The component <command>iso-scan</command> does exactly this.
es: Al instalar usando el método <emphasis>hd-media</emphasis>, habrá un momento en el que se requiera localizar y montar la imagen ISO del Instalador de &debian; para obtener el resto de los ficheros de instalación. El componente <command>iso-scan</command> hace exactamente esto.

source: At first, <command>iso-scan</command> automatically mounts all block devices (e.g. partitions) which have some known filesystem on them and sequentially searches for filenames ending with <filename>.iso</filename> (or <filename>.ISO</filename> for that matter). Beware that the first attempt scans only files in the root directory and in the first level of subdirectories (i.e. it finds <filename>/<replaceable>whatever</replaceable>.iso</filename>, <filename>/data/<replaceable>whatever</replaceable>.iso</filename>, but not <filename>/data/tmp/<replaceable>whatever</replaceable>.iso</filename>). After an iso image has been found, <command>iso-scan</command> checks its content to determine if the image is a valid &debian; iso image or not. In the former case we are done, in the latter <command>iso-scan</command> seeks for another image.
es: En primer lugar, <command>iso-scan</command> monta automáticamente todos los dispositivos de tipo bloque (p. ej. particiones) que tengan algún sistema de ficheros conocido y busca secuencialmente ficheros que terminen en <filename>.iso</filename> (o <filename>.ISO</filename>). Tenga en cuenta que en el primer intento sólo se buscan ficheros en el directorio raíz y en el primer nivel de subdirectorios (esto es, puede localizar <filename>/<replaceable>loquesea</replaceable>.iso</filename>, <filename>/data/<replaceable>loquesea</replaceable>.iso</filename>, pero no <filename>/data/tmp/<replaceable>loquesea</replaceable>.iso</filename>). Después de localizar una imagen ISO, <command>iso-scan</command> comprobará su contenido para determinar si la imagen es o no una imagen ISO de &debian; válida. Si es una imagen válida se finaliza la búsqueda, en caso contrario <command>iso-scan</command> busca otra imagen.

source: In case the previous attempt to find an installer iso image fails, <command>iso-scan</command> will ask you whether you would like to perform a more thorough search. This pass doesn't just look into the topmost directories, but really traverses whole filesystem.
es: En caso de que falle el intento anterior de encontrar la imagen ISO del instalador, <command>iso-scan</command> le preguntará si quiere realizar una búsqueda más exhaustiva. Este paso no sólo buscará en los directorios de primer nivel sino en todo el sistema de ficheros.

source: If <command>iso-scan</command> does not discover your installer iso image, reboot back to your original operating system and check if the image is named correctly (ending in <filename>.iso</filename>), if it is placed on a filesystem recognizable by &d-i;, and if it is not corrupted (verify the checksum). Experienced Unix users could do this without rebooting on the second console.
es: En el caso de que <command>iso-scan</command> no sea capaz de encontrar la imagen ISO del instalador, deberá reiniciar, arrancar su sistema operativo original y comprobar que el nombre de la imagen es correcto (verifique que termina en <filename>.iso</filename>), se encuentra en un lugar reconocible por &d-i;, y no es una imagen defectuosa (verifique la suma de control). Los usuarios de Unix más expertos pueden hacer esto sin reiniciar, utilizando para ello la segunda consola.

source: Configuring the Network
es: Configuración de la red

source: As you enter this step, if the system detects that you have more than one network device, you'll be asked to choose which device will be your <emphasis>primary</emphasis> network interface, i.e. the one which you want to use for installation. The other interfaces won't be configured at this time. You may configure additional interfaces after installation is complete; see the <citerefentry> <refentrytitle>interfaces</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> man page.
es: En este paso, si el sistema detecta que tiene más de un dispositivo de red, se le pedirá que elija cual quiere usar como interfaz de red <emphasis>primaria</emphasis>, esto es, la que quiera usar para la instalación. El resto de las interfaces no se configurarán en este momento. Podrá configurar las demás interfaces una vez se haya terminado la instalación; lea la página de manual <citerefentry> <refentrytitle>interfaces</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: By default, &d-i; tries to configure your computer's network automatically via DHCP. If the DHCP probe succeeds, you are done. If the probe fails, it may be caused by many factors ranging from unplugged network cable, to a misconfigured DHCP setup. Or maybe you don't have a DHCP server in your local network at all. For further explanation, check the error messages on the fourth console. In any case, you will be asked if you want to retry, or if you want to perform a manual setup. DHCP servers are sometimes really slow in their responses, so if you are sure everything is in place, try again.
es: &d-i; intenta configurar automáticamente la tarjeta de red de su ordenador mediante DHCP por omisión. Usted no tiene que hacer nada más si la solicitud de DHCP tiene éxito. Un fallo de esta solicitud puede deberse a muchos factores, variando desde un cable de red desconectado, hasta una mala configuración del entorno DHCP. Puede que ni siquiera tenga un servidor DHCP en su red local. Compruebe los mensajes de error que se presentan en la cuarta consola para obtener más información. En cualquier caso, se le preguntará si quiere volver a intentarlo o si quiere realizar la configuración manualmente. A veces los servidores DHCP tardan bastante en responder, vuelva a intentarlo si vd. cree que todo está configurado correctamente.

source: The manual network setup in turn asks you a number of questions about your network, notably <computeroutput>IP address</computeroutput>, <computeroutput>Netmask</computeroutput>, <computeroutput>Gateway</computeroutput>, <computeroutput>Name server addresses</computeroutput>, and a <computeroutput>Hostname</computeroutput>. Moreover, if you have a wireless network interface, you will be asked to provide your <computeroutput>Wireless ESSID</computeroutput> and a <computeroutput>WEP key</computeroutput>. Fill in the answers from <xref linkend="needed-info"/>.
es: La configuración de red manual pregunta sucesivamente datos acerca de la red, principalmente: <computeroutput>dirección IP</computeroutput>, <computeroutput>máscara de red</computeroutput>, <computeroutput>pasarela</computeroutput>, <computeroutput>direcciones de los servidores de nombres</computeroutput>, y <computeroutput>el nombre de la máquina</computeroutput>. Además, si tiene una interfaz de red inalámbrica, se le pedirá que proporcione el <computeroutput>ESSID inalámbrico</computeroutput> y la <computeroutput>clave WEP</computeroutput>. Rellene las respuestas con la información de <xref linkend="needed-info"/>.
