Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/using-d-i.po
Languages: es

source: The boot loader on SGI machines is <command>arcboot</command>. It has to be installed on the same hard disk as the kernel (this is done automatically by the installer). Arcboot supports different configurations which are set up in <filename>/etc/arcboot.conf</filename>. Each configuration has a unique name, the default setup as created by the installer is <quote>linux</quote>. After arcboot has been installed, the system can be booted from hard disk by setting some firmware environment variables entering <informalexample><screen> <userinput> setenv SystemPartition scsi(<replaceable>scsi</replaceable>)disk(<replaceable>disk</replaceable>)rdisk(0)partition(0)</userinput> <userinput> setenv OSLoadPartition scsi(<replaceable>scsi</replaceable>)disk(<replaceable>disk</replaceable>)rdisk(0)partition(<replaceable>partnr</replaceable>)</userinput> <userinput> setenv OSLoader arcboot</userinput> <userinput> setenv OSLoadFilename <replaceable>config</replaceable></userinput> <userinput> setenv AutoLoad yes</userinput> </screen></informalexample> on the firmware prompt, and then typing <command>boot</command>.
es: El gestor de arranque para sistemas de SGI es <command>arcboot</command>. Debe instalarse en el mismo disco duro que en el que se encuentra el núcleo (esto lo hace el instalador automáticamente). Arcboot acepta distintos modos de configuración, definidas en <filename>/etc/arcboot.conf</filename>. Cada configuración tiene un nombre único, la configuración predeterminada creada por el instalador es <quote>linux</quote>. Se puede arrancar el sistema desde el disco duro después de que se haya instalado arcboot si se definen algunas variables de entorno del firmware <informalexample><screen> <userinput> setenv SystemPartition scsi(<replaceable>scsi</replaceable>)disk(<replaceable>disk</replaceable>)rdisk(0)partition(0)</userinput> <userinput> setenv OSLoadPartition scsi(<replaceable>scsi</replaceable>)disk(<replaceable>disk</replaceable>)rdisk(0)partition(<replaceable>partnr</replaceable>)</userinput> <userinput> setenv OSLoader arcboot</userinput> <userinput> setenv OSLoadFilename <replaceable>config</replaceable></userinput> <userinput> setenv AutoLoad yes</userinput> </screen></informalexample> en el símbolo de espera del mismo, y después de escribir <command>boot</command>.

source: is the SCSI bus to be booted from, this is <userinput>0</userinput> for the onboard controllers
es: es el bus SCSI desde donde arrancar, su valor para los controladores integrados es <userinput>0</userinput>.

source: is the SCSI ID of the hard disk on which <command>arcboot</command> is installed
es: es el ID SCSI del disco duro en el cual se ha instalado <command>arcboot</command>

source: is the number of the partition on which <filename>/etc/arcboot.conf</filename> resides
es: es el número de partición en la que se encuentra <filename>/etc/arcboot.conf</filename>

source: is the name of the configuration entry in <filename>/etc/arcboot.conf</filename>, which is <quote>linux</quote> by default.
es: es el nombre de la configuración en el fichero <filename>/etc/arcboot.conf</filename>. Su valor predeterminado es <quote>linux</quote>.

source: Install <command>Yaboot</command> on a Hard Disk
es: Instalación de <command>Yaboot</command> en el disco duro

source: Newer (mid 1998 and on) PowerMacs use <command>yaboot</command> as their boot loader. The installer will set up <command>yaboot</command> automatically, so all you need is a small 820k partition named <quote>bootstrap</quote> with type <emphasis>Apple_Bootstrap</emphasis> created back in the partitioning component. If this step completes successfully then your disk should now be bootable and OpenFirmware will be set to boot &debian-gnu;.
es: Los sistemas PowerMac recientes (desde mediados de 1998 en adelante) usan <command>yaboot</command> como su gestor de arranque. El instalador configurará <command>yaboot</command> automáticamente, de modo que todo lo que necesita es crear una pequeña partición de 820k de tipo <emphasis>Apple_Bootstrap</emphasis> en el sistema de particionado. Esta partición se denomina <quote>bootstrap</quote>. Si completa con éxito este paso, podrá arrancar desde su disco y «OpenFirmware» estará configurado para arrancar &debian-gnu;.

source: Install <command>Quik</command> on a Hard Disk
es: Instalación de <command>Quik</command> en el disco duro

source: The boot loader for OldWorld Power Macintosh machines is <command>quik</command>. You can also use it on CHRP. The installer will attempt to set up <command>quik</command> automatically. The setup has been known to work on 7200, 7300, and 7600 Powermacs, and on some Power Computing clones.
es: <command>quik</command> es el gestor de arranque para las máquinas Power Macintosh OldWorld. También puede usarlo en máquinas CHRP. El instalador intentará configurar <command>quik</command> automáticamente. Está probado que la configuración funciona en máquinas Power Macintosh 7200, 7300 y 7600 y en clones de Power Computing.

source: The boot loader on &arch-title; is <quote>zipl</quote>. <command>ZIPL</command> is similar in configuration and usage to <command>LILO</command>, with a few exceptions. Please take a look at <quote>LINUX for &arch-title; Device Drivers and Installation Commands</quote> from IBM's developerWorks web site if you want to know more about <command>ZIPL</command>.
es: <quote>zipl</quote> es el gestor de arranque que se utiliza en &arch-title;. La configuración y modo de uso de <command>ZIPL</command> es parecido al de <command>LILO</command> pero con algunas excepciones. Consulte el documento <quote>LINUX for &arch-title; Device Drivers and Installation Commands</quote> (LINUX para &arch-title;: Controladoras de dispositivos y órdenes de instalación, N. del t.) del servidor web «developerWorks» de IBM si quiere saber más sobre <command>ZIPL</command>.

source: Install the <command>SILO</command> Boot Loader on a Hard Disk
es: Instalación del gestor de arranque <command>SILO</command> en un disco duro

source: The standard &architecture; boot loader is called <quote>silo</quote>. It is documented in <filename>/usr/share/doc/silo/</filename>. <command>SILO</command> is similar in configuration and usage to <command>LILO</command>, with a few exceptions. First of all, <command>SILO</command> allows you to boot any kernel image on your drive, even if it is not listed in <filename>/etc/silo.conf</filename>. This is because <command>SILO</command> can actually read Linux partitions. Also, <filename>/etc/silo.conf</filename> is read at boot time, so there is no need to rerun <command>silo</command> after installing a new kernel like you would with <command>LILO</command>. <command>SILO</command> can also read UFS partitions, which means it can boot SunOS/Solaris partitions as well. This is useful if you want to install GNU/Linux alongside an existing SunOS/Solaris install.
es: El gestor de arranque estándar para &architecture; se llama <quote>silo</quote>. Puede encontrar su documentación en <filename>/usr/share/doc/silo/</filename>. La configuración y el modo de uso de <command>SILO</command> es parecido al de <command>LILO</command> con algunas excepciones. En primer lugar <command>SILO</command> le permite cargar cualquier imagen del núcleo en su unidad aunque ésta no esté listada en <filename>/etc/silo.conf</filename>. Esto es posible porque <command>SILO</command> puede leer las particiones Linux. Además, al arrancar se lee <filename>/etc/silo.conf</filename>, con lo que no es necesario ejecutar <command>silo</command> cada vez que se instala un nuevo núcleo como haría con <command>LILO</command>. <command>SILO</command> también puede leer particiones UFS, lo que hace posible que pueda arrancar también particiones SunOS/Solaris. Esto es útil si desea instalar GNU/Linux dentro de una instalación ya existente de SunOS/Solaris.

source: Continue Without Boot Loader
es: Continuar sin gestor de arranque

source: This option can be used to complete the installation even when no boot loader is to be installed, either because the arch/subarch doesn't provide one, or because none is desired (e.g. you will use existing boot loader).
es: Esta opción se usa para finalizar la instalación, incluso cuando no se instale un gestor de arranque, bien porque la arquitectura o subarquitectura no disponga de uno o bien porque no es necesario (p. ej. cuando vaya a usar un gestor de arranque que ya exista en el sistema).

source: If you plan to manually configure your bootloader, you should check the name of the installed kernel in <filename>/target/boot</filename>. You should also check that directory for the presence of an <firstterm>initrd</firstterm>; if one is present, you will probably have to instruct your bootloader to use it. Other information you will need are the disk and partition you selected for your <filename>/</filename> filesystem and, if you chose to install <filename>/boot</filename> on a separate partition, also your <filename>/boot</filename> filesystem.
es: Si planea configurar manualmente su gestor de arranque, deberá verificar el nombre del núcleo instalado en <filename>/target/boot</filename>. También deberá verificar la presencia de un fichero <firstterm>initrd</firstterm> en este directorio; probablemente deba indicar al gestor de arranque que lo utilice si existe. Necesitará también conocer, como información adicional, el disco y partición que ha elegido para su sistema de ficheros <filename>/</filename> (raíz) y también su sistema de ficheros <filename>/boot</filename>, si elige instalar <filename>/boot</filename> en una partición separada.

source: Finishing the Installation
es: Finalizar la instalación

source: This is the last step in the &debian; installation process during which the installer will do any last minute tasks. It mostly consists of tidying up after the &d-i;.
es: Este es el último paso en el proceso de instalación de &debian; durante el cual el instalador realizará algunas tareas finales. En su mayoría consiste en limpiar lo dejado por el &d-i;.

source: Setting the System Clock
es: Configurar el reloj del sistema

source: The installer may ask you if the computer's clock is set to UTC. Normally this question is avoided if possible and the installer tries to work out whether the clock is set to UTC based on things like what other operating systems are installed.
es: El instalador puede preguntarle si el reloj del sistema está configurado con la hora UTC (Coordinated Universal Time, o Tiempo Universal Coordinado, N. del T.). Generalmente se intenta evitar esta pregunta y el instalador decide si el reloj está configurado con el UTC o no basándose en cosas como, por ejemplo, otros sistemas operativos que están instalados.

source: In expert mode you will always be able to choose whether or not the clock is set to UTC. <phrase arch="powerpc">Macintosh hardware clocks are normally set to local time. If you want to dual-boot, select local time instead of UTC.</phrase> <phrase arch="any-x86">Systems that (also) run Dos or Windows are normally set to local time. If you want to dual-boot, select local time instead of UTC.</phrase>
es: Siempre se le dejará elegir si el reloj está configurado con UTC o no en el modo experto. <phrase arch="powerpc">Los relojes de los sistemas Macintosh generalmente están configurados con la hora local. Si desea poder cargar dos sistemas operativos distintos debe elegir la hora local en lugar de la hora UTC.</phrase> <phrase arch="any-x86">Los sistemas que también pueden ejecutar Dos o Windows están configurados con la hora local. Si desea poder cargar dos sistemas operativos distintos debe elegir la hora local en lugar de la hora UTC.</phrase>

source: At this point &d-i; will also attempt to save the current time to the system's hardware clock. This will be done either in UTC or local time, depending on the selection that was just made.
es: En este punto el &d-i; tratará de definir la hora actual al reloj del ordenador. Se haría en UTC o en hora local, de acuerdo con la selección que se acaba de hacer.

source: Reboot the System
es: Reiniciar el sistema

source: You will be prompted to remove the boot media (CD, floppy, etc) that you used to boot the installer. After that the system will be rebooted into your new &debian; system.
es: Se le pedirá que extraiga el medio de arranque (CD, disquete, etc.) que usó para arrancar el instalador. Tras esto el sistema reiniciará cargando su nuevo sistema &debian;.

source: After a final prompt the system will be halted because rebooting is not supported on &arch-title;. You then need to IPL &debian-gnu; from the DASD which you selected for the root filesystem during the first steps of the installation.
es: Se parará el sistema tras una pregunta final porque no se permite reiniciar en el caso de &arch-title;. Necesita arrancar (IPL) &debian-gnu; desde el DASD que seleccionó para el sistema de ficheros raíz durante los primeros pasos de la instalación.

source: Troubleshooting
es: Resolución de problemas

source: The components listed in this section are usually not involved in the installation process, but are waiting in the background to help the user in case something goes wrong.
es: Los componentes listados en esta sección usualmente no están involucrados en el proceso de instalación, pero están esperando en el segundo plano para ayudar al usuario en caso de que algo falle.

source: Saving the installation logs
es: Guardado de los registros de instalación

source: If the installation is successful, the logfiles created during the installation process will be automatically saved to <filename>/var/log/installer/</filename> on your new &debian; system.
es: Si la instalación es satisfactoria, los ficheros creados durante el proceso de instalación se guardarán automáticamente en el directorio <filename>/var/log/installer/</filename> de su nuevo sistema &debian;.

source: Choosing <guimenuitem>Save debug logs</guimenuitem> from the main menu allows you to save the log files to a floppy disk, network, hard disk, or other media. This can be useful if you encounter fatal problems during the installation and wish to study the logs on another system or attach them to an installation report.
es: Si escoge la opción <guimenuitem>Grabar logs de depuración</guimenuitem> en el menú principal podrá guardar los registros en un disquete, red, disco duro u otro tipo de dispositivo. Esto puede ser útil si se encuentra con problemas críticos durante la instalación y quiere estudiar los registros en otro sistema, o adjuntarlos en un informe de instalación.

source: Using the Shell and Viewing the Logs
es: Uso del intérprete de órdenes y consulta de registros

source: There are several methods you can use to get a shell while running an installation. On most systems, and if you are not installing over serial console, the easiest method is to switch to the second <emphasis>virtual console</emphasis> by pressing <keycombo><keycap>Left Alt</keycap> <keycap>F2</keycap></keycombo><footnote> <para> That is: press the <keycap>Alt</keycap> key on the left-hand side of the <keycap>space bar</keycap> and the <keycap>F2</keycap> function key at the same time. </para> </footnote> (on a Mac keyboard, <keycombo><keycap>Option</keycap> <keycap>F2</keycap></keycombo>). Use <keycombo><keycap>Left Alt</keycap> <keycap>F1</keycap></keycombo> to switch back to the installer itself.
es: Hay distintos métodos para obtener un intérprete de órdenes mientras realiza una instalación. En la mayoría de los sistemas, y en el caso de que no esté instalando utilizando una consola serie, el método más sencillo es cambiar a la segunda <emphasis>consola virtual</emphasis> pulsando <keycombo><keycap>Alt izquierdo</keycap> <keycap>F2</keycap></keycombo> <footnote> <para> Esto es, la tecla <keycap>Alt</keycap> a la izquierda de la <keycap>barra espaciadora</keycap>, y al mismo tiempo la tecla de función <keycap>F2</keycap>. </para> </footnote> (en un teclado Mac, <keycombo><keycap>Opción</keycap> <keycap>F2</keycap></keycombo>). Utilice <keycombo><keycap>Alt izquierdo</keycap> <keycap>F1</keycap></keycombo> para volver al propio instalador.

source: For the graphical installer see also <xref linkend="gtk-using"/>.
es: Si va a utilizar el instalador gráfico consulte <xref linkend="gtk-using"/>.

source: If you cannot switch consoles, there is also an <guimenuitem>Execute a Shell</guimenuitem> item on the main menu that can be used to start a shell. You can get to the main menu from most dialogs by using the &BTN-GOBACK; button one or more times. Type <userinput>exit</userinput> to close the shell and return to the installer.
es: Si no puede cambiar entre consolas puede utilizar la opción en el menú principal denominada <guimenuitem>Ejecutar un intérprete de órdenes</guimenuitem> (o «shell», N. del t.). Puede volver al menú principal desde la mayor parte de los diálogos utilizando el botón &BTN-GOBACK; una o más veces. Para volver al instalador sólo tiene que escribir <userinput>exit</userinput> para cerrar el intérprete.

source: At this point you are booted from the RAM disk, and there is a limited set of Unix utilities available for your use. You can see what programs are available with the command <command>ls /bin /sbin /usr/bin /usr/sbin</command> and by typing <command>help</command>. The shell is a Bourne shell clone called <command>ash</command> and has some nice features like autocompletion and history.
es: En este punto de la instalación ha arrancado desde un disco que utiliza la memoria RAM, y, consecuentemente, sólo dispone de un número limitado de utilidades Unix. Puede ver los programas disponibles con la orden <command>ls /bin /sbin /usr/bin /usr/sbin</command> y también si escribe <command>help</command>. El intérprete es un clon del intérprete de órdenes Bourne llamado <command>ash</command> que tiene algunas características que le pueden ser útiles como una función para completar órdenes y un histórico.

source: To edit and view files, use the text editor <command>nano</command>. Log files for the installation system can be found in the <filename>/var/log</filename> directory.
es: Puede utilizar el editor de textos <command>nano</command> para editar y ver ficheros. Encontrará los registros del sistema de instalación en el directorio <filename>/var/log</filename>.

source: Although you can do basically anything in a shell that the available commands allow you to do, the option to use a shell is really only there in case something goes wrong and for debugging.
es: Aunque puede hacer básicamente todo lo que podría hacer en un intérprete de órdenes que le permiten hacer los programas disponibles, la opción para utilizar el intérprete de órdenes se proporciona sólo para los casos en los que algo no funcione correctamente o tenga que depurar algún problema.

source: Doing things manually from the shell may interfere with the installation process and result in errors or an incomplete installation. In particular, you should always use let the installer activate your swap partition and not do this yourself from a shell.
es: Las cosas que haga manualmente en el intérprete de órdenes pueden interferir con el proceso de instalaciones y dar lugar a errores o a una instalación incompleta. En particular, siempre debe utilizar el instalador y no el intérprete para activar la partición de intercambio.

source: Installation Over the Network
es: Instalación a través de la red

source: One of the more interesting components is <firstterm>network-console</firstterm>. It allows you to do a large part of the installation over the network via SSH. The use of the network implies you will have to perform the first steps of the installation from the console, at least to the point of setting up the networking. (Although you can automate that part with <xref linkend="automatic-install"/>.)
es: Uno de los componentes más interesantes es <firstterm>network-console</firstterm>. Éste le permite hacer una gran parte de la instalación a través de la red mediante SSH. El uso de la red implica que tiene que llevar a cabo los primeros pasos de la instalación a través de la consola al menos hasta llegar al punto en el que se configura la red (aunque puede automatizar esta parte con <xref linkend="automatic-install"/>).

source: This component is not loaded into the main installation menu by default, so you have to explicitly ask for it. If you are installing from CD, you need to boot with medium priority or otherwise invoke the main installation menu and choose <guimenuitem>Load installer components from CD</guimenuitem> and from the list of additional components select <guimenuitem>network-console: Continue installation remotely using SSH</guimenuitem>. Successful load is indicated by a new menu entry called <guimenuitem>Continue installation remotely using SSH</guimenuitem>.
es: Este componente no aparece en el menú de la instalación por omisión, por lo que tiene que pedirlo explícitamente. En el caso de que esté instalando desde CD debe arrancar fijando la prioridad a media o llamar al menú de instalación y seleccionar <guimenuitem>Cargar componentes del instalador desde CD</guimenuitem> y seleccionar de la lista de componentes <guimenuitem>network-console: Continuar la instalación de forma remota utilizando SSH</guimenuitem>. Si el componente se carga correctamente verá una nueva entrada de menú llamada <guimenuitem>Continuar la instalación de forma remota utilizando SSH</guimenuitem>.

source: For installations on &arch-title;, this is the default method after setting up the network.
es: Este es el método de instalación por omisión para las instalaciones en &arch-title; una vez configurada la red.

source: <phrase arch="not-s390">After selecting this new entry, you</phrase> <phrase arch="s390">You</phrase> will be asked for a new password to be used for connecting to the installation system and for its confirmation. That's all. Now you should see a screen which instructs you to login remotely as the user <emphasis>installer</emphasis> with the password you just provided. Another important detail to notice on this screen is the fingerprint of this system. You need to transfer the fingerprint securely to the person who will continue the installation remotely.
es: <phrase arch="not-s390">Después de seleccionar esta nueva entrada se</phrase> <phrase arch="s390">Se</phrase> le preguntará la contraseña a utilizar para conectarse con el sistema de instalación, y se confirmará esta nueva contraseña. Eso es todo lo que necesita. Ahora debería poder ver una pantalla que le indica que debe conectarse de forma remota con el identificador de usuario <emphasis>installer</emphasis> y la contraseña que introdujo. Un detalle importante a destacar es que se le indicará también la huella digital del sistema que está instalando. Tiene que transferir esta huella de forma segura a la persona que continuará con la instalación remota.

source: Should you decide to continue with the installation locally, you can always press &enterkey;, which will bring you back to the main menu, where you can select another component.
es: Siempre puede pulsar &enterkey; para continuar con la instalación local si lo desea. Si lo hace se le mostrará el menú principal y podrá elegir otro componente.
