Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/using-d-i.po
Languages: es

source: What benefits this brings depends on the type of MD device you are creating. Currently supported are: <variablelist> <varlistentry> <term>RAID0</term><listitem><para> Is mainly aimed at performance. RAID0 splits all incoming data into <firstterm>stripes</firstterm> and distributes them equally over each disk in the array. This can increase the speed of read/write operations, but when one of the disks fails, you will lose <emphasis>everything</emphasis> (part of the information is still on the healthy disk(s), the other part <emphasis>was</emphasis> on the failed disk). </para><para> The typical use for RAID0 is a partition for video editing. </para></listitem> </varlistentry> <varlistentry> <term>RAID1</term><listitem><para> Is suitable for setups where reliability is the first concern. It consists of several (usually two) equally-sized partitions where every partition contains exactly the same data. This essentially means three things. First, if one of your disks fails, you still have the data mirrored on the remaining disks. Second, you can use only a fraction of the available capacity (more precisely, it is the size of the smallest partition in the RAID). Third, file-reads are load-balanced among the disks, which can improve performance on a server, such as a file server, that tends to be loaded with more disk reads than writes. </para><para> Optionally you can have a spare disk in the array which will take the place of the failed disk in the case of failure. </para></listitem> </varlistentry> <varlistentry> <term>RAID5</term><listitem><para> Is a good compromise between speed, reliability and data redundancy. RAID5 splits all incoming data into stripes and distributes them equally on all but one disk (similar to RAID0). Unlike RAID0, RAID5 also computes <firstterm>parity</firstterm> information, which gets written on the remaining disk. The parity disk is not static (that would be called RAID4), but is changing periodically, so the parity information is distributed equally on all disks. When one of the disks fails, the missing part of information can be computed from remaining data and its parity. RAID5 must consist of at least three active partitions. Optionally you can have a spare disk in the array which will take the place of the failed disk in the case of failure. </para><para> As you can see, RAID5 has a similar degree of reliability to RAID1 while achieving less redundancy. On the other hand, it might be a bit slower on write operations than RAID0 due to computation of parity information. </para></listitem> </varlistentry> <varlistentry> <term>RAID6</term><listitem><para> Is similar to RAID5 except that it uses two parity devices instead of one. </para><para> A RAID6 array can survive up to two disk failures. </para></listitem> </varlistentry> <varlistentry> <term>RAID10</term><listitem><para> RAID10 combines striping (as in RAID0) and mirroring (as in RAID1). It creates <replaceable>n</replaceable> copies of incoming data and distributes them across the partitions so that none of the copies of the same data are on the same device. The default value of <replaceable>n</replaceable> is 2, but it can be set to something else in expert mode. The number of partitions used must be at least <replaceable>n</replaceable>. RAID10 has different layouts for distributing the copies. The default is near copies. Near copies have all of the copies at about the same offset on all of the disks. Far copies have the copies at different offsets on the disks. Offset copies copy the stripe, not the individual copies. </para><para> RAID10 can be used to achieve reliability and redundancy without the drawback of having to calculate parity. </para></listitem> </varlistentry> </variablelist> To sum it up:
es: Los beneficios obtenidos dependen del tipo de MD creado. Actualmente los tipos compatibles son: <variablelist> <varlistentry> <term>RAID 0</term><listitem><para> Su principal objetivo es el rendimiento. RAID 0 divide todos los datos de entrada en <firstterm>franjas</firstterm> y los distribuye igualmente por cada disco en el sistema RAID. Esto puede aumentar la velocidad de las operaciones de lectura/escritura, pero cuando falle un disco, perderá <emphasis>todo</emphasis> (parte de la información todavía está en el disco o discos que funcionan, la otra parte <emphasis>estaba</emphasis> en el disco que falló). </para><para> El uso típico de RAID 0 en una partición para edición de vídeo. </para></listitem> </varlistentry> <varlistentry> <term>RAID 1</term><listitem><para> Es adecuado para los casos en los que la fiabilidad sea lo primordial. Consiste en varias (normalmente dos) particiones del mismo tamaño donde cada partición contiene exactamente los mismos datos. Esto significa tres cosas. Primero, si un disco falla, todavía tiene una copia de los datos en los discos restantes. Segundo, sólo puede usar una fracción de la capacidad disponible (con más precisión, el tamaño de la partición más pequeña del sistema RAID). Tercero, la carga producida por la lectura de ficheros se reparte entre los discos, lo que puede ampliar el rendimiento de algunos servidores, como los servidores de ficheros, que tienden a tener más carga de lecturas que escrituras. </para><para> Opcionalmente puede tener un disco de reserva en el sistema que tomará el lugar del disco defectuoso en caso de fallo. </para></listitem> </varlistentry> <varlistentry> <term>RAID 5</term><listitem><para> Es una buena elección entre velocidad, confiabilidad y redundancia de datos. RAID 5 divide todos los datos de entrada en franjas y los distribuye igualmente en todos los discos (similar a RAID 0), a excepción de uno. A diferencia de RAID 0, RAID 5 también calcula la información de <firstterm>paridad</firstterm>, la cual se escribe en el disco restante. El disco de paridad no es estático (esto sería RAID 4), sino que cambia periódicamente, de modo que la información de paridad se distribuye entre todos los discos. Cuando falla uno de los discos, la parte faltante de la información puede reconstruirse desde la información existente y su paridad. Debe utilizar al menos tres particiones activas para un sistema RAID 5. Opcionalmente, puede tener un disco de reserva, el cual se utilizará en lugar del primer disco que falle dentro del array. </para><para> Como puede ver, RAID 5 tiene un grado similar de confiabilidad a RAID 1 logrando menos redundancia. Por otro lado, podría ser un poco más lento en operaciones de escritura que RAID 0 debido al cálculo de la información de paridad. </para></listitem> </varlistentry> <varlistentry> <term>RAID 6</term><listitem><para> Es pareceido al RAID 5 pero usa dos dispositivos de paridad en lugar de uno solo. </para><para> Un arreglo RAID 6 puede sobrevivir a un daño de hasta dos discos. </para></listitem> </varlistentry> <varlistentry> <term>RAID 10</term><listitem><para> Un arreglo RAID 10 combina divisiones (como en RAID 0) y espejo (como en RAID 1). Crea <replaceable>n</replaceable> copias de los datos y los distribuye transversalmente en las particiones de forma tal que ninguna de las copias de datos estén en el mismo dispositivo. El valor predeterminado para <replaceable>n</replaceable> es 2, pero puede establecerse a otro en el modo experto. La cantidad de particiones usadas debe ser de por lo menos <replaceable>n</replaceable>. El RAID 10 tiene diferentes disposiciones para distribuir las copias. En principio se usa copias cercanas. Las copias cercanas tienen todas las copias casi con el mismo corrimiento en todos los discos. Las copias lejanas tienen las copias en corrimientos distintos en los discos. Los corrimientos de las copias copian las franjas y no las copias individuales. </para><para> Los RAID 10 buscan alcanzar la confiabilidad y redundancia evitando el cálculo de paridad, que aveces es visto como un inconveniente. </para></listitem> </varlistentry> </variablelist> Resumiendo:

source: Type
es: Tipo

source: Minimum Devices
es: Dispositivos mínimos

source: Spare Device
es: Dispositivo de reserva

source: Survives disk failure?
es: ¿Sobrevive al fallo de un disco?

source: Available Space
es: Espacio disponible

source: Size of the smallest partition multiplied by number of devices in RAID
es: Tamaño de la menor partición multiplicado por el número de dispositivos en el sistema RAID.

source: optional
es: opcional

source: <entry>yes</entry>
es: <entry>sí</entry>

source: Size of the smallest partition in RAID
es: Tamaño de la menor partición en el sistema RAID.

source: Size of the smallest partition multiplied by (number of devices in RAID minus one)
es: Tamaño de la partición más pequeña multiplicada por el número de dispositivos en RAID menos uno.

source: Size of the smallest partition multiplied by (number of devices in RAID minus two)
es: Tamaño de la partición más pequeña multiplicado por (el número de dispositivos RAID menos dos)

source: Total of all partitions divided by the number of chunk copies (defaults to two)
es: Total de todas las particiones dividido en el númbero de porciones de copias (predeterminado a 2)

source: If you want to know more about Software RAID, have a look at <ulink url="&url-software-raid-howto;">Software RAID HOWTO</ulink>.
es: Si quiere saber más acerca de RAID, consulte el <ulink url="&url-software-raid-howto;">CÓMO de RAID</ulink>.

source: To create an MD device, you need to have the desired partitions it should consist of marked for use in a RAID. (This is done in <command>partman</command> in the <guimenu>Partition settings</guimenu> menu where you should select <menuchoice> <guimenu>Use as:</guimenu> <guimenuitem>physical volume for RAID</guimenuitem> </menuchoice>.)
es: Para crear un dispositivo MD necesita marcar todas las particiones que desea utilizar para su uso con RAID (puede hacerlo con <command>partman</command> en el menú <guimenu>Configuración de la partición</guimenu> donde debería seleccionar <menuchoice> <guimenu>Utilizar como:</guimenu> <guimenuitem>volumen físico para RAID</guimenuitem> </menuchoice>).

source: Make sure that the system can be booted with the partitioning scheme you are planning. In general it will be necessary to create a separate file system for <filename>/boot</filename> when using RAID for the root (<filename>/</filename>) file system. Most boot loaders <phrase arch="x86">(including lilo and grub)</phrase> do support mirrored (not striped!) RAID1, so using for example RAID5 for <filename>/</filename> and RAID1 for <filename>/boot</filename> can be an option.
es: Asegúrese de que el sistema puede arrancar con el esquema de particiones que ha planeado. Usualmente será necesario crear un sistema de ficheros separado para <filename>/boot</filename> cuando se usa RAID para el sistema de ficheros raíz (<filename>/</filename>). La mayoría de cargadores de arranque <phrase arch="x86">(incluyendo a lilo y grub)</phrase> permiten usar RAID 1 en espejo (¡sin franjas!), por lo tanto es posible usar RAID 5 para <filename>/</filename> y RAID 1 para <filename>/boot</filename>.

source: Support for MD is a relatively new addition to the installer. You may experience problems for some RAID levels and in combination with some bootloaders if you try to use MD for the root (<filename>/</filename>) file system. For experienced users, it may be possible to work around some of these problems by executing some configuration or installation steps manually from a shell.
es: La compatibilidad con MD es una característica relativamente nueva del instalador. Puede que experimente algún problema para algunos niveles RAID en combinación con algunos gestores de arranque si intenta usar MD para el sistema de ficheros raíz (<filename>/</filename>). Es posible que los usuarios experimentados puedan solucionar estos problemas ejecutando algún paso de configuración o instalación manualmente desde una interfaz de órdenes.

source: Next, you should choose <guimenuitem>Configure software RAID</guimenuitem> from the main <command>partman</command> menu. (The menu will only appear after you mark at least one partition for use as <guimenuitem>physical volume for RAID</guimenuitem>.) On the first screen of <command>mdcfg</command> simply select <guimenuitem>Create MD device</guimenuitem>. You will be presented with a list of supported types of MD devices, from which you should choose one (e.g. RAID1). What follows depends on the type of MD you selected.
es: A continuación, debe elegir <guimenuitem>Configurar RAID software</guimenuitem> desde el menú principal de <command>partman</command>. (El menú sólo aparecerá una vez haya marcado al menos una partición para que se use como <guimenuitem>volumen físico para RAID</guimenuitem>.) En la primera pantalla de <command>mdcfg</command> simplemente seleccione <guimenu>Crear un dispositivo MD</guimenu>. Se le presentará una lista de tipos de MD aceptados, de los que debe elegir uno (p. ej. RAID 1). Los siguientes pasos dependen del tipo de MD seleccionado.

source: RAID0 is simple &mdash; you will be issued with the list of available RAID partitions and your only task is to select the partitions which will form the MD.
es: RAID 0 es simple &mdash; se le presentará una lista de particiones RAID disponibles y únicamente tendrá que seleccionar las particiones que formarán el MD.

source: RAID1 is a bit more tricky. First, you will be asked to enter the number of active devices and the number of spare devices which will form the MD. Next, you need to select from the list of available RAID partitions those that will be active and then those that will be spare. The count of selected partitions must be equal to the number provided earlier. Don't worry. If you make a mistake and select a different number of partitions, &d-i; won't let you continue until you correct the issue.
es: RAID 1 es un poco más complejo. Primero, se le preguntará el número de dispositivos activos y el número de dispositivos de reserva que formarán el MD. A continuación, necesita seleccionar de la lista de particiones RAID disponibles las que estarán activas y las que quedarán en reserva. El total de las particiones seleccionadas debe ser igual al que se dio anteriormente. No se preocupe. Si comete algún error y selecciona un número distinto de particiones, &d-i; no le dejará continuar hasta que solucione el problema.

source: RAID5 has a setup procedure similar to RAID1 with the exception that you need to use at least <emphasis>three</emphasis> active partitions.
es: RAID 5 tiene un procedimiento de configuración similar al de RAID 1, con la excepción que necesita usar por lo menos <emphasis>tres</emphasis> particiones activas.

source: RAID6 also has a setup procedure similar to RAID1 except that at least <emphasis>four</emphasis> active partitions are required.
es: RAID 6 también tiene un procedimiento de configuración parecido a RAID 1 excepto que se necesita por lo menos <emphasis>four</emphasis> particiones activas.

source: RAID10 again has a setup procedure similar to RAID1 except in expert mode. In expert mode, &d-i; will ask you for the layout. The layout has two parts. The first part is the layout type. It is either <literal>n</literal> (for near copies), <literal>f</literal> (for far copies), or <literal>o</literal> (for offset copies). The second part is the number of copies to make of the data. There must be at least that many active devices so that all of the copies can be distributed onto different disks.
es: RAID 10 también tiene un procedimiento de configuración parecido a RAID1 excepto en el modo experto. En modoexperto, el &d-i; le preguntará por la disposición. La disposición consta de dos partes. La primera parte es el tipo de disposición. Puede ser <literal>n</literal> (para copias cercanas), <literal>f</literal> (para copias lejanas), u <literal>o</literal> (para copias con corrimientos). La segunda parte es el número de copias que se desea hacer de los datos. Debe haber por lo menos tantos dispositivos activos como copias estarían distribuidas en diferentes discos.

source: It is perfectly possible to have several types of MD at once. For example, if you have three 200 GB hard drives dedicated to MD, each containing two 100 GB partitions, you can combine the first partitions on all three disks into the RAID0 (fast 300 GB video editing partition) and use the other three partitions (2 active and 1 spare) for RAID1 (quite reliable 100 GB partition for <filename>/home</filename>).
es: Es perfectamente posible tener varios tipos de MD a la vez. Por ejemplo, si tiene tres discos duros de 200 GB dedicados para el MD, cada uno con dos particiones de 100 GB, puede combinar la primera partición de los tres discos en un RAID 0 (una partición rápida de 300 GB para edición de vídeo) y usar las otras tres (2 activas, 1 de reserva) en un RAID 1 (una partición bastante segura de 100 GB para <filename>/home</filename>).

source: After you set up MD devices to your liking, you can <guimenuitem>Finish</guimenuitem> <command>mdcfg</command> to return back to the <command>partman</command> to create filesystems on your new MD devices and assign them the usual attributes like mountpoints.
es: Después de configurar los MD a su gusto, elija <guimenuitem>Terminar</guimenuitem> en <command>mdcfg</command> para volver a <command>partman</command> y crear los sistemas de ficheros en sus nuevos MD y asignarles los atributos habituales, como los puntos de montaje.

source: Configuring the Logical Volume Manager (LVM)
es: Configuración del gestor de volúmenes lógicos (LVM)

source: If you are working with computers at the level of system administrator or <quote>advanced</quote> user, you have surely seen the situation where some disk partition (usually the most important one) was short on space, while some other partition was grossly underused and you had to manage this situation by moving stuff around, symlinking, etc.
es: Si trabaja con ordenadores como administrador del sistema o usuario <quote>avanzado</quote>, seguro que se ha visto en alguna situación en la que alguna partición del disco (normalmente la más importante) tenía poco espacio, mientras que otras particiones tenían mucho espacio libre malgastado, y ha tenido que solucionarlo moviendo cosas de un lado para otro, realizando enlaces simbólicos, etc.

source: To avoid the described situation you can use Logical Volume Manager (LVM). Simply said, with LVM you can combine your partitions (<firstterm>physical volumes</firstterm> in LVM lingo) to form a virtual disk (so called <firstterm>volume group</firstterm>), which can then be divided into virtual partitions (<firstterm>logical volumes</firstterm>). The point is that logical volumes (and of course underlying volume groups) can span across several physical disks.
es: Para evitar ésta situación puede usar el gestor de volúmenes lógicos («Logical Volume Manager» ó LVM , N. del T.). Una descripción sencilla de LVM es que con él puede combinar sus particiones (<firstterm>volúmenes físicos</firstterm> en jerga LVM) para formar un disco virtual (llamado <firstterm>grupo de volúmenes</firstterm>), que puede dividirse en particiones virtuales (<firstterm>volúmenes lógicos</firstterm>). Los volúmenes lógicos (y por supuesto, los grupos de volúmenes que hay debajo) pueden extenderse a lo largo de varios discos.

source: Now when you realize you need more space for your old 160GB <filename>/home</filename> partition, you can simply add a new 300GB disk to the computer, join it with your existing volume group and then resize the logical volume which holds your <filename>/home</filename> filesystem and voila &mdash; your users have some room again on their renewed 460GB partition. This example is of course a bit oversimplified. If you haven't read it yet, you should consult the <ulink url="&url-lvm-howto;">LVM HOWTO</ulink>.
es: En esta situación, cuando detecte que necesita más espacio para su vieja partición <filename>/home</filename> de 160 GB, simplemente puede añadir un nuevo disco de 300 GB al ordenador, unirlo al grupo de volúmenes existente, y entonces redimensionar el volumen lógico que sostiene su sistema de ficheros <filename>/home</filename> y ¡eureka!, sus usuarios vuelven a tener espacio en su nueva partición de 460 GB. Por supuesto, este ejemplo está muy simplificado. Si aún no lo ha leído, debería consultar el <ulink url="&url-lvm-howto;">CÓMO LVM</ulink>.

source: LVM setup in &d-i; is quite simple and completely supported inside <command>partman</command>. First, you have to mark the partition(s) to be used as physical volumes for LVM. This is done in the <guimenu>Partition settings</guimenu> menu where you should select <menuchoice> <guimenu>Use as:</guimenu> <guimenuitem>physical volume for LVM</guimenuitem> </menuchoice>.
es: La configuración LVM con el &d-i; es bastante sencilla y está totalmente permitida usando <command>partman</command>. Primero, tiene que marcar las particiones que va a usar con volúmenes físicos para el LVM. Esto se hace en el menú <guimenu>Configuración de la partición:</guimenu> donde puede seleccionar <menuchoice> <guimenu>Utilizar como:</guimenu> <guimenuitem>volumen físico para LVM</guimenuitem> </menuchoice>.

source: When you return to the main <command>partman</command> screen, you will see a new option <guimenuitem>Configure the Logical Volume Manager</guimenuitem>. When you select that, you will first be asked to confirm pending changes to the partition table (if any) and after that the LVM configuration menu will be shown. Above the menu a summary of the LVM configuration is shown. The menu itself is context sensitive and only shows valid actions. The possible actions are:
es: Cuando vuelva a la pantalla principal de <command>partman</command> verá una nueva opción: <guimenuitem>Configurar el Gestor de Volúmenes Lógicos (LVM)</guimenuitem>. Si lo selecciona se le pedirá que confirme las modificaciones que están pendientes en la tabla de particiones (si es que hay alguna) y después de esto se le mostrará el menú de configuración de LVM. Se le muestra la configuración de LVM resumida encima del menú. El menú es sensible al contexto y sólo le mostrará las acciones que sean válidas en cada momento. Las acciones posibles son:

source: <guimenuitem>Display configuration details</guimenuitem>: shows LVM device structure, names and sizes of logical volumes and more
es: <guimenuitem>Mostrar los detalles de la configuración</guimenuitem>: muestra la estructura del dispositivo LVM, y los nombres y tamaños de los volúmenes lógicos junto con otra información.

source: Create volume group
es: Crear grupo de volúmenes

source: Create logical volume
es: Crear volúmenes lógicos

source: Delete volume group
es: Borrar el grupo de volúmenes

source: Delete logical volume
es: Borrar volúmenes lógicos

source: Extend volume group
es: Extender los grupos de volúmenes

source: Reduce volume group
es: Reducir los grupos de volúmenes

source: <guimenuitem>Finish</guimenuitem>: return to the main <command>partman</command> screen
es: <guimenuitem>Terminar</guimenuitem>: vuelve a la pantalla principal de <command>partman</command>.

source: Use the options in that menu to first create a volume group and then create your logical volumes inside it.
es: Utilice las opciones en este menú para crear el grupo de volúmenes por primera vez y después cree dentro de éste sus volúmenes lógicos.

source: After you return to the main <command>partman</command> screen, any created logical volumes will be displayed in the same way as ordinary partitions (and you should treat them as such).
es: Después de volver a la pantalla principal de <command>partman</command>, verá los volúmenes lógicos como si fuesen particiones ordinarias (y debe tratarlas como tales).

source: Configuring Encrypted Volumes
es: Configurar volúmenes cifrados
