Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/using-d-i.po
Languages: es

source: If you choose guided partitioning using LVM or encrypted LVM, some changes in the partition table will need to be written to the selected disk while LVM is being set up. These changes effectively erase all data that is currently on the selected hard disk and you will not be able to undo them later. However, the installer will ask you to confirm these changes before they are written to disk.
es: Si elige el particionado guiado con LVM o LVM cifrado, es posible que algunos cambios tengan que escribirse en el disco seleccionado mientras se termina la configuración de LVM. Estos cambios borran de forma permanente todos los datos que existan en el disco que haya seleccionado y no podrán deshacerse más adelante. El instalador, sin embargo, le pedirá que confirme estos cambios antes de escribirlos en disco.

source: If you choose guided partitioning<phrase arch="linux-any"> (either classic or using (encrypted) LVM)</phrase> for a whole disk, you will first be asked to select the disk you want to use. Check that all your disks are listed and, if you have several disks, make sure you select the correct one. The order they are listed in may differ from what you are used to. The size of the disks may help to identify them.
es: Una vez haya elegido el particionado guiado<phrase arch="linux-any">, tanto en el caso del método clásico como en el caso de LVM,</phrase> se le pedirá primero que seleccione el disco que quiere utilizar. Compruebe que todos sus discos están en la lista y, si tiene más de un disco, asegúrese de escoger el disco correcto. Tenga en cuenta que el orden en el que están listados los discos puede ser distinto del que está acostumbrado. El tamaño de los discos puede ayudarle a identificarlos.

source: Any data on the disk you select will eventually be lost, but you will always be asked to confirm any changes before they are written to the disk. <phrase arch="linux-any"> If you have selected the classic method of partitioning, you will be able to undo any changes right until the end; when using (encrypted) LVM this is not possible. </phrase>
es: Se borrará cualquier dato en el disco que haya seleccionado, pero siempre se le pedirá que confirme los cambios antes de escribirlos en el disco. <phrase arch="linux-any"> Si ha seleccionado el método clásico de particionado podrá deshacer los cambios hasta el final. Esto no es posible cuando utiliza LVM (cifrado). </phrase>

source: Next, you will be able to choose from the schemes listed in the table below. All schemes have their pros and cons, some of which are discussed in <xref linkend="partitioning"/>. If you are unsure, choose the first one. Bear in mind that guided partitioning needs a certain minimal amount of free space to operate with. If you don't give it at least about 1GB of space (depends on chosen scheme), guided partitioning will fail.
es: Posteriormente podrá escoger de algunos de los esquemas listados en la tabla mostrada a continuación. Todos los esquemas tienen sus pros y sus contras, algunos de éstos se discuten en <xref linkend="partitioning"/>. Si no está seguro, escoja el primero. Tenga en mente, que el particionado guiado necesita un cierto espacio libre mínimo para operar. Si no le asigna al menos un 1 GB de espacio (depende del esquema seleccionado), el particionado guiado fallará.

source: Partitioning scheme
es: Esquema de particionado

source: Minimum space
es: Espacio mínimo

source: Created partitions
es: Particiones creadas

source: All files in one partition
es: Todos los ficheros en una partición

source: <filename>/</filename>, swap
es: <filename>/</filename>, intercambio

source: Separate /home partition
es: Partición /home separada

source: <filename>/</filename>, <filename>/home</filename>, swap
es: <filename>/</filename>, <filename>/home</filename>, intercambio

source: Separate /home, /usr, /var and /tmp partitions
es: Particiones /home, /usr, /var y /tmp separadas

source: <filename>/</filename>, <filename>/home</filename>, <filename>/usr</filename>, <filename>/var</filename>, <filename>/tmp</filename>, swap
es: <filename>/</filename>, <filename>/home</filename>, <filename>/usr</filename>, <filename>/var</filename>, <filename>/tmp</filename>, intercambio

source: If you choose guided partitioning using (encrypted) LVM, the installer will also create a separate <filename>/boot</filename> partition. The other partitions, including the swap partition, will be created inside the LVM partition.
es: El instalador creará una partición separada para <filename>/boot</filename> si escoge el guiado particionado con LVM (cifrado). Todas las demás particiones, incluyendo la partición de intercambio, se crearán dentro de la partición LVM.

source: If you choose guided partitioning for your IA-64 system, there will be an additional partition, formatted as a FAT16 bootable filesystem, for the EFI boot loader. There is also an additional menu item in the formatting menu to manually set up a partition as an EFI boot partition.
es: Si escoge el particionado automático para su sistema IA-64, habrá una partición adicional, con un sistema de ficheros FAT16 arrancable, para el gestor de arranque EFI. Además hay una opción adicional en el menú que le permite dar formato a los discos para establecer manualmente una partición como una partición de arranque EFI.

source: After selecting a scheme, the next screen will show your new partition table, including information on whether and how partitions will be formatted and where they will be mounted.
es: Después de seleccionar un esquema, la siguiente pantalla le mostrará la nueva tabla de particiones, incluyendo a qué particiones se dará formato, cómo, y dónde se montarán.

source: The list of partitions might look like this: <informalexample><screen> IDE1 master (hda) - 6.4 GB WDC AC36400L #1 primary 16.4 MB B f ext2 /boot #2 primary 551.0 MB swap swap #3 primary 5.8 GB ntfs pri/log 8.2 MB FREE SPACE IDE1 slave (hdb) - 80.0 GB ST380021A #1 primary 15.9 MB ext3 #2 primary 996.0 MB fat16 #3 primary 3.9 GB xfs /home #5 logical 6.0 GB f ext3 / #6 logical 1.0 GB f ext3 /var #7 logical 498.8 MB ext3 #8 logical 551.5 MB swap swap #9 logical 65.8 GB ext2 </screen></informalexample> This example shows two IDE harddrives divided into several partitions; the first disk has some free space. Each partition line consists of the partition number, its type, size, optional flags, file system, and mountpoint (if any). Note: this particular setup cannot be created using guided partitioning but it does show possible variation that can be achieved using manual partitioning.
es: La lista de particiones podría ser como la siguiente: <informalexample><screen> IDE1 master (hda) - 6.4 GB WDC AC36400L #1 primary 16.4 MB B f ext2 /boot #2 primary 551.0 MB swap swap #3 primary 5.8 GB ntfs pri/log 8.2 MB ESPACIO LIBRE IDE1 slave (hdb) - 80.0 GB ST380021A #1 primary 15.9 MB ext3 #2 primary 996.0 MB fat16 #3 primary 3.9 GB xfs /home #5 logical 6.0 GB f ext3 / #6 logical 1.0 GB f ext3 /var #7 logical 498.8 GB ext3 #8 logical 551.5 GB swap swap #9 logical 65.8 GB ext2 </screen></informalexample> Este ejemplo muestra dos discos duros IDE divididos en varias particiones, el primer disco tiene algo de espacio libre. Cada línea de partición está conformada por el número de partición, su tipo, tamaño, banderas opcionales, sistema de ficheros y punto de montaje (si fuese el caso). Nota: esta configuración particular no puede crearse con el particionado guiado pero sí muestra una variación que puede conseguirse utilizando el particionado manual.

source: This concludes the guided partitioning. If you are satisfied with the generated partition table, you can choose <guimenuitem>Finish partitioning and write changes to disk</guimenuitem> from the menu to implement the new partition table (as described at the end of this section). If you are not happy, you can choose to <guimenuitem>Undo changes to partitions</guimenuitem> and run guided partitioning again, or modify the proposed changes as described below for manual partitioning.
es: Esto finaliza con el particionado guiado. Si está satisfecho con la tabla de particiones generada, puede elegir <guimenuitem>Finalizar el particionado y escribir los cambios en el disco</guimenuitem> desde el menú para implementar la nueva tabla de particiones (como se describe al final de esta sección). Si no le gusta, puede elegir <guimenuitem>Deshacer los cambios realizados a las particiones</guimenuitem>, para ejecutar nuevamente el particionado guiado o modificar los cambios propuestos de forma manual tal y como se describe a continuación.

source: Manual Partitioning
es: Particionado manual

source: A similar screen to the one shown just above will be displayed if you choose manual partitioning except that your existing partition table will be shown and without the mount points. How to manually set up your partition table and the usage of partitions by your new &debian; system will be covered in the remainder of this section.
es: Una pantalla similar a la mostrada anteriormente aparecerá si elige particionar manualmente excepto que se mostrará su partición actual sin los puntos de montaje. Al final de esta sección se explica cómo configurar manualmente sus particiones y el uso de éstas en su sistema &debian; nuevo.

source: If you select a pristine disk which has neither partitions nor free space on it, you will be asked if a new partition table should be created (this is needed so you can create new partitions). After this, a new line entitled <quote>FREE SPACE</quote> should appear in the table under the selected disk.
es: Si elige un disco nuevo que no tiene ni particiones o espacio libre en él, se le podría ofrecer la creación de una nueva tabla de particiones (esto es necesario para que pueda crear nuevas particiones). Después de esto una nueva línea titulada <quote>ESPACIO LIBRE</quote> deberá aparecer bajo el disco seleccionado.

source: If you select some free space, you will have the opportunity to create a new partition. You will have to answer a quick series of questions about its size, type (primary or logical), and location (beginning or end of the free space). After this, you will be presented with a detailed overview of your new partition. The main setting is <guimenuitem>Use as:</guimenuitem>, which determines if the partition will have a file system on it, or be used for swap,<phrase arch="linux-any"> software RAID, LVM, an encrypted file system,</phrase> or not be used at all. Other settings include mountpoint, mount options, and bootable flag; which settings are shown depends on how the partition is to be used. If you don't like the preselected defaults, feel free to change them to your liking. E.g. by selecting the option <guimenuitem>Use as:</guimenuitem>, you can choose a different filesystem for this partition, including options to use the partition for swap,<phrase arch="linux-any"> software RAID, LVM,</phrase> or not use it at all. Another nice feature is the ability to copy data from an existing partition onto this one. When you are satisfied with your new partition, select <guimenuitem>Done setting up the partition</guimenuitem> and you will return to <command>partman</command>'s main screen.
es: Si elije el espacio libre, tendrá la oportunidad de crear una nueva partición. Tendrá que responder un conjunto de preguntas cortas sobre su tamaño, tipo (primaria o lógica) y ubicación (al inicio o final del espacio libre). Después de esto, se le presentará un resumen detallado sobre su nueva partición. El valor principal es <guimenuitem>Utilizar como:</guimenuitem>, que determina si la partición tendrá un sistema de ficheros o se utilizará como intercambio, <phrase arch="linux-any">RAID por software, LVM, un sistema de ficheros cifrado,</phrase> o no se utilizará. Otras opciones incluyen el punto de montaje, opciones de montaje y marca de arranque. Las opciones que se muestren dependen de cómo se va a utilizar la partición. Si no le gustan las opciones predeterminadas, no dude en cambiarlas a su gusto. Por ejemplo, si selecciona la opción <guimenuitem>Usar como:</guimenuitem>, puede elegir un sistema de ficheros distinto para esta partición, incluyendo opciones para usar la partición como intercambio, <phrase arch="linux-any">RAID por software, LVM,</phrase> o simplemente no usarla. Otra característica interesante es la posibilidad de copiar datos desde una partición existente a ésta. Cuando esté satisfecho con su nueva partición, elija <guimenuitem>Se ha terminado de definir la partición</guimenuitem> y regresará a la pantalla principal de <command>partman</command>.

source: If you decide you want to change something about your partition, simply select the partition, which will bring you to the partition configuration menu. This is the same screen as is used when creating a new partition, so you can change the same settings. One thing that may not be very obvious at a first glance is that you can resize the partition by selecting the item displaying the size of the partition. Filesystems known to work are at least fat16, fat32, ext2, ext3 and swap. This menu also allows you to delete a partition.
es: Si decide que desea cambiar algo en su partición, simplemente elija la partición, lo cual le conducirá al menú de configuración de la partición. Esta es la misma pantalla que cuando crea la partición, así que puede cambiar el mismo conjunto de opciones. Algo que podría no ser muy obvio a primera vista, es que puede redimensionar el tamaño de la partición seleccionando el elemento que muestra el tamaño de ésta. Los sistemas de ficheros que se conoce que funcionan con esta opción son por lo menos fat16, fat32, ext2, ext3 y «swap». Este menú también le permite eliminar una partición.

source: Be sure to create at least two partitions: one for the <emphasis>root</emphasis> filesystem (which must be mounted as <filename>/</filename>) and one for <emphasis>swap</emphasis>. If you forget to mount the root filesystem, <command>partman</command> won't let you continue until you correct this issue.
es: Asegúrese de crear al menos dos particiones: una para el sistema de ficheros <emphasis>raíz</emphasis> (que debe montarse en <filename>/</filename>) y otra para el <emphasis>espacio de intercambio</emphasis>. Si olvida montar el sistema de ficheros raíz, <command>partman</command> no le dejará continuar hasta que corrija esto.

source: If you forget to select and format an EFI boot partition, <command>partman</command> will detect this and will not let you continue until you allocate one.
es: Si olvida seleccionar y dar formato a una partición de arranque EFI <command>partman</command> lo detectará y no le dejará continuar hasta que habilite una.

source: Capabilities of <command>partman</command> can be extended with installer modules, but are dependent on your system's architecture. So if you can't see all promised goodies, check if you have loaded all required modules (e.g. <filename>partman-ext3</filename>, <filename>partman-xfs</filename>, or <filename>partman-lvm</filename>).
es: Se pueden extender las capacidades de <command>partman</command> con módulos para el instalador, pero dependen de la arquitectura de su sistema. Así que si no están disponibles todas las funcionalidades que esperaba, compruebe que ha cargado todos los módulos necesarios (p. ej. <filename>partman-ext3</filename>, <filename>partman-xfs</filename>, o <filename>partman-lvm</filename>).

source: After you are satisfied with partitioning, select <guimenuitem>Finish partitioning and write changes to disk</guimenuitem> from the partitioning menu. You will be presented with a summary of changes made to the disks and asked to confirm that the filesystems should be created as requested.
es: Cuando esté satisfecho con el particionado, seleccione <guimenuitem>Finalizar el particionado y escribir los cambios en el disco</guimenuitem> del menú de particionado. Se le presentará un resumen de los cambios realizados en los discos y se le pedirá confirmación para crear los sistemas de ficheros solicitados.

source: Configuring Multidisk Devices (Software RAID)
es: Configuración de dispositivos multidisco (RAID)

source: If you have more than one harddrive<footnote><para> To be honest, you can construct an MD device even from partitions residing on single physical drive, but that won't give any benefits. </para></footnote> in your computer, you can use <command>mdcfg</command> to set up your drives for increased performance and/or better reliability of your data. The result is called <firstterm>Multidisk Device</firstterm> (or after its most famous variant <firstterm>software RAID</firstterm>).
es: Si tiene más de un disco duro<footnote><para> Siendo honestos, puede construir un MD (Metadispositivo) incluso con particiones de un mismo disco físico, pero no tiene ninguna ventaja. </para></footnote> en su ordenador, con <command>mdcfg</command> puede configurar sus discos para un mayor rendimiento y/o una mayor seguridad de los datos. El resultado se denomina <firstterm>Dispositivo multidisco</firstterm> (o como su variante más conocida <firstterm>RAID</firstterm>).

source: MD is basically a bunch of partitions located on different disks and combined together to form a <emphasis>logical</emphasis> device. This device can then be used like an ordinary partition (i.e. in <command>partman</command> you can format it, assign a mountpoint, etc.).
es: Básicamente el metadispositivo es un grupo de particiones de distintos discos combinadas para formar un dispositivo <emphasis>lógico</emphasis>. Este dispositivo puede usarse como una partición ordinaria (p.ej. puede darle formato con <command>partman</command>, asignarle un punto de montaje, etc.).
