Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/using-d-i.po
Languages: es

source: During installation of the base system, package unpacking and setup messages are redirected to <userinput>tty4</userinput>. You can access this terminal by pressing <keycombo><keycap>Left Alt</keycap><keycap>F4</keycap></keycombo>; get back to the main installer process with <keycombo><keycap>Left Alt</keycap><keycap>F1</keycap></keycombo>.
es: Durante la instalación del sistema base, los mensajes de desempaquetado y configuración de los paquetes se redirigen a <userinput>tty4</userinput>. Puede acceder a esta terminal pulsando <keycombo><keycap>Alt izquierdo</keycap><keycap>F4</keycap></keycombo>; y volver al proceso principal del instalador con <keycombo><keycap>Alt izquierdo</keycap><keycap>F1</keycap></keycombo>.

source: The unpack/setup messages generated during this phase are also saved in <filename>/var/log/syslog</filename>. You can check them there if the installation is performed over a serial console.
es: Los mensajes de desempaquetado y configuración generados durante esta fase se guardan en <filename>/var/log/syslog</filename>. Puede verlos ahí en caso de que la instalación se realice a través de una consola serie.

source: As part of the installation, a &arch-kernel; kernel will be installed. At the default priority, the installer will choose one for you that best matches your hardware. In lower priority modes, you will be able to choose from a list of available kernels.
es: Se instalará un núcleo &arch-kernel; como parte de la instalación. En la prioridad predeterminada, el instalador elegirá por usted el que mejor se adapte a su hardware. En los modos de menor prioridad, podrá elegir uno entre una lista de núcleos disponibles.

source: When packages are installed using the package management system, it will by default also install packages that are recommended by those packages. Recommended packages are not strictly required for the core functionality of the selected software, but they do enhance that software and should, in the view of the package maintainers, normally be installed together with that software.
es: Cuando los paquetes se instalan mediante el sistema de gestión de software, también se instalarán de forma predeterminada los paquetes recomendados por esos paquetes. Los paquetes recomendados no son estrictamente necesarios para la funcionalidad básica de los programas seleccionados, pero mejoran esos programas y deberían, dependiendo de los responsables de los paquetes, ser instalados junto con esos programas.

source: For technical reasons packages installed during the installation of the base system are installed without their <quote>Recommends</quote>. The rule described above only takes effect after this point in the installation process.
es: Por razones técnicas, los paquetes instalados durante la instalación del sistema base se instalan sin sus paquetes recomendados (<quote>Recommends</quote>). La regla descrita anteriormente sólo tiene efecto después de este punto del proceso de instalación.

source: Installing Additional Software
es: Instalar programas adicionales

source: At this point you have a usable but limited system. Most users will want to install additional software on the system to tune it to their needs, and the installer allows you do so. This step can take even longer than installing the base system if you have a slow computer or network connection.
es: A partir de este punto tendrá un sistema usable pero limitado. La mayoría de los usuarios querrán instalar programas adicionales en el sistema para ajustarlo a sus necesidades, y el instalador le permite hacer esto. Este paso puede tardar más tiempo que la instalación del sistema base si tiene un ordenador lento o su conexión de red es lenta.

source: Configuring apt
es: Configurar apt

source: One of the tools used to install packages on a &debian-gnu; system is a program called <command>apt-get</command>, from the <classname>apt</classname> package<footnote> <para> Note that the program which actually installs the packages is called <command>dpkg</command>. However, this program is more of a low-level tool. <command>apt-get</command> is a higher-level tool, which will invoke <command>dpkg</command> as appropriate. It knows how to retrieve packages from your CD, the network, or wherever. It is also able to automatically install other packages which are required to make the package you're trying to install work correctly. </para> </footnote>. Other front-ends for package management, like <command>aptitude</command> and <command>synaptic</command>, are also in use. These front-ends are recommended for new users, since they integrate some additional features (package searching and status checks) in a nice user interface. In fact, <command>aptitude</command> is now the recommended utility for package management.
es: Una de las herramientas utilizadas para instalar paquetes en un sistema &debian-gnu; es el programa <command>apt-get</command>, que está dentro del paquete <classname>apt</classname>.<footnote> <para> En realidad el programa que instala los paquetes se llama <command>dpkg</command>. Este programa es, sin embargo, una herramienta de bajo nivel. <command>apt-get</command> es una herramienta de más alto nivel que llama a <command>dpkg</command> cuando sea necesario. Sabe cómo obtener los paquetes: de un CD, de la red o de cualquier otra ubicación. También es capaz de instalar otros paquetes indispensables para que los paquetes que usted intenta instalar funcionen adecuadamente. </para> </footnote> Existen otras interfaces a la gestión de paquetes, como <command>aptitude</command> y <command>synaptic</command>. Se recomienda a los usuarios nóveles que utilicen estas interfaces ya que integran otras funciones adicionales (como la búsqueda de paquetes y comprobaciones de estado) en un interfaz de usuario más amigable. De hecho, la herramienta recomendada para la gestión de paquetes es <command>aptitude</command>.

source: <command>apt</command> must be configured so that it knows from where to retrieve packages. The results of this configuration are written to the file <filename>/etc/apt/sources.list</filename>. You can examine and edit this file to your liking after the installation is complete.
es: Debe configurar <command>apt</command> para que sepa de dónde descargar paquetes. Los resultados de la configuración realizada se guardan en el fichero <filename>/etc/apt/sources.list</filename>. Podrá examinar y editar este fichero a su gusto una vez haya terminado la instalación.

source: If you are installing at default priority, the installer will largely take care of the configuration automatically, based on the installation method you are using and possibly using choices made earlier in the installation. In most cases the installer will automatically add a security mirror and, if you are installing the stable distribution, a mirror for the <quote>volatile</quote> update service.
es: Si está instalando con la prioridad predeterminada, basado en el método de instalación que esté usando y posiblemente usando las elecciones previas en la instalación, el instalador se encargará en gran medida de la configuración de forma automática. La mayor parte de ocasiones el instalador añadirá automáticamente una réplica de seguridad, y si está instalando una distribución estable, una réplica para el servicio de actualización <quote>volatile</quote>.

source: If you are installing at a lower priority (e.g. in expert mode), you will be able to make more decisions yourself. You can choose whether or not to use the security and/or volatile update services, and you can choose to add packages from the <quote>contrib</quote> and <quote>non-free</quote> sections of the archive.
es: Tendrá oportunidad de tomar muchas más decisiones por su cuenta si está usando en la instalación una prioridad menor (p.e. modo experto). Puede elegir usar o no los servicios securidad y/o volatile, y puede elegir añadir paquetes de las secciones del archivo <quote>contrib</quote> y <quote>non-free</quote>.

source: Installing from more than one CD or DVD
es: Instalar desde uno o más CDs o DVDs

source: If you are installing from a CD or a DVD that is part of a larger set, the installer will ask if you want to scan additional CDs or DVDs. If you have additional CDs or DVDs available, you probably want to do this so the installer can use the packages included on them.
es: Si instala desde un CD o un DVD que hace parte de un conjunto más grande, el instalador le preguntará si desea explorar CDs o DVDs adicionales. Si tiene CDs o DVDs adicionales, probablemente deseará hacerlo, de forma que el instalador pueda usar los paquetes incluídos en ellos.

source: If you do not have any additional CDs or DVDs, that is no problem: using them is not required. If you also do not use a network mirror (as explained in the next section), it can mean that not all packages belonging to the tasks you select in the next step of the installation can be installed.
es: Si no tiene CDs o DVDs adicionales, no hay problema: no son indispensables. Si tampoco usa una réplica de red(como se explica en la sección siguiente), podría darse que no todos los paquetes pertenecientes a las tareas que seleccione en el siguiente paso de la instalación puedan instalarse.

source: Packages are included on CDs (and DVDs) in the order of their popularity. This means that for most uses only the first CDs in a set are needed and that only very few people actually use any of the packages included on the last CDs in a set.
es: Los paquetes se incluyen en los CDs (y DVDs) de acuerdo con su popularidad. Esto significa que en la mayoría de casos, solamente se necesita el primer CD de un conjunto y que muy poca gente realmente usa cualesquiera de los paquetes incluidos en el último CD de un conjunto.

source: It also means that buying or downloading and burning a full CD set is just a waste of money as you'll never use most of them. In most cases you are better off getting only the first 3 to 8 CDs and installing any additional packages you may need from the Internet by using a mirror. The same goes for DVD sets: the first DVD, or maybe the first two DVDs will cover most needs.
es: También significa que comprar o descargar y quemar el conjunto completo de CDs es un desperdicio de dinero, debido a que usted no usará la mayoría de ellos. En general, es mejor obtener solamente entre los primeros 3 y 8 CDs y usar una réplica de red por Internet para instalar cualquier paquete adicional. De igual forma sucede con los conjuntos de DVDs: el primer DVD, o el primer y segundo DVD suplirían la mayoría de necesidades.

source: A good rule of thumb is that for a regular desktop installation (using the GNOME desktop environment) only the first three CDs are needed. For the alternative desktop environments (KDE or Xfce), additional CDs are needed. The first DVD easily covers all three desktop environments.
es: Por norma general, para una instalación de escritorio habitual(usando el ambiente de escritorio GNOME), basta con los primeros tres CDs. Para los ambientes de escritorio alternativos(KDE o Xfce), se requieren CDs adicionales. El primer DVD cubre sin problema los tres ambientes de escritorio.

source: If you do scan multiple CDs or DVDs, the installer will prompt you to exchange them when it needs packages from another CD/DVD than the one currently in the drive. Note that only CDs or DVDs that belong to the same set should be scanned. The order in which they are scanned does not really matter, but scanning them in ascending order will reduce the chance of mistakes.
es: Si usted explora varios CDs o DVDs, el instalador le solicitará insertarlos uno a uno cuando necesite paquetes de otro CD/DVD que no estén en el que esté en la unidad. Tenga en cuenta que debería explorar únicamente CDs o DVDs que pertenezcan al mismo conjunto. El orden en el que se exploren no interesa, pero explorarlos en orden ascendente reducirá posibles equivocaciones.

source: Using a network mirror
es: Usar una réplica en red

source: One question that will be asked during most installs is whether or not to use a network mirror as a source for packages. In most cases the default answer should be fine, but there are some exceptions.
es: Una pregunta que se hará durante la mayoría de instalaciones es si se desea o no usar una réplica en red como fuente de paquetes. En la mayoría de oportunidades, la respuesta predeterminada es la adecuada, pero hay excepciones.

source: If you are <emphasis>not</emphasis> installing from a full CD or DVD or using a full CD/DVD image, you really should use a network mirror as otherwise you will end up with only a very minimal system. However, if you have a limited Internet connection it is best <emphasis>not</emphasis> to select the <literal>desktop</literal> task in the next step of the installation.
es: Si <emphasis>no</emphasis> está instalando desde un CD o DVD commpleto o usando una imagen completa de CD/DVD, debería querer usar una réplica en red, puesto que de otra manera terminaría con un sistema muy mínimo. Pero, si tiene una conexión a Internet limitada, es mejor <emphasis>not</emphasis> seleccionar la tarea <literal>desktop</literal> en el paso siguiente de la instalación.

source: If you are installing from a single full CD or using a full CD image, using a network mirror is not required, but is still strongly recommended because a single CD contains only a fairly limited number of packages. If you have a limited Internet connection it may still be best to <emphasis>not</emphasis> select a network mirror here, but to finish the installation using only what's available on the CD and selectively install additional packages after the installation (i.e. after you have rebooted into the new system).
es: Si instala desde un solo CD completo o con una imagen completa de CD, no es necesaria una réplica en red, pero es muy recomendado emplearla porque un solo CD contiene solamente una cantidad limitada de paquetes. Si tiene una conexión a Internet limitada, podría ser mejor <emphasis>no</emphasis> seleccionar una réplica en red en este momento y más bien culminar la instalación usando únicamente lo que está en el CD e instalar selectivamente paquetes adicionales después de la instalación (esto es, después de haber reiniciado en el nuevo sistema).

source: If you are installing from a DVD or using a DVD image, any packages needed during the installation should be present on the first DVD. The same is true if you have scanned multiple CDs as explained in the previous section. Use of a network mirror is optional.
es: Si instala desde un DVD o una imagen de DVD, cualquier paquete que necesite druante la instalación debería estar presente en el primer DVD. De la misma forma si ha explorado varios CDs como se explicó en la sección anterior. El uso de una réplica en red es opcional.

source: One advantage of adding a network mirror is that updates that have occurred since the CD/DVD set was created and have been included in a point release, will become available for installation, thus extending the life of your CD/DVD set without compromising the security or stability of the installed system.
es: Una ventaja de añadir una réplica en red es que las actualizaciones que hayan ocurrido desde el momento en que el conjunto de CDs/DVDs fue creado y hecho público, estarán disponibles para instalarse, extendiendo de esta manera la vida de su conjunto de CDs/DVDs sin comprometer la seguridad o estabilidad del sistema instalado.

source: In summary: selecting a network mirror is generally a good idea, except if you do not have a good Internet connection. If the current version of a package is available from CD/DVD, the installer will always use that. The amount of data that will be downloaded if you do select a mirror thus depends on
es: En Resumen: el seleccionar una réplica en red en general es una buena idea, excepto si no tiene una conexión a Internet buena. Si la versión actual de un paquete está disponible en un CD/DVD, el instalador siempre lo usará. La cantidad de datos que se descargará si usted ha seleccionado una réplica en red dependerá de:

source: the tasks you select in the next step of the installation,
es: las tareas que seleccione en el paso siguiente de esta instalación,

source: which packages are needed for those tasks,
es: los paquetes que se requieran para esas tareas,

source: which of those packages are present on the CDs or DVDs you have scanned, and
es: cuales de esos paquetes estén presentes en los CDs o DVDs que haya explorado, y

source: whether any updated versions of packages included on the CDs or DVDs are available from a mirror (either a regular package mirror, or a mirror for security or volatile updates).
es: si hay versiones actualizadas en las réplicas en red de los paquetes incluídos en los CDs o DVDs(bien sea para una réplica en red de paquetes o una réplica de seguridad o actualizaciones volátiles).

source: Note that the last point means that, even if you choose not to use a network mirror, some packages may still be downloaded from the Internet if there is a security or volatile update available for them and those services have been configured.
es: Observe que el último punto significa que, incluso si usted no ha seleccionado una réplica en red, algunos paquetes pueden descargarse de Internet si hay actualizaciones de seguridad o volátiles para aquellos servicios que se hayan configurado.

source: Selecting and Installing Software
es: Elegir e instalar programas

source: During the installation process, you are given the opportunity to select additional software to install. Rather than picking individual software packages from the &num-of-distrib-pkgs; available packages, this stage of the installation process focuses on selecting and installing predefined collections of software to quickly set up your computer to perform various tasks.
es: Se le da la oportunidad durante el proceso de instalación de seleccionar e instalar programas adicionales. Esta fase de la instalación está enfocada en la selección e instalación de conjuntos predefinidos de programas para preparar su sistema para realizar distintas tareas, en lugar de elegir programas de paquetes individuales de entre los &num-of-distrib-pkgs; paquetes disponibles.

source: So, you have the ability to choose <emphasis>tasks</emphasis> first, and then add on more individual packages later. These tasks loosely represent a number of different jobs or things you want to do with your computer, such as <quote>Desktop environment</quote>, <quote>Web server</quote>, or <quote>Print server</quote><footnote> <para> You should know that to present this list, the installer is merely invoking the <command>tasksel</command> program. It can be run at any time after installation to install more packages (or remove them), or you can use a more fine-grained tool such as <command>aptitude</command>. If you are looking for a specific single package, after installation is complete, simply run <userinput>aptitude install <replaceable>package</replaceable></userinput>, where <replaceable>package</replaceable> is the name of the package you are looking for. </para> </footnote>. <xref linkend="tasksel-size-list"/> lists the space requirements for the available tasks.
es: Así pues, podrá elegir en primer lugar <emphasis>tareas</emphasis> y podrá añadir programas individuales más adelante. Estas tareas representan un conjunto de tareas o cosas que querrá realizar con su sistema. Ejemplo de estas tareas son: <quote>Entorno de escritorio</quote>, <quote>Servidor web</quote> o <quote>Servidor de impresión</quote><footnote> <para> Debería saber que para obtener esta lista el instalador simplemente llama al programa <command>tasksel</command>. Este programa puede ejecutarse en cualquier momento después de la instalación para instalar (o eliminar) más paquetes.También puede utilizar una herramienta de selección de grano más fino como puede ser <command>aptitude</command>. Si está buscando un paquete específico sólo tiene que ejecutar, después de la instalación <userinput>aptitude install <replaceable>paquete</replaceable></userinput>, donde <replaceable>paquete</replaceable> es el nombre del paquete que está buscando. </para> </footnote>. Puede encontrar una lista de los requisitos de espacio de las tareas disponibles en <xref linkend="tasksel-size-list"/>.

source: Some tasks may be pre-selected based on the characteristics of the computer you are installing. If you disagree with these selections you can deselect them. You can even opt to install no tasks at all at this point.
es: Algunas de las tareas estarán preseleccionadas basándose en las características del sistema que está instalando. Deseleccione estas tareas si no está de acuerdo con esta selección. También puede elegir no instalar ninguna tarea en este punto.

source: In the standard user interface of the installer, you can use the space bar to toggle selection of a task.
es: Puede usar la barra de espacio para marcar la selección de una tarea en la interfaz de usuario estándar del instalador.

source: Unless you are using the special KDE or Xfce/LXDE CDs, the <quote>Desktop environment</quote> task will install the GNOME desktop environment.
es: A no ser que esté utilizando los CDs especiales de KDE o Xfce/LXDE la tarea <quote>Entorno de escritorio</quote> instalará un entorno de escritorio de GNOME.

source: It is not possible to interactively select a different desktop during the installation. However, it <emphasis>is</emphasis> possible to get &d-i; to install a KDE desktop environment instead of GNOME by using preseeding (see <xref linkend="preseed-pkgsel"/>) or by adding the parameter <literal>desktop=kde</literal> at the boot prompt when starting the installer. Alternatively the more lightweight Xfce and LXDE desktop environments can be selected by using <literal>desktop=xfce</literal> or <literal>desktop=lxde</literal>.
es: No es posible seleccionar otro entorno de escritorio de forma interactiva durante la instalación. Sin embargo <emphasis>sí</emphasis> puede hacer que &d-i; instale un entorno de escritorio de KDE en lugar de GNOME utilizando preconfiguración (consulte <xref linkend="preseed-pkgsel"/>) o añadiendo <literal>desktop=kde</literal> al indicador de arranque cuando se va a ejecutar el instalador. También puede instalar los entornos de escritorio Xfce y LXDE, más ligeros, utilizando <literal>desktop=xfce</literal> o <literal>desktop=lxde</literal>.

source: Some CD images (businesscard, netinst and DVD) also allow selection of the desired desktop environment from the graphical boot menu. Select the <quote>Advanced options</quote> option in the main menu and look for <quote>Alternative desktop environments</quote>.
es: Algunas imágenes de CD («tarjeta de visita», «netinst» y DVD) también permiten seleccionar el entorno de escritorio deseado desde el menú gráfico de arranque. Seleccione la opción <quote>Opciones avanzadas</quote> en el menú principal y busque <quote>Entornos de escritorio alternativos</quote>.
