Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/using-d-i.po
Languages: es

source: Using the &debian; Installer
es: Usar el instalador de &debian;

source: How the Installer Works
es: Funcionamiento del instalador

source: The &debian; Installer consists of a number of special-purpose components to perform each installation task. Each component performs its task, asking the user questions as necessary to do its job. The questions themselves are given priorities, and the priority of questions to be asked is set when the installer is started.
es: El instalador de &debian; está compuesto por un conjunto de componentes de propósito específico para realizar cada tarea de la instalación. Cada componente realiza una tarea, formulando al usuario las preguntas que sean necesarias para realizar su trabajo. Se asignan prioridades a cada una de las preguntas, definiendo al arrancar el instalador la prioridad de las preguntas a mostrar.

source: When a default installation is performed, only essential (high priority) questions will be asked. This results in a highly automated installation process with little user interaction. Components are automatically run in sequence; which components are run depends mainly on the installation method you use and on your hardware. The installer will use default values for questions that are not asked.
es: Cuando se realiza una instalación estándar, solamente se formularán las preguntas esenciales (prioridad alta). Esto tiene como consecuencia un proceso de instalación altamente automatizado y con poca interacción del usuario. Los componentes son ejecutados automáticamente en una secuencia predeterminada. Los componentes a ejecutar dependerán del método de instalación que use y de su hardware. El instalador usará los valores predeterminados para las preguntas que no son formuladas.

source: If there is a problem, the user will see an error screen, and the installer menu may be shown in order to select some alternative action. If there are no problems, the user will never see the installer menu, but will simply answer questions for each component in turn. Serious error notifications are set to priority <quote>critical</quote> so the user will always be notified.
es: Cuando exista un problema, el usuario verá el error en pantalla, y es posible que se muestre el menú del instalador para que elija de éste alguna acción alternativa. El usuario no verá el menú del instalador si no se produce ningún problema, simplemente tendrá que responder las preguntas formuladas por cada componente en cada paso. Se fija prioridad crítica (<quote>critical</quote>) para cualquier notificación de un error serio, por lo que el usuario siempre será notificado de estos.

source: Some of the defaults that the installer uses can be influenced by passing boot arguments when &d-i; is started. If, for example, you wish to force static network configuration (DHCP is used by default if available), you could add the boot parameter <userinput>netcfg/disable_dhcp=true</userinput>. See <xref linkend="installer-args"/> for available options.
es: Algunos de los valores predeterminados que usa el instalador pueden ser modificados mediante la introducción de argumentos de arranque en el inicio del &d-i;. Si, por ejemplo, desea forzar la configuración de red estática (se usa DHCP como opción predeterminada si este protocolo está disponible), puede utilizar el parámetro de arranque <userinput>netcfg/disable_dhcp=true</userinput>. Puede consultar todas las opciones disponibles en <xref linkend="installer-args"/>.

source: Power users may be more comfortable with a menu-driven interface, where each step is controlled by the user rather than the installer performing each step automatically in sequence. To use the installer in a manual, menu-driven way, add the boot argument <userinput>priority=medium</userinput>.
es: Es posible que los usuarios avanzados estén más cómodos si utilizan la interfaz basada en menú, donde el control de cada paso lo tiene el usuario en lugar de que éstos se ejecuten de forma automática en una secuencia predeterminada por el instalador. Para usar el instalador en el modo manual, gestionado a través de un menú, añada el argumento de arranque <userinput>priority=medium</userinput>.

source: If your hardware requires you to pass options to kernel modules as they are installed, you will need to start the installer in <quote>expert</quote> mode. This can be done by either using the <command>expert</command> command to start the installer or by adding the boot argument <userinput>priority=low</userinput>. Expert mode gives you full control over &d-i;.
es: Deberá iniciar el instalador en modo <quote>expert</quote> si para hacer funcionar o detectar su hardware es necesario que indique opciones para los módulos del núcleo conforme se instalen. Esto puede realizarse ya sea usando la orden <command>expert</command> al iniciar el instalador o bien añadiendo el argumento de arranque <userinput>priority=low</userinput>. El modo experto le da control total del &d-i;.

source: For this architecture the &d-i; supports two different user interfaces: a character-based one and a graphical one. The character-based interface is used by default unless you selected the <quote>Graphical install</quote> option in the initial boot menu. For more information about the graphical installer, please refer to <xref linkend="graphical"/>.
es: En esta arquitectura el &d-i; ofrece dos interfaces de usuario: una basada en caracteres y otra gráfica. La interfaz basada en caracteres se usa de forma predeterminada a menos que seleccione la opción <quote>Graphical install</quote> en el menú inicial de arranque. Consulte más información acerca del instalador gráfico en <xref linkend="graphical"/>.

source: For this architecture the installer uses a character-based user interface. A graphical user interface is currently not available.
es: En esta arquitectura el instalador usa una interfaz basada en texto. En la actualidad no está disponible una interfaz gráfica.

source: In the character-based environment the use of a mouse is not supported. Here are the keys you can use to navigate within the various dialogs. The <keycap>Tab</keycap> or <keycap>right</keycap> arrow keys move <quote>forward</quote>, and the <keycombo> <keycap>Shift</keycap> <keycap>Tab</keycap> </keycombo> or <keycap>left</keycap> arrow keys move <quote>backward</quote> between displayed buttons and selections. The <keycap>up</keycap> and <keycap>down</keycap> arrow select different items within a scrollable list, and also scroll the list itself. In addition, in long lists, you can type a letter to cause the list to scroll directly to the section with items starting with the letter you typed and use <keycap>Pg-Up</keycap> and <keycap>Pg-Down</keycap> to scroll the list in sections. The <keycap>space bar</keycap> selects an item such as a checkbox. Use &enterkey; to activate choices.
es: El ratón no se puede utilizar en la interfaz basada en caracteres. A continuación se indican algunas teclas que puede usar para moverse en los diversos diálogos. El <keycap>Tabulador</keycap> o la tecla con la flecha <keycap>derecha</keycap> realizan desplazamientos <quote>hacia adelante</quote>, la combinación de teclas <keycombo> <keycap>Shift</keycap> <keycap>Tabulador</keycap> </keycombo> y la tecla con la flecha <keycap>izquierda</keycap> le desplaza <quote>hacia atrás</quote> entre los botones y las opciones. Las teclas con la flecha <keycap>arriba</keycap> y <keycap>abajo</keycap> se mueven entre los distintos elementos disponibles en una lista desplazable, y también desplazan a la lista en sí (cuando se llega al final de la pantalla, N. del t.). Además, en listas largas, usted puede escribir una letra para hacer que la lista se desplace directamente a la sección con elementos que se inicien con la letra que ha escrito y usar las teclas <keycap>Re-Pág</keycap> (Retroceso de página) y <keycap>Av-Pág</keycap> (Avance de página) para desplazarse entre la lista por secciones. La <keycap>barra de espacio</keycap> marca un elemento, como en el caso de una casilla. Pulse &enterkey; para activar las opciones elegidas.

source: Some dialogs may offer additional help information. If help is available this will be indicated on the bottom line of the screen by displaying that help information can be accessed by pressing the <keycap>F1</keycap> key.
es: Puede que algunos diálogos ofrezcan información de ayuda adicional. Si se ofrece ayuda, se indicará en la parte inferior de la pantalla mostrando que puede acceder a la información de ayuda pulsando la tecla <keycap>F1</keycap>.

source: S/390 does not support virtual consoles. You may open a second and third ssh session to view the logs described below.
es: S/390 permite el uso de consolas virtuales. Puede abrir una segunda y tercera sesión de ssh para poder ver los mensajes de registro descritos a continuación.

source: Error messages and logs are redirected to the fourth console. You can access this console by pressing <keycombo><keycap>Left Alt</keycap><keycap>F4</keycap></keycombo> (hold the left <keycap>Alt</keycap> key while pressing the <keycap>F4</keycap> function key); get back to the main installer process with <keycombo><keycap>Left Alt</keycap><keycap>F1</keycap></keycombo>.
es: Los mensajes de error y de registro se redireccionan a la cuarta consola. Puede acceder a ésta pulsando <keycombo><keycap>Alt Izq</keycap><keycap>F4</keycap></keycombo> (mantenga presionada la tecla <keycap>Alt</keycap> mientras presiona la tecla de función <keycap>F4</keycap>). Para volver al proceso de instalación principal pulse <keycombo><keycap>Alt Izq</keycap><keycap>F1</keycap></keycombo>.

source: These messages can also be found in <filename>/var/log/syslog</filename>. After installation, this log is copied to <filename>/var/log/installer/syslog</filename> on your new system. Other installation messages may be found in <filename>/var/log/</filename> during the installation, and <filename>/var/log/installer/</filename> after the computer has been booted into the installed system.
es: También puede encontrar los mensajes de error en <filename>/var/log/syslog</filename>. Este registro se copia a <filename>/var/log/installer/syslog</filename> en su nuevo sistema una vez finalizada la instalación. Durante el proceso de instalación puede encontrar otros mensajes en <filename>/var/log/</filename>, y en <filename>/var/log/installer/</filename> después de que el ordenador haya sido iniciado con el sistema instalado.

source: Components Introduction
es: Introducción a los componentes

source: Here is a list of installer components with a brief description of each component's purpose. Details you might need to know about using a particular component are in <xref linkend="module-details"/>.
es: A continuación se muestra una lista de los componentes del instalador con una breve descripción del propósito de cada uno. Puede encontrar los detalles que necesite conocer de un determinado componente en la <xref linkend="module-details"/>.

source: Shows the list of components to the user during installer operation, and starts a component when it is selected. Main-menu's questions are set to priority medium, so if your priority is set to high or critical (high is the default), you will not see the menu. On the other hand, if there is an error which requires your intervention, the question priority may be downgraded temporarily to allow you to resolve the problem, and in that case the menu may appear.
es: Muestra al usuario la lista de componentes durante el trabajo del instalador, e inicia un componente cuando se selecciona. Las preguntas de <quote>main-menu</quote> tienen prioridad media (<quote>medium</quote>), de modo que no verá el menú si define su prioridad a valores alto (<quote>high</quote>) ó crítico (<quote>critical</quote>). El valor predeterminado es alto. Por otro lado, se reducirá temporalmente la prioridad de alguna pregunta si se produce un error que haga necesaria su intervención de forma que pueda resolver el problema. En este caso es posible que aparezca el menú.

source: You can get to the main menu by selecting the &BTN-GOBACK; button repeatedly to back all the way out of the currently running component.
es: Puede volver al menú principal pulsando repetidamente el botón &BTN-GOBACK; hasta salir del componente que está ejecutando.

source: Allows the user to select localization options for the installation and the installed system: language, country and locales. The installer will display messages in the selected language, unless the translation for that language is not complete in which case some messages may be shown in English.
es: Permite que el usuario seleccione las opciones de localización tanto para la instalación como para el sistema a instalar. Estas opciones incluyen idioma, país y valores de localización. El instalador mostrará los mensajes en el idioma seleccionado a menos que la traducción para ese idioma no esté completa, en cuyo caso podrán mostrarse algunos mensajes en inglés.

source: Shows a list of keyboards, from which the user chooses the model which matches his own.
es: Muestra una lista de teclados, de la cual el usuario elije el modelo que corresponda al suyo.

source: Automatically detects most of the system's hardware, including network cards, disk drives, and PCMCIA.
es: Detecta automáticamente la mayoría del hardware del sistema, incluyendo tarjetas de red, discos duros y PCMCIA.

source: Looks for and mounts a &debian; installation CD.
es: Busca y monta un CD de instalación de &debian;.

source: Configures the computer's network connections so it can communicate over the internet.
es: Configura las conexiones de red del ordenador de modo que éste pueda comunicarse a través de Internet.

source: Searches for ISO images (<filename>.iso</filename> files) on hard drives.
es: Busca imágenes ISO (ficheros <filename>.iso</filename>) en el disco duro.

source: Presents a list of &debian; archive mirrors. The user may choose the source of his installation packages.
es: Presenta una lista de los servidores de réplica del archivo de &debian;. El usuario puede elegir la fuente que se utilizará para sus paquetes de instalación.

source: Checks integrity of a CD-ROM. This way, the user may assure him/herself that the installation CD-ROM was not corrupted.
es: Verifica la integridad de un CD-ROM. De esta forma el usuario puede asegurarse por sí mismo que el CD-ROM de instalación no está dañado.

source: Lowmem tries to detect systems with low memory and then does various tricks to remove unnecessary parts of &d-i; from the memory (at the cost of some features).
es: Lowmem intenta detectar sistemas con poca memoria y entonces realiza varios trucos para eliminar partes innecesarias del &d-i; en la memoria (a costa de algunas características).

source: Anna's Not Nearly APT. Installs packages which have been retrieved from the chosen mirror or CD.
es: <quote>Anna's Not Nearly APT</quote> (Anna casi no es APT, N. del t.). Instala paquetes que han sido obtenidos del servidor de réplica escogido o del CD-ROM.

source: Sets up the root password, and adds a non-root user.
es: Configura la contraseña del usuario «root» (administrador) y añade un usuario no-administrador.

source: Updates the system clock and determines whether the clock is set to UTC or not.
es: Actualiza el reloj del sistema y determina si el reloj está fijado como UTC o no.

source: Selects the time zone, based on the location selected earlier.
es: Selecciona la zona horaria, basada en el lugar seleccionado previamente.

source: Allows the user to partition disks attached to the system, create file systems on the selected partitions, and attach them to the mountpoints. Included are also interesting features like a fully automatic mode or LVM support. This is the preferred partitioning tool in &debian;.
es: Permite al usuario particionar los discos conectados al sistema, crear sistemas de ficheros en las particiones seleccionadas y añadirlos a los puntos de montaje. Incluye algunas características interesantes como son un modo totalmente automático de particionado o el uso de volúmenes lógicos (LVM). Es la herramienta de particionado recomendada para &debian;.

source: Allows the user to partition disks attached to the system. A partitioning program appropriate to your computer's architecture is chosen.
es: Permite al usuario particionar los discos conectados al sistema. Se elige un programa de particionado apropiado para la arquitectura de su ordenador.

source: Displays a list of partitions, and creates file systems on the selected partitions according to user instructions.
es: Muestra una lista de particiones y crea sistemas de ficheros en las particiones seleccionadas de acuerdo a las instrucciones del usuario.

source: Helps the user with the configuration of the <firstterm>LVM</firstterm> (Logical Volume Manager).
es: Ayuda al usuario con la configuración del gestor de volúmenes lógicos ( Logical Volume Manager ó <firstterm>LVM</firstterm>, N. del t.).

source: Allows the user to set up Software <firstterm>RAID</firstterm> (Redundant Array of Inexpensive Disks). This Software RAID is usually superior to the cheap IDE (pseudo hardware) RAID controllers found on newer motherboards.
es: Permite al usuario configurar sistemas <firstterm>RAID</firstterm> (<quote>Redundant Array of Inexpensive Disks</quote>) por software. Este RAID por software habitualmente es mejor que los controladores baratos RAID IDE (pseudo hardware) que puede encontrar en placas base nuevas.

source: Installs the most basic set of packages which would allow the computer to operate under &debian-gnu; when rebooted.
es: Instala el conjunto de paquetes más básico que permitirá que el ordenador opere con &debian-gnu; cuando se reinicie.

source: Configures apt, mostly automatically, based on what media the installer is running from.
es: Configura apt, casi todo automáticamente, basándose en el medio desde el que se está ejecutando el instalador.

source: Uses <classname>tasksel</classname> to select and install additional software.
es: Utiliza <classname>tasksel</classname> para seleccionar e instalar programas adicionales.

source: Detects currently installed operating systems on the computer and passes this information to the bootloader-installer, which may offer you an ability to add discovered operating systems to the bootloader's start menu. This way the user could easily choose at the boot time which operating system to start.
es: Detecta los sistemas operativos instalados actualmente en el ordenador y entrega esta información a <quote>bootloader-installer</quote>. Éste le ofrecerá la posibilidad de añadir estos sistemas operativos al menú de inicio del gestor de arranque. De esta manera el usuario podría fácilmente elegir qué sistema operativo iniciar en el momento de arrancar su sistema.

source: The various bootloader installers each install a boot loader program on the hard disk, which is necessary for the computer to start up using &arch-kernel; without using a floppy or CD-ROM. Many boot loaders allow the user to choose an alternate operating system each time the computer boots.
es: Los distintos instaladores del gestor de arranque instalan un programa de gestión de arranque en el disco duro. Éste es necesario para que el ordenador arranque usando &arch-kernel; sin usar un disquete ó CD-ROM. Muchos gestores de arranque permiten al usuario elegir un sistema operativo alternativo cada vez que el ordenador se reinicia.

source: Allows the user to execute a shell from the menu, or in the second console.
es: Permite al usuario ejecutar un intérprete de órdenes ya sea desde el menú o desde la segunda consola.

source: Provides a way for the user to record information on a floppy disk, network, hard disk, or other media when trouble is encountered, in order to accurately report installer software problems to &debian; developers later.
es: Ofrece una forma para que el usuario pueda guardar información en un disquete, red, disco duro, u otros dispositivos cuando se encuentre ante un problema. De esta forma puede informar después, adecuadamente, sobre los problemas que ha tenido con el programa del instalador a los desarrolladores de &debian;.

source: Using Individual Components
es: Uso de componentes individuales

source: In this section we will describe each installer component in detail. The components have been grouped into stages that should be recognizable for users. They are presented in the order they appear during the install. Note that not all modules will be used for every installation; which modules are actually used depends on the installation method you use and on your hardware.
es: En esta sección describiremos en detalle cada componente del instalador. Los componentes han sido agrupados en etapas que los usuarios podrán reconocer. Éstos se presentan en el orden en el que aparecen durante la instalación. Note que no se usarán todos los módulos en cada instalación; los módulos que se usan realmente dependen del método de instalación que use y de su hardware.

source: Setting up &debian; Installer and Hardware Configuration
es: Configurar el instalador de &debian; y configuración de hardware

source: Let's assume the &debian; Installer has booted and you are facing its first screen. At this time, the capabilities of &d-i; are still quite limited. It doesn't know much about your hardware, preferred language, or even the task it should perform. Don't worry. Because &d-i; is quite clever, it can automatically probe your hardware, locate the rest of its components and upgrade itself to a capable installation system. However, you still need to help &d-i; with some information it can't determine automatically (like selecting your preferred language, keyboard layout or desired network mirror).
es: Asumamos que el instalador de &debian; ha arrancado y está visualizando su pantalla inicial. En este momento, las capacidades del &d-i; son todavía algo limitadas. Éste no conoce mucho sobre su hardware, idioma preferido, o incluso la tarea que deberá realizar. No se preocupe. Porque &d-i; es bastante intuitivo, puede automáticamente explorar su hardware, localizar el resto de sus componentes y actualizarse automáticamente a un sistema de instalación capacitado. Sin embargo, todavía deberá ayudar al &d-i; suministrando la información que no puede determinar automáticamente (como elegir su idioma preferido, el mapa del teclado o el servidor de réplica deseado).

source: You will notice that &d-i; performs <firstterm>hardware detection</firstterm> several times during this stage. The first time is targeted specifically at the hardware needed to load installer components (e.g. your CD-ROM or network card). As not all drivers may be available during this first run, hardware detection needs to be repeated later in the process.
es: Notará que &d-i; realiza la <firstterm>detección de hardware</firstterm> varias veces durante esta etapa. La primera vez se enfoca específicamente en el hardware requerido para cargar los componentes del instalador (como su CD-ROM o tarjeta de red). En vista de que no todos los controladores podrían estar disponibles en esta primera ejecución, la detección de hardware necesita repetirse después, durante el proceso.
