Repository: dankamongmen/SprezzOS
Catalog: debian-installer/manual/po/*/using-d-i.po
Languages: es

source: Note that this will only work if the packages needed for the desired desktop environment are actually available. If you are installing using a single full CD image, they will need to be downloaded from a mirror as most needed packages are only included on later CDs; installing KDE, Xfce or LXDE this way should work fine if you are using a DVD image or any other installation method.
es: Tenga en cuenta que esto sólo funcionará si los paquetes necesarios para el entorno de escritorio deseado están disponibles. Deberán descargarse de una réplica si está instalando utilizando una imagen de CD completa, ya que los paquetes necesarios no se incluyen en este CD. Si está utilizando una imagen de DVD u otro medio de instalación la instalación de KDE, Xfce o LXDE debería funcionar sin problemas.

source: The various server tasks will install software roughly as follows. DNS server: <classname>bind9</classname>; File server: <classname>samba</classname>, <classname>nfs</classname>; Mail server: <classname>exim4</classname>, <classname>spamassassin</classname>, <classname>uw-imap</classname>; Print server: <classname>cups</classname>; SQL database: <classname>postgresql</classname>; Web server: <classname>apache2</classname>.
es: Las distintas tareas de servidor instalarán los programas aquí indicados. Servidor de DNS: <classname>bind9</classname>; Servidor de ficheros: <classname>samba</classname>, <classname>nfs</classname>; Servidor de correo: <classname>exim4</classname>, <classname>spamassassin</classname>, <classname>uw-imap</classname>; Servidor de impresoras: <classname>cups</classname>; Base de datos SQL: <classname>postgresql</classname>; Servidor de web: <classname>apache2</classname>.

source: The <quote>Standard system</quote> task will install any package that has a priority <quote>standard</quote>. This includes a lot of common utilities that are normally available on any Linux or Unix system. You should leave this task selected unless you know what you are doing and want a really minimal system.
es: La tarea <quote>Sistema estándar</quote> instalará todos los paquetes con una prioridad «estándar» (<quote>standard</quote>). Incluye muchas de las herramientas comunes que generalmente están disponibles en cualquier sistema Linux o Unix. Debería dejar esta tarea seleccionada a menos que sepa lo que está haciendo y si desea un sístema realmente básico.

source: If during language selection a default locale other than the <quote>C</quote> locale was selected, <command>tasksel</command> will check if any localization tasks are defined for that locale and will automatically try to install relevant localization packages. This includes for example packages containing word lists or special fonts for your language. If a desktop environment was selected, it will also install appropriate localization packages for that (if available).
es: Si ha seleccionado una configuración regional («locale») predefinido distinto de <quote>C</quote> durante la selección de idioma, <command>tasksel</command> seleccionará cualquier tarea de localización configurada para esa configuración regional e intentará instalar de forma automática los paquetes de localización relevantes. Incluye, por ejemplo, paquetes que contienen listas de palabras o tipos de letra específicos a su idioma. Si se selecciona un entorno de escritorio, instalará los paquetes de localización adecuados a él (si están disponibles).

source: Once you've selected your tasks, select &BTN-CONT;. At this point, <command>aptitude</command> will install the packages that are part of the selected tasks. If a particular program needs more information from the user, it will prompt you during this process.
es: Una vez ha seleccionado las tareas sólo tiene que seleccionar &BTN-CONT;. Una vez hecho esto, el programa <command>aptitude</command> instalará los paquetes que están incluidos en las tareas que ha seleccionado. Pueden realizarse preguntas durante este proceso si alguno de los programas necesita información del usuario.

source: You should be aware that especially the Desktop task is very large. Especially when installing from a normal CD-ROM in combination with a mirror for packages not on the CD-ROM, the installer may want to retrieve a lot of packages over the network. If you have a relatively slow Internet connection, this can take a long time. There is no option to cancel the installation of packages once it has started.
es: Debería tener en cuenta que la tarea de Escritorio es muy grande. El instalador puede intentar descargar muchos paquetes de la red especialmente si instala de un CD-ROM normal combinándolo con un servidor de réplica para aquellos paquetes que no están en el CD-ROM. Si tiene una conexión a Internet relativamente lenta esto puede tomar un tiempo. No hay ninguna opción para cancelar la instalación de paquetes una vez haya comenzado.

source: Even when packages are included on the CD-ROM, the installer may still retrieve them from the mirror if the version available on the mirror is more recent than the one included on the CD-ROM. If you are installing the stable distribution, this can happen after a point release (an update of the original stable release); if you are installing the testing distribution this will happen if you are using an older image.
es: El instalador puede que descargue paquetes de un servidor de réplica aún cuando los paquetes estén en el CD-ROM si hay una versión disponible en la réplica que es más reciente que la que se incluye en el CD-ROM. Si está instalando la distribución estable esto puede suceder tras la publicación de una nueva revisión de la distribución (una actualización de la versión original estable); si está instalando la distribución en pruebas esto puede suceder si está utilizando una imagen antigua en el CD-ROM.

source: Making Your System Bootable
es: Hacer su sistema arrancable

source: If you are installing a diskless workstation, obviously, booting off the local disk isn't a meaningful option, and this step will be skipped. <phrase arch="sparc">You may wish to set OpenBoot to boot from the network by default; see <xref linkend="boot-dev-select-sun"/>.</phrase>
es: Si está instalando una estación de trabajo sin disco, obviamente, arrancar desde el disco local no es una opción significativa, de modo que esta etapa se saltará. <phrase arch="sparc">Tal vez quiera configurar «OpenBoot» para arrancar desde red en forma predeterminada, vea <xref linkend="boot-dev-select-sun"/>.</phrase>

source: Detecting other operating systems
es: Detección de otros sistemas operativos

source: Before a boot loader is installed, the installer will attempt to probe for other operating systems which are installed on the machine. If it finds a supported operating system, you will be informed of this during the boot loader installation step, and the computer will be configured to boot this other operating system in addition to &debian;.
es: El instalador intentará encontrar otros sistemas operativos instalados en la máquina antes de instalar un gestor de arranque. Se le informará al respecto en el paso de la instalación del gestor de arranque si se encuentra un sistema operativo aceptado por éste. También, se configurará al ordenador para que arranque este sistema operativo además de &debian;.

source: Note that multiple operating systems booting on a single machine is still something of a black art. The automatic support for detecting and setting up boot loaders to boot other operating systems varies by architecture and even by subarchitecture. If it does not work you should consult your boot manager's documentation for more information.
es: Tenga en cuenta que el arranque de más de un sistema operativo en la misma máquina es aún una especie de magia negra. La funcionalidad automática de detectar y configurar los gestores de arranque de forma que puedan arrancar otros sistemas operativos varía con la arquitectura, e incluso con las distintas variantes de la arquitectura. Si no funciona en su caso debería consultar la documentación de su gestor de arranque para obtener más información.

source: The bootloader on PA-RISC is <quote>palo</quote>. <command>PALO</command> is similar in configuration and usage to <command>LILO</command>, with a few exceptions. First of all, <command>PALO</command> allows you to boot any kernel image on your boot partition. This is because <command>PALO</command> can actually read Linux partitions.
es: El gestor de arranque estándar para PA-RISC se llama <quote>palo</quote>. La configuración y el modo de uso de <command>PALO</command> es parecido al de <command>LILO</command> con algunas excepciones. En primer lugar <command>PALO</command> le permite cargar cualquier imagen del núcleo en su unidad. Esto es posible porque <command>PALO</command> puede leer las particiones Linux.

source: hppa FIXME ( need more info )
es: hppa ARREGLAME ( se necesita más información )

source: Install the <command>Grub</command> Boot Loader on a Hard Disk
es: Instalación del gestor de arranque <command>Grub</command> en un disco duro

source: The main &architecture; boot loader is called <quote>grub</quote>. Grub is a flexible and robust boot loader and a good default choice for new users and old hands alike.
es: <quote>Grub</quote> es el principal gestor de arranque para &architecture;. Grub es un gestor de arranque flexible y robusto y una buena opción predeterminada tanto para los usuarios principiantes como para los veteranos.

source: By default, grub will be installed into the Master Boot Record (MBR), where it will take over complete control of the boot process. If you prefer, you can install it elsewhere. See the grub manual for complete information.
es: De forma predeterminada, grub se instalará en el registro maestro de arranque (MBR), donde tendrá todo el control del proceso de arranque. También puede instalarlo en algún otro lugar si lo prefiere. Consulte el manual de grub para más información.

source: If you do not want to install grub, use the &BTN-GOBACK; button to get to the main menu, and from there select whatever bootloader you would like to use.
es: Si no quiere instalar grub, use el botón &BTN-GOBACK; para regresar al menú principal, y desde ahí seleccione el gestor de arranque que quiere usar.

source: Install the <command>LILO</command> Boot Loader on a Hard Disk
es: Instalación del gestor de arranque <command>LILO</command> en un disco duro

source: The second &architecture; boot loader is called <quote>LILO</quote>. It is an old complex program which offers lots of functionality, including DOS, Windows, and OS/2 boot management. Please carefully read the instructions in the directory <filename>/usr/share/doc/lilo/</filename> if you have special needs; also see the <ulink url="&url-lilo-howto;">LILO mini-HOWTO</ulink>.
es: El segundo gestor de arranque para &architecture; es <quote>LILO</quote>. Es un programa antiguo y complejo que ofrece muchas funcionalidades, incluyendo la gestión de arranque de los sistemas operativos MS-DOS, NT y OS/2. Por favor, lea cuidadosamente las instrucciones en el directorio <filename>/usr/share/doc/lilo/</filename> si tiene necesidades especiales. También debería consultar el <ulink url="&url-lilo-howto;">Mini-CÓMO de LILO</ulink>.

source: Currently the LILO installation will only create menu entries for other operating systems if these can be <firstterm>chainloaded</firstterm>. This means you may have to manually add a menu entry for operating systems like GNU/Linux and GNU/Hurd after the installation.
es: Actualmente la instalación de LILO sólo creará entradas en el menú para los sistemas operativos que puedan arrancarse de forma encadenada (<firstterm>chainloaded</firstterm>). Esto significa que puede necesitar añadir manualmente una entrada en el menú para sistemas operativos como GNU/Linux y GNU/Hurd después de la instalación.

source: &d-i; offers you three choices on where to install the <command>LILO</command> boot loader:
es: &d-i; le da a escoger entre tres opciones para instalar el gestor de arranque <command>LILO</command>:

source: Master Boot Record (MBR)
es: Registro maestro de arranque («Master Boot Record» o MBR, N. del t.)

source: This way the <command>LILO</command> will take complete control of the boot process.
es: De este modo <command>LILO</command> tendrá todo el control del proceso de arranque.

source: new &debian; partition
es: Nueva partición de &debian;

source: Choose this if you want to use another boot manager. <command>LILO</command> will install itself at the beginning of the new &debian; partition and it will serve as a secondary boot loader.
es: Escoja esta opción si quiere usar otro gestor de arranque. Se instalará <command>LILO</command> al principio de la nueva partición de &debian; y hará las veces de gestor de arranque secundario.

source: Other choice
es: Otra opción

source: Useful for advanced users who want to install <command>LILO</command> somewhere else. In this case you will be asked for desired location. You can use traditional device names such as <filename>/dev/hda</filename> or <filename>/dev/sda</filename>.
es: Esta opción es útil para usuarios avanzados que quieran instalar <command>LILO</command> en otro lugar. En ese caso se le preguntará el lugar deseado. Puede usar nombres tradicionales, como <filename>/dev/hda</filename> o <filename>/dev/sda</filename>.

source: If you can no longer boot into Windows 9x (or DOS) after this step, you'll need to use a Windows 9x (MS-DOS) boot disk and use the <userinput>fdisk /mbr</userinput> command to reinstall the MS-DOS master boot record &mdash; however, this means that you'll need to use some other way to get back into &debian;!
es: Si después de este paso no puede volver a arrancar Windows 9x (o DOS), necesitará usar un disco de arranque de Windows 9x (MS-DOS) y usar la orden <userinput>fdisk /mbr</userinput> para reinstalar el registro maestro de arranque. Esto significa, sin embargo, ¡qué tendrá que usar otro método para volver a arrancar &debian;!

source: Install the <command>ELILO</command> Boot Loader on a Hard Disk
es: Instalación del gestor de arranque <command>ELILO</command> en el disco duro

source: The &architecture; boot loader is called <quote>elilo</quote>. It is modeled on the <quote>lilo</quote> boot loader for the x86 architecture and uses a similar configuration file. However, instead of writing an MBR or partition boot record to the disk, it copies the necessary files to a separate FAT formatted disk partition and modifies the <guimenuitem>EFI Boot Manager</guimenuitem> menu in the firmware to point to the files in the EFI partition. The <command>elilo</command> boot loader is really in two parts. The <filename>/usr/sbin/elilo</filename> command manages the partition and copies files into it. The <filename>elilo.efi</filename> program is copied into the EFI partition and then run by the <quote>EFI Boot Manager</quote> to do the actual work of loading and starting the Linux kernel.
es: <quote>Elilo</quote> es el gestor de arranque para &architecture;. Se basa en el gestor de arranque <quote>lilo</quote> para la arquitectura x86 y usa un fichero de configuración similar. Sin embargo, en lugar de escribir en el MBR o en el registro de arranque de una partición, copia los ficheros necesarios en una partición separada con formato FAT y modifica el menú del <guimenuitem>Gestor de arranque EFI</guimenuitem> en el firmware para que direccione a los ficheros en la partición EFI. En realidad el gestor de arranque <command>elilo</command> está compuesto de dos partes. La orden <filename>/usr/sbin/elilo</filename> gestiona la partición y copia el fichero en ésta. El programa <filename>elilo.efi</filename> se copia en la partición EFI y el <quote>gestor de arranque EFI</quote> (que es el que realmente carga y arranca el núcleo de Linux) lo ejecuta.

source: The <quote>elilo</quote> configuration and installation is done as the last step of installing the packages of the base installation. &d-i; will present you with a list of potential disk partitions that it has found suitable for an EFI partition. Select the partition you set up earlier in the installation, typically a partition on the same disk that contains your <emphasis>root</emphasis> filesystem.
es: La configuración e instalación de <quote>elilo</quote> se realiza en el último paso de la instalación de paquetes del sistema base. &d-i; le presentará una lista de particiones adecuadas para una partición EFI. Seleccione la partición que configuró anteriormente en la instalación, usualmente una partición en el mismo disco que contiene su sistema de ficheros <emphasis>raíz</emphasis>.

source: Choose the correct partition!
es: ¡Escoja la partición correcta!

source: The criterion for selecting a partition is that it must be a FAT format filesystem with its <emphasis>boot</emphasis> flag set. &d-i; may show multiple choices depending on what it finds from scanning all of the disks of the system including EFI partitions of other system disks and EFI diagnostic partitions. Remember, <command>elilo</command> may format the partition during the installation, erasing any previous contents!
es: El criterio para seleccionar una partición es que tenga un sistema de ficheros FAT y la marca <emphasis>boot</emphasis> (arrancable, N. del t.) establecida. Es posible que &d-i; muestre varias alternativas dependiendo de lo que encuentre al analizar todos los discos del sistema que contengan incluyendo particiones EFI de otros discos de sistema y particiones de diagnóstico EFI. Recuerde, <command>elilo</command> podría dar formato a la partición durante la instalación, ¡eliminando cualquier contenido previo!.

source: EFI Partition Contents
es: Contenido de una partición EFI

source: The EFI partition is a FAT filesystem format partition on one of the hard disks of the system, usually the same disk that contains the <emphasis>root</emphasis> filesystem. It is normally not mounted on a running system as it is only needed by the <quote>EFI Boot Manager</quote> to load the system and the installer part of the <command>elilo</command> writes to the filesystem directly. The <command>/usr/sbin/elilo</command> utility writes the following files into the <filename>efi/debian</filename> directory of the EFI partition during the installation. Note that the <quote>EFI Boot Manager</quote> would find these files using the path <filename>fs<replaceable>n</replaceable>:\efi\debian</filename>. There may be other files in this filesystem as well over time as the system is updated or re-configured.
es: Una partición EFI es una partición con un sistema de ficheros FAT en uno de los discos duros del sistema, generalmente en el mismo disco que contiene el sistema de ficheros <emphasis>raíz</emphasis>. Usualmente no está montada mientras el sistema se ejecuta, ya que sólo la necesita el <quote>Gestor de arranque EFI</quote> para cargar el sistema y la parte de instalación en que <command>elilo</command> escribe directamente en el sistema de ficheros. La utilidad <command>/usr/sbin/elilo</command> escribe los siguientes ficheros en el directorio <filename>efi/debian</filename> de la partición EFI durante la instalación. Tenga en cuenta que el <quote>Gestor de arranque EFI</quote> encontrará esos ficheros usando la ruta <filename>fs<replaceable>n</replaceable>:\efi\debian</filename>. Puede haber otros ficheros en este sistema de ficheros a medida que pasa el tiempo y el sistema se actualiza o se vuelve a configurar.

source: This is the configuration file read by the boot loader when it starts. It is a copy of the <filename>/etc/elilo.conf</filename> with the filenames re-written to refer to files in the EFI partition.
es: Es el fichero de configuración que lee el gestor de arranque al iniciarse. Es una copia de <filename>/etc/elilo.conf</filename> con los nombres de los ficheros reescritos para hacer referencia a los ficheros en la partición EFI.

source: This is the boot loader program that the <quote>EFI Boot Manager</quote> runs to boot the system. It is the program behind the <guimenuitem>&debian; GNU/Linux</guimenuitem> menu item of the <quote>EFI Boot Manager</quote> command menu.
es: Este es el gestor de arranque ejecutado por el <quote>gestor de arranque EFI</quote> para arrancar el sistema. Es el programa detrás de la opción <guimenuitem>&debian; GNU/Linux</guimenuitem> en el menú del <quote>gestor de arranque EFI</quote>.

source: This is the initial root filesystem used to boot the kernel. It is a copy of the file referenced in the <filename>/etc/elilo.conf</filename>. In a standard &debian; installation it would be the file in <filename>/boot</filename> pointed to by the symbolic link <filename>/initrd.img</filename>.
es: Es el sistema de ficheros raíz usado inicialmente para arrancar el núcleo. Es una copia del fichero referido en <filename>/etc/elilo.conf</filename>. En una instalación de &debian; estándar será el fichero ubicado en <filename>/boot</filename> al que apunta el enlace simbólico <filename>/initrd.img</filename>.

source: This is a small text file warning you that the contents of the directory are managed by the <command>elilo</command> and that any local changes would be lost at the next time <filename>/usr/sbin/elilo</filename> is run.
es: Es un fichero de texto pequeño que indica que los contenidos del directorio se gestionan con <command>elilo</command> y que cualquier cambio local se perderá la próxima vez que se ejecute <filename>/usr/sbin/elilo</filename>.

source: This is the compressed kernel itself. It is a copy of the file referenced in the <filename>/etc/elilo.conf</filename>. In a standard &debian; installation it would be the file in <filename>/boot</filename> pointed to by the symbolic link <filename>/vmlinuz</filename>.
es: Es el núcleo comprimido. Es una copia del fichero señalado en <filename>/etc/elilo.conf</filename>. En una instalación de &debian; estándar será el fichero en <filename>/boot</filename> al que apunta el enlace simbólico <filename>/vmlinuz</filename>.
