Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel4/*.po
Languages: lo, sr@latin

source: Your root partition is not a primary partition of your hard disk. This is needed by your machine in order to boot. Please go back and use a primary partition for your root partition.
lo: ພາທິຊັ້ນບໍແມ່ນພາທິຊັນທີ່ชันที่เພື້ນຖານຂອງທ່ານເປັນໄພຮມາລີ ຊື່ງຈຳເປັນສຳລັບການບູດເຄື່ອງຂອງທ່ານກະລຸນາກັບຫຼັງໄປກຳນົດພາທິຊັ້ນທີ່ເປັນໄພຮມາລີໃຫ້ເປັນພາທິຊັ້ນພື້ນຖານ
sr@latin: Vaša root particija nije primarna particija vašeg hard diska. Ovo je potrebno da bi vaša mašina mogla da se pokrene. Vratite se nazad i upotrebite primarnu particiju za vašu root particiju.

source: ZFS file system
lo: ລະບົບແຟ້ມ ZFS
sr@latin: ZFS fajl sistem

source: Separate /boot and /lib/modules mandatory for this ZFS configuration
sr@latin: Odvojeni /boot i /lib/modules su obavezni za ovu ZFS konfiguraciju

source: Your root file system is on a ZFS pool that uses more than one physical volume.
sr@latin: Vaš rut fajl sistem je u ZFS grupi koja koristi više od jednog fizičkog volumena.

source: The boot loader only supports this configuration for pools in Mirror or Striped modes, but not RAID-Z mode.
sr@latin: Pokretački program podržava samo ovu konfiguraciju za grupe u „Mirror“ ili „Striped“ modu, a ne u „RAID-Z“ modu.

source: Make sure /boot and /lib/modules are on a partition using a supported ZFS pool configuration, or a different file system such as UFS.
sr@latin: Pobrinite se da su /boot i /lib/modules na particiji koja koristi podržanu ZFS konfiguraciju, ili na drugom fajl sistemu kao što je UFS.

source: Unsupported multiple volume ZFS for ${MNT}
sr@latin: Nepodržani višestruki ZFS volumen za ${MNT}

source: Your ${MNT} partition is on a ZFS pool that uses more than one physical volume.
sr@latin: Vaša ${MNT} particija je na ZFS grupi koja koristi više od jednog fizičkog volumena.

source: Make sure ${MNT} is on a partition using a supported ZFS pool configuration, or a different file system such as UFS.
sr@latin: Utvrdite da je ${MNT} na particiji koja koristi podržanu konfiguraciju ZFS grupe, ili drugi fajl sistem kao što je UFS.

source: You have configured one or more partitions with the ZFS file system. Although ZFS is supported on 32-bit i386, using it without special tuning may lead to performance or stability problems due to limitations of this architecture.
sr@latin: Konfigurisali ste jednu ili više particija koristeći ZFS fajl sistem. Iako je ZFS podržan na 32-bitnom i386 sistemu, koriteći ga bez pocebnog podešavanja može dovesti do problema u performansama ili stabilnosti zbog ograničenja ove arhitekture.

source: You should either use the 64-bit (amd64) version of this installer (if your hardware supports this), or go back to the partitioning menu and configure the partitions to use another file system.
sr@latin: Trebate ili da koristite 64-bitnu (amd64) verziju instalera (ako vaš hardver podržava) ili da se vratite u meni za particionisanje i konfigurišete particije da koriste drugi fajl sistem.

source: You have configured one or more partitions with the ZFS file system. Using ZFS on a computer with less than 512 MB of memory may lead to stability problems and is not recommended.
sr@latin: Konfigurisali ste jednu ili više particija sa ZFS fajl sistemom. Korišćenje ZFS-a na komjuteru sa manje od 512 MB memorije može dovesti do problema sa stabilnošću i nije preroručeno.

source: You should go back to the partitioning menu and configure the partitions to use another file system.
sr@latin: Trebate da se vratite na meni za particionisanje i konfigurisati particije da koriste drugi fajl sistem.

source: Configure ZFS
sr@latin: Konfiguroši ZFS

source: In use by ZFS pool ${VG}
sr@latin: Particija u upotrebi od ZFS grupe volumena ${VG}

source: Create ZFS pool
sr@latin: Napraviti ZFS grupu

source: Delete ZFS pool
sr@latin: Obrisati ZFS grupu

source: Write the changes to disk and configure ZFS?
sr@latin: Zapisati promene na disk i konfigurisati ZFS?

source: Before ZFS can be configured, the current partitioning scheme has to be written to disk. These changes cannot be undone.
sr@latin: Pre nego što ZFS može biti konfigurisan, trenutna particiona šema mora biti zapisana na disk. Ove promene se ne mogu poništiti.

source: After ZFS is configured, no additional changes to the partitioning scheme of disks containing physical volumes are allowed during the installation. Please decide if you are satisfied with the current partitioning scheme before continuing.
sr@latin: Nakon konfiguracije ZFS-a, nisu dozvoljene dodatne izmene tokom instalacije na particionoj šemi diskova koji sadrže fizičke volumene. Odlučite da li ste zadovoljni trenutnom particionom šemom za ove diskove pre nego što nastavite.

source: ZFS configuration failure
sr@latin: Greška pri konfiguraciji ZFS-a

source: ZFS configuration has been aborted.
sr@latin: Konfigurisanje ZFS-a je prekinuto.

source: physical volume for ZFS
sr@latin: fizički volumen za ZFS

source: ZFS configuration action:
sr@latin: Konfigurisanje ZFS-a:

source: Summary of current ZFS configuration:
sr@latin: Pregled trenutne ZFS konfiguracije:

source: Free physical volumes: ${FREE_PVS} Used physical volumes: ${USED_PVS} ZFS pools: ${VGS} ZFS logical volumes: ${LVS}
sr@latin: Slobodni fizički volumeni: ${FREE_PVS} Iskorišćeni fizički volumeni: ${USED_PVS} ZFS grupe: ${VGS} ZFS logički volumeni: ${LVS}

source: Current ZFS configuration:
sr@latin: Trenutna ZFS konfiguracija:

source: Devices for the new ZFS pool:
sr@latin: Uređaji za novu ZFS grupu:

source: Please select devices for the new ZFS pool.
sr@latin: Izaberite uređaje za novu ZFS grupu.

source: Multidisk mode for this ZFS pool:
sr@latin: Multidisk režim za ovu ZFS grupu:

source: Parity level for RAID-Z:
sr@latin: Nivo parnosti za RAID-Z:

source: Please choose the number of physical volumes that will be used to store parity bits.
sr@latin: Unesite broj fizičkih volumena koje će se koristiti za skladištenje bitova parnosti.

source: ZFS pool name:
sr@latin: Ime ZFS grupe:

source: Please enter the name you would like to use for the new ZFS pool.
sr@latin: Unesite ime za novu ZFS grupu.

source: No physical volumes were selected. The creation of a new ZFS pool has been aborted.
sr@latin: Fizički volumeni nisu izabrani. Kreacija nove ZFS grupe je prekinuta.

source: No ZFS pool name
sr@latin: Nema imena ZFS grupe

source: No name for the ZFS pool has been entered. Please enter a name.
sr@latin: Nije uneto ime za ZFS grupu. Unesite ime.

source: ZFS pool name already in use
sr@latin: Ime za ZFS grupu je već u upotrebi

source: The selected ZFS pool name is already in use. Please choose a different name.
sr@latin: Izabrano ime za ZFS grupu je već u upotrebi. Izaberite drugo ime.

source: Error while creating ZFS pool
sr@latin: Greška pri kreiranju ZFS grupe

source: The ZFS pool ${VG} could not be created.
sr@latin: ZFS grupa ${VG} ne može biti kreirana.

source: ZFS pool to delete:
sr@latin: ZFS grupa za brisanje:

source: Please select the ZFS pool you wish to delete.
sr@latin: Izaberite ZFS grupu koju želite da obrišete.

source: No ZFS pool
sr@latin: Nema ZFS grupe

source: No ZFS pool has been found.
sr@latin: Nije pronađena ZFS grupa.

source: The ZFS pool may have already been deleted.
sr@latin: ZFS grupa je možda već obrisana.

source: Really delete the ZFS pool?
sr@latin: Stvarno obrisati ZFS grupu?

source: Please confirm the removal of the ZFS pool ${VG}.
sr@latin: Potvrdite uklanjanje ZFS grupe ${VG}.

source: Error while deleting ZFS pool
sr@latin: Greška pri brisanju ZFS grupe

source: The selected ZFS pool could not be deleted. One or more logical volumes may currently be in use.
sr@latin: Izabrana ZFS grupa ne može biti obrisana. Jedan ili više logičkih volumena je možda u upotrebi.

source: No ZFS pool found
sr@latin: Nije pronađena nijedna ZFS grupa

source: No free ZFS pools were found for creating a new logical volume. Please create another ZFS pool, or free space in an existing ZFS pool.
sr@latin: Nisu pronađene slobodne ZFS grupe za kreiranje novog logičkog volumena. Kreirajte još jednu ZFS grupu, ili oslobodite mesto na postojećoj.

source: ZFS pool:
sr@latin: ZFS grupa:

source: Please select the ZFS pool where the new logical volume should be created.
sr@latin: Izaberite ZFS grupu gde treba biti kreiran novi logički volumen.

source: The name ${LV} is already in use by another logical volume on the same ZFS pool (${VG}).
sr@latin: Ime ${LV} za logički volumen je već u upotrebi u okviru iste ZFS grupe (${VG}).

source: No physical volumes (i.e. partitions) were found in this system. All physical volumes may already be in use. You may also need to load some required kernel modules or re-partition the hard drives.
sr@latin: Fizički volumeni (tj. particije) nisu pronađeni na vašem sistemu. Svi fizički volumeni su možda već u upotrebi. Možda treba da učitate potrebne module za kernel ili da ponovo particioniše hard diskove.

source: ZFS not available
sr@latin: ZFS nije dostupan

source: The current kernel doesn't support ZFS. You may need to load the zfs module.
sr@latin: Trenutni kernel ne podržava ZFS. Treba da učitate „zfs“ modul.

source: Invalid logical volume or ZFS pool name
sr@latin: Neispravno ime za logički volumen ili ZFS grupu

source: Logical volume or ZFS pool names may only contain alphanumeric characters, hyphen, colon, period, and underscore. They must be 255 characters or less and must begin with an alphanumeric character. The names "mirror", "raidz", "spare", and "log" are not allowed.
sr@latin: Nazivi logičkih volumena ili ZFS grupa mogu da sadrže samo alfanumeričke karaktere, crtu, dvotačku i donju crtu. Mogu da imaju najviše 255 karaktera i moraju da počinju alfanumeričkim karakterom. Nazivi „mirror“, „raidz“, „spare“ i „log“ nisu dozvoljeni.

source: The selected device already contains the following ZFS logical volumes and ZFS pools which are about to be removed:
sr@latin: Izabrani uređaj več sadrži sledeće ZFS logičke volumene i ZFS grupe koji će biti uklonjeni:

source: Logical volume(s): ${LVTARGETS}
sr@latin: Logički volumen(i): ${LVTARGETS}

source: ZFS pool(s): ${VGTARGETS}
sr@latin: ZFS grupa(e): ${VGTARGETS}

source: A common situation for system administrators is to find that some disk partition (usually the most important one) is short on space, while some other partition is underused. ZFS can help with this.
sr@latin: Česta situacija za sistem administratore je da nađu neke particije koje imaju manjak prostora (obično najvažnije), dok su neke druge particije slabo u upotrebi. ZFS može tu da pomogne.

source: ZFS allows combining disk or partition devices ("physical volumes") to form a virtual disk ("ZFS pool"), which can then be divided into virtual partitions ("logical volumes"). ZFS pools and logical volumes may span across several physical disks. New physical volumes may be added to a ZFS pool at any time, and logical volumes have no size limit other than the total size of the ZFS pool.
sr@latin: ZFS omogućava kombinovanje disk ili particionih uređaja („fizički volumeni“) za formiranje virtualnog diska („ZFS grupa“), koji onda može biti podeljen na virtualne particije („logički volumeni“). ZFS grupe i logički volumeni mogu da se prostiru na više fizičkih diskova. Novi fizički volumeni mogu biti dodati ZFS grupi bilo kad i logički volumeni nemaju ograničenje u veličini osim ukupne veličine ZFS grupe.

source: The items on the ZFS configuration menu can be used to edit ZFS pools and logical volumes. After you return to the main partition manager screen, logical volumes will be displayed in the same way as ordinary partitions, and should be treated as such.
sr@latin: Stavke u ZFS konfiguracionom meniju mogu biti upotrebljene za uređivanje ZFS grupa i logičkih volumena. Nakon što se vratite na uređivanje particija, logički volumeni će biti prikazani kao obične particije i kao takve ih treba tretirati.

source: SILO installation failed. Continue anyway?
lo: ຕິດຕັ້ງ SILO ບໍ່ສຳເລັດຈະດຳເນີນການຕໍ່ໄປ ຫຼື ບໍ?
sr@latin: SILO instalacija nije uspela. Nastaviti?

source: The 'silo' package failed to install into /target/. Installing SILO as a boot loader is a required step. The install problem might however be unrelated to SILO, so continuing the installation may be possible.
lo: ຕິດຕັ້ງແພັກແກັດ 'silo' ລົງໃນ /target/ ບໍ່ສຳເລັດການຕິດຕັ້ງ SILO ເປັນບູດໂຫຼດເດີ ເປັນຂັ້ນຕອນທີ່ຈຳເປັນ ແຕ່ບັນຫາຂອງການຕິດຕັ້ງອາດບໍ່ກ່ຽວກັບ SILO ກໍ່ໄດ້ ດັ່ງນັນ ການດຳເນີນການຕິດຕັ້ງຕໍ່ໄປອາດເຮັດໄດ້
sr@latin: Paket silo nije uspeo da se instalira na /target/. Instaliranje SILO-a kao pokretačkog programa je obavezan korak. Problem možda ipak nije u vezi sa SILO-om, tako da nastavak instalacije može biti moguć.

source: SILO installation failed
lo: ຕິດຕັ້ງ SILO ບໍ່ສຳເລັດ
sr@latin: SILO instalacija nije uspela

source: Running "/sbin/silo" failed with error code "${ERRCODE}".
lo: ການເຮັດວຽກຄຳສັ່ງ "/sbin/silo" ບໍ່ສຳເລັດໂດຍມີລະຫັດຂໍ້ຜິດພາດ "${ERRCODE}"
sr@latin: Izvršavanje „/sbin/silo“ nije uspeko (kod greške „${ERRCODE}“).

source: SILO installation successful
lo: ການຕິດຕັ້ງ SILO ສຳເລັດສົມບູນ
sr@latin: SILO instalacija je uspela

source: The SILO boot loader has been successfully installed on your new boot partition, and your system should now be able to boot itself.
lo: ຕິດຕັ້ງບູດໂຫຼດເດີ SILO ລົງໃນພາທິຊັ້ນບູດໃໝ່ຂອງທ່ານຮຽບຮ້ອຍແລ້ວ ແລະ ລະບົບຂອງທ່ານຈະສາມາດບູດເອງໄດ້
sr@latin: Pokretački program SILO je uspešno instaliran na vašu novu pokretačku particiju i vaš sistem bi trebalo da može da se pokrene.

source: Install the SILO boot loader on a hard disk
lo: ຕິດຕັ້ງບູດໂຫຼດເດີ SILO ລົງໃນຮາດດິດສ໌
sr@latin: Instaliraj pokretački program SILO na hard disk

source: Unsupported boot file system type
lo: ບໍ່ຮອງຮັບລະບົບແຟ້ມເຫຼົ່ານີ້
sr@latin: Nepodržani tip fajl sistema pokretačke particije

source: In order to be successfully loaded by SILO (Sparc Linux Loader), the kernel must reside on an ext2, ext3 or ufs formatted partition. In the current partitioning scheme the kernel is going to be installed on the ${SILO_PART} partition of type ${SILO_TYPE}.
lo: ໃນການບູດດ້ວຍ SILO (Sparc Linux Loader) ເຄີເນວຈະຕ້ອງຢູ່ໃນພາທິຊັ້ນທີ່ຟໍລແມັດໃວ້ເປັນແບບ ext2, ext3 ຫຼື ufs ແຕ່ໃນການກຳນົດພາທິຊັ້ນປະຈຸບັນຂອງທ່ານ ເຄີເນວຈະຖືກຢູ່ໃນພາທິຊັ້ນ ${SILO_PART} ຊື່ງເປັນຊະນິດ ${SILO_TYPE}
sr@latin: Da bi SILO (Sparc Linux Loader) uspešno učitao kernel, mora biti na particiji formatiranoj kao ext2, ext3 ili ufs. Prema tekućoj particionoj šemi kernel će biti instaliran na particiji ${SILO_PART} tipa ${SILO_TYPE}.

source: It is strongly recommended that you go back to partitioning and correct this problem. Keeping the current configuration may result in an unbootable system.
lo: ຂໍແນະນຳໃຫ້ກັບໄປທີ່ຂັ້ນຕອນການແບ່ງພາທິຊັ້ນ ເພື່ອແກ້ບັນຫານີ້ ການປ່ອຍການກຳນົດໃຫ້ເປັນແບບນີ້ອາດເຮັດໃຫ້ລະບົບຂອງທ່ານບູດບໍ່ຂື້ນ
sr@latin: Preporučuje se da se vratite nazad na korak particionisanja i ispravite ovaj problem. Zadržavanje postojeće konfiguracije može rezultirati sistemom koji se ne može pokrenuti.

source: Boot partition may cause problems with SILO
lo: ພາທິຊັ້ນບູດອາດມີບັນຫາກັບ SILO
sr@latin: Pokretačka particija može izazvati probleme sa programom SILO

source: This machine is likely to suffer from a firmware bug, which makes it impossible for SILO (Sparc Linux Loader) to boot a kernel placed farther than 1 GB from the beginning of the disk.
lo: ເຄື່ອງນີ້ມີແນວໂນ້ມຈະມີບັນຫາຈາກຂໍ້ບົກຟ່ອງຂອງເຟີມແວຊື່ງຈະເຮັດໃຫ້ SILO (Sparc Linux Loader) ບໍ່ສາມາດບູດເຄີເນວທີ່ຢູ່ໃນຕຳແໜ່ງເກີນ 1 GB ຈາກຕົ້ນຮາດດິດສ໌ໄດ້
sr@latin: Ova mašina verovatno ima grešku u firmveru koja onemogućava programu SILO (Sparc Linux Loader) da učita kernel koji se nalazi van granice od 1GB od početka diska.

source: To avoid problems it is strongly recommended to install the kernel into a partition which fits entirely within the first GB of the disk (by creating a small /boot partition in the beginning of the disk, for example). In the current partitioning scheme it is going to be installed onto the ${SILO_PART} partition which extends up to ${SILO_OFF} mark. Keeping this configuration may result in an unbootable system.
lo: ເພື່ອຫຼີກລ້ຽງບັນຫານີ້ ເຮົາຂໍແນະນຳຕິດຕັ້ງເຄີແນວລົງໃນພາທິຊັ້ນທີ່ຢູ່ພາຍໃນກິກກະໄບສທຳອິດຂອງດິດສ໌ທັງໝົດພາທິຊັ້ນ (ອາດຈະສ້າງໂດຍພາທິຊັ້ນ /boot ນ້ອຍໆ ທີ່ຕົ້ນຮາດດິດສ໌ເປັນຕົ້ນ) ແຕ່ໃນການກຳພາທິຊັ້ນປະຈຸບັນຂອງທ່ານເຄີເນວຈະຖືກຕິດຕັ້ງໃນພາທິຊັ້ນ ${SILO_PART} ຊື່ງຈະຂະຫຍາຍໄປເຖີງຕຳແໜ່ງ ${SILO_OFF} ການກຳນົດແບບນີ້ອາດເຮັດໃຫ້ລະບົບຂອງທ່ານບູດບໍ່ຂື້ນ
sr@latin: Da biste izbegli probleme preporučuje se da instalirate kernel na particiju koja kompletno staje unutar prvog GB diska (npr. kreirajući malu /boot particiju na početku diska). Prema tekućoj particionoj šemi kernel će biti instaliran na particiji ${SILO_PART} koja se proteže do oznake ${SILO_OFF}. Zadržavanje ove konfiguracije može dovesti do sistema koji se ne može pokrenuti.

source: Unsupported partition table on the boot disk
lo: ບໍ່ຮອງຮັບຕາຕາລາງພາທິຊັ້ນໃນດິດສ໌ທີ່ໃຊ້ບູດ
sr@latin: Nepodržana particiona tabela na pokretačkom disku

source: SILO (Sparc Linux Loader) can only boot the kernel off a disk with the "sun" partition table. In the current partitioning scheme the kernel is going to be installed on the ${SILO_PART} partition located on a disk with the partition table of type "${SILO_DISK}".
lo: SILO (Sparc Linux Loader) ສາມາດບູດເຄີເນວໄດ້ຈາກດິດສ໌ທີ່ໃຊ້ຕາຕາລາງພາທິຊັ້ນແບບ "sun" ເທົ່ານັ້ນ ແຕ່ໃນການກຳນົດພາທິຊັນປະຈຸບັນຂອງທ່ານ ເຄີເນວຈະຖືກຕິດຕັ້ງໃນພາທິຊັ້ນ ${SILO_PART} ຊື່ງຢູ່ໃນດິດສ໌ທີ່ໃຊ້ຕາຕາລາງພາທິຊັ້ນ "${SILO_DISK}"
sr@latin: SILO (Sparc Linux Loader) može pokrenuti kernel samo sa diska koji ima „sun“ particionu tabelu. Prema tekućoj particionoj šemi, kernel će biti instaliran na particiji ${SILO_PART} koja se nalazi na disku sa particionom tabelom tipa „${SILO_DISK}“.

source: Install the Arcboot boot loader on a hard disk
lo: ຕິດຕັ້ງບູດໂຫຼດເດີ Arcboot ລົງໃນຮາດດິດສ໌
sr@latin: Instaliraj Arcboot pokretački program na hard disk

source: Disk for boot loader installation:
lo: ດິດສ໌ສຳລັບຕິດຕັ້ງບູດໂຫຼດເດີ
sr@latin: Disk na kojem će se instalirati pokretački program:

source: Arcboot must be installed into the volume header of a disk with a SGI disklabel. Usually the volume header of /dev/sda is used. Please give the device name of the disk on which to put arcboot.
lo: arcboot ຈະຕ້ອງຕິດຕັ້ງລົງໃນສ່ວນຕົ້ນຂອງດິດສ໌ທີ່ມີປ້າຍຊື່ດິດສ໌ແບບ SGI ຊື່ງໂດຍປົກະຕິແລ້ວ ຈະໃຊ້ສ່ວນຕົ້ນຂອງ /dev/sda ກະລຸນາລະບຸຊື່ອຸປະກອນຂອງດິດສ໌ທີ່ຈະຕ້ອງຕິດຕັ້ງ arcboot
sr@latin: Arcboot mora biti instaliran u zaglavlju volumena diska sa SGI diskoznakom. Obično se za to koristi zaglavlje volumena /dev/sda. Unesite ime diska na koji želite da postavite arcboot.

source: Arcboot configured to use a serial console
lo: arcboot ຖືກຕັ້ງຄ່າໃວ້ໃຫ້ໃຊ້ຄອນໂຊນແບບລຽນ
sr@latin: Arcboot je konfigurisan da koristi serijsku konzolu

source: Arcboot is configured to use the serial port ${PORT} as the console. The serial port speed is set to ${SPEED}.
lo: arcboot ຖືກຕັ້ງຄ່າໃວ້ໃຫ້ໃຊ້ແບບຕໍ່ລຽນ ${PORT} ເປັນຄອນໂຊນ ຄວາມໄວຂອງພອດແບບລຽນຖືກກຳນົດໃວ້ເປັນ ${SPEED}
sr@latin: Arcboot je konfigurisan da koristi serijski port ${PORT} kao svoju konzolu. Brzina serijskog porta je postavljena na ${SPEED}.

source: Arcboot installation failed. Continue anyway?
lo: ຕິດຕັງ arcboot ບໍ່ສຳເລັດ ຈະດຳເນີນງານຕໍ່ໄປ ຫຼື ບໍ?
sr@latin: Instalacija Arcboot-a nije uspela. Nastaviti dalje?

source: The arcboot package failed to install into /target/. Installing Arcboot as a boot loader is a required step. The install problem might however be unrelated to Arcboot, so continuing the installation may be possible.
lo: ຕິດຕັງແພັກເກັດ arcboot ລົງໃນ /target/ ບໍ່ສຳເລັດ ການຕິດຕັ້ງ Arcboot ເປັນບູດໂຫຼດເດີ ເປັນຂັ້ນຕອນທີ່ຈຳເປັນ ແຕ່ບັນຫາຂອງການຕິດຕັ້ງອາດບໍ່ກ່ຽວກັບ Arcboot ກໍ່ໄດ້ ດັ່ງນີ້ ການດຳເນີນການຕິດຕັ້ງຕໍ່ໄປກໍ່ອາດເຮັດໄດ້
sr@latin: Paket Arcboot nije uspeo da se instalira na /target/. Instaliranje Arcboot-a kao pokretačkog programa je obavezan korak. Problem možda ipak nije u vezi sa Arcboot-om, tako da nastavak instalacije može biti moguć.

source: Setting PROM variables for Arcboot
lo: ກຳລັງກຳນົດຄ່າ PROM ສຳລັບ Arcboot
sr@latin: Postavljanje promenljive PROM-a za Arcboot

source: If this is the first Linux installation on this machine, or if the hard drives have been repartitioned, some variables need to be set in the PROM before the system is able to boot normally.
lo: ຖ້ານີ້ເປັນການຕິດຕັ້ງລີນຸກຄັ້ງທຳອິດໃນເຄື່ອງນີ້ ຫຼື ມີການແບ່ງພາທິຊັ້ນໃນຮາດດິດສ໌ໃໝ່ ຄ່າບາງຄ່າໃນ PROM ຈະຕ້ອງຖືກກຳນົດໃໝ່ ເພື່ອໃຫ້ລະບົບສາມາດບູດໄດ້ປົກະຕິ
sr@latin: Ako je ovo prva instalacija Linux-a na ovoj mašini ili su diskovi reparticionisani, neke promenljive treba da budu podešene u PROM-u pre nego što sistem bude mogao da se pokrene.

source: At the end of this installation stage, the system will reboot. After this, enter the command monitor from the "Stop for Maintenance" option, and enter the following commands:
lo: ເມື່ອຈົບຂັນຕອນການຕິດຕັ້ງນີ້ ລະບົບຈະບູດໃໝ່ຫຼັງຈາກນັ້ນ ໃຫ້ທ່ານເຂົ້າສູ່ໜ້າຈໍຄຳສັ່ງຈາກຕົວເລືອກ "Stop for Maintenance" ແລ້ວປ້ອນຄຳສັ່ງຕໍ່ໄປນີ້:
sr@latin: Na kraju ovog koraka instalacije, sistem će se restartovati. Posle toga, uđite u komandni monitor preko opcije „Stop for Maintenance“ i unesite sledeće komande:

source: SiByl boot loader installation failed. Continue anyway?
lo: ຕິດຕັ້ງບູດໂຫຼດເດີ SiByl ບໍ່ສຳເລັດ ຈະດຳເນີນການຕໍ່ໄປ ຫຼື ບໍ?
sr@latin: Instalacija SiByl pokretačkog programa nije uspela. Nastaviti dalje?

source: The SiByl package failed to install into /target/. Installing SiByl as a boot loader is a required step. The install problem might however be unrelated to SiByl, so continuing the installation may be possible.
lo: ຕິດຕັ້ງແພັກເກັດ SiByl ລົງໃນ /target/ ບໍ່ສຳເລັດ ການຕິດຕັ້ງ SiByl ເປັນບູດໂຫຼດເດີ ເປັນຂັ້ນຕອນທີ່ຈຳເປັນ ແຕ່ບັນຫາຂອງການຕິດຕັງອາດບໍ່ກ່ຽວກັບ SiByl ກໍ່ໄດ້ ດັ່ງນັ້ນ ການດຳເນີນການຕິດຕັ້ງຕໍ່ໄປກໍ່ອາດເຮັດໄດ້
sr@latin: Paket SiByl nije uspeo da se instalira na /target/. Instaliranje SiByl-a kao pokretačkog programa je obavezan korak. Problem možda ipak nije u vezi sa SiByl-om, tako da nastavak instalacije može biti moguć.

source: Installing the SiByl boot loader
lo: ກຳລັງຕິດຕັ້ງບູດໂຫຼດເດີ SiByl
sr@latin: Instaliranje SiByl pokretačkog programa

source: Installing the SiByl package
lo: ກຳລັງຕິດຕັ້ງແພັກເກັດ SiByl
sr@latin: Instaliranje paketa SiByl

source: Creating SiByl configuration
lo: ກຳລັງຕັຄ່າໃຫ້ກັບ SiByl
sr@latin: Kreiranje SiByl konfiguracije

source: Install the SiByl boot loader on a hard disk
lo: ຕິດຕັ້ງບູດໂຫຼດເດີ quik ລົງໃນຮາດດິດສ໌
sr@latin: Instaliraj SiByl pokretački program na hard disk

source: SiByl boot partition
lo: ພາທິຊັນບູດ SiByl
sr@latin: SiByl pokretačka particija

source: Configure the Network Block Device
sr@latin: Konfiguriši mrežni uređaj

source: NBD configuration action:
sr@latin: Konfigurisanje mreže:

source: There are currently ${NUMBER} devices connected.
sr@latin: Trenutno je ${NUMBER} grupa povezano.

source: Network Block Device server:
sr@latin: Server mrežnog uređaja:

source: Please enter the host name or the IP address of the system running nbd-server.
sr@latin: Unesite ime hosta ili IP adresu sistema na kome radi „nbd-server“.

source: Network Block Device port or name:
sr@latin: Port ili ime mrežnog uređaja:

source: Please enter the port on which the nbd-server is running. In case the entered data contains a non-digit character, a name-based export will be assumed.
sr@latin: Unesite port na kome „nbd-server“ radi. U slučaju da uneseni podatak sadrži nedigitalne karaktere, pretpostaviće se eksport baziran na imenu.

source: Network Block Device device node:
sr@latin: Čvor mrežnog uređaja:

source: Please select the NBD device node that you wish to connect or disconnect.
sr@latin: Izaberite čvor mrežnog uređaja koji želite da se povežete ili da otkačite.

source: Failed to connect to the NBD server
sr@latin: Neuspelo konektovanje na server mrežnog uređaja
