Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel4/*.po
Languages: lo, sr@latin

source: Connecting to the nbd-server failed. Please ensure that the host and the port or the name which you entered are correct, that the nbd-server process is running on that host and port (or using that name), that the network is configured correctly, and retry.
sr@latin: Povezivanje na „nbd-server“ nije uspelo. Potvrdite da su host i port ili ime koje ste uneli ispravni, da „nbd-server“ radi na tom hostu i postu (ili koristi to ime), da je mreća pravilno konfigurisana i probajte ponovo.

source: No more Network Block Device nodes left
sr@latin: Nema više slobodnih mrežnih čvorova

source: Either all available NBD device nodes are in use or something went wrong with the detection of the device nodes.
sr@latin: Ili su svi dostupni mrećni čvorovi u upotrebi ili je nešto pošlo naopako pri detekciji čvorova uređaja.

source: No more NBD device nodes can be configured until a configured one is disconnected.
sr@latin: Nijedan više čvor mrežnog uređaja ne može biti konfigurisan dok se neki konfigurisan ne isključi.

source: No connected Network Block Device nodes were found
sr@latin: Nisu pronađeni povezani čvorovi mrežnog uređaja

source: There are currently no Network Block Device nodes connected to any server. As such, you can't disconnect any of them.
sr@latin: Trenutno nema povezanih mrežnih čvorova ni za jedan server. Tako da ne možete da isključite ni jedan od njih.

source: Connect a Network Block Device
sr@latin: Poveži mrežni uređaj

source: Disconnect a Network Block Device
sr@latin: Isključiti mrežni uređaj

source: Finish and return to the partitioner
sr@latin: Završi i vrati se na meni za particionisanje

source: Configuring flash memory to boot the system
lo: ກຳລັງຕັງຄ່າໜ່ວຍຄວາມຈຳແຟັດຊ໌ໃຫ້ບູດລະບົບ
sr@latin: Konfigurisanje fleš memorije da pokreće sistem

source: Making the system bootable
lo: ກຳລັງເຮັດໃຫ້ລະບົບບູດໄດ້
sr@latin: Omogućavanje startovanja sistema

source: Preparing the system...
lo: ກຳລັງຕຽມພ້ອມລະບົບ...
sr@latin: Pripremanje sistema...

source: Writing the kernel to flash memory...
lo: ກຳລັງຂຽນເຄີເນວລົງໃນໜ່ວຍຄວາມຈຳແຟັດຊ໌...
sr@latin: Kopiranje kernela na fleš memoriju...

source: Generating boot image on disk...
lo: ກຳລັງສ້າງອີເມວສຳລັບບູດໄດ້ໃນດິດສ໌...
sr@latin: Generisanje pokretačke slike na diske...

source: Make the system bootable
lo: ເຮັດໃຫ້ລະບົບບູດໄດ້
sr@latin: Omogućavanje pokretanja sistema
