Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel4/*.po
Languages: lo, sr@latin

source: Virtual disk %s (%s)
lo: ດິກສຂອງແທ້ %s (%s)
sr@latin: Virtuelni disk %s (%s)

source: Virtual disk %s, partition #%s (%s)
lo: ດິກສຂອງແທ້ %s,ພາຣທິຊັ້ນ #%s (%s)
sr@latin: Virtuelni disk %s, particija #%s (%s)

source: acls - support POSIX.1e Access Control List
lo: acls - ຮອງຮັບ Access Control List ตาม POSIX.1e
sr@latin: acls - podrška za POSIX.1e Access Control List

source: shortnames - only use the old MS-DOS 8.3 style filenames
lo: shortnames -ໃຊ້ຊື່ແຟ້ມໃນແບບ 7.3 ແບບເກົ່າຂອງ MS-DOS ເທົ່ານັ້ນ
sr@latin: kratki nazivi - koristiti stare MS-DOS 8.3 nazive fajlova

source: In order to start your new system, a so called boot loader is used. It is installed in a boot partition. You must set the bootable flag for the partition. Such a partition will be marked with "${BOOTABLE}" in the main partitioning menu.
lo: ການເລີ່ມຕົ້ນເຮັດວຽກຂອງລະບົບເມື່ອເປີດເຄື່ອງ ຈະອາໄສສີ່ງທີ່ຮ້ອງວ່າບູດໂຫຼດເດີ ບູດໂຫຼດເດີຈະຖືກຕິດຕັ້ງໃວ້ໃນພາຣທິຊັ້ນສຳລັບບູດ ທ່ານຕ້ອງກຳນົດແຟັກ bootable ໃຫ້ກັບພາຣທິຊັ້ນດັ່ງກ່າວດ້ວຍ ແລະ ພາຣທິຊັ້ນດັ່ງກ່າວ ຈະຖືກເຮັດເຄື່ອງໝາຍດ້ວຍ "${BOOTABLE}" ໃນລາຍການຫຼັກສຳລັບແບ່ງພາຣທິຊັ້ນ
sr@latin: Da biste pokrenuli vaš novi sistem, morate koristiti tzv. pokretački program. On je instaliran na but particiji. Morate postaviti butabilnu zastavicu za tu particiju. Takva particija će biti označena kao „${BOOTABLE}“ u meniju za particionisanje.

source: !! ERROR: %s
lo: !! ຜິດພາດ: %s
sr@latin: !! GREŠKA: %s

source: KEYSTROKES:
lo: ປຸ່ມກົດ:
sr@latin: PRITISCI:

source: Display this help message
lo: ສະແດງຂໍ້ຄວາມຊ່ວຍເຫຼືອ
sr@latin: Prikaži ovu pomoćnu poruku

source: Go back to previous question
lo: ກັບໄປທີ່ຄຳຖາມກ່ອນ
sr@latin: Nazad na prethodno pitanje

source: Select an empty entry
lo: ເລືອກລາຍການດັ່ງກ່າວ
sr@latin: Izaberi prazan unos

source: Prompt: '%c' for help, default=%d>
lo: ຄຳສັ່ງ: '%c' ເບີ່ງວິທີໃຊ້,ຄ່າປະລິຍາຍ=%d>
sr@latin: Pitaj: '%c' -- pomoć, podrazumevano=%d>

source: Prompt: '%c' for help>
lo: ຄຳສັ່ງ: '%c' ເບີ່ງວິທີໃຊ້>
sr@latin: Pitaj: „%c“ za pomoć>

source: Prompt: '%c' for help, default=%s>
lo: ຄຳສັ່ງ: '%c' ເບີ່ງວິທີໃຊ້,ຄ່າປະລິຍາຍ=%s>
sr@latin: Pitaj: '%c' -- pomoć, podrazumevano=%s>

source: [Press enter to continue]
lo: [ກົດ enter ເພື່ອດຳເນີນການຕໍ່]
sr@latin: [Pritisni „Enter“ za nastavak]

source: Failed to mount /target/proc
lo: ບໍ່ສາມາດເມົ້າທ໌ /target/proc
sr@latin: Neuspelo montiranje /target/proc

source: Mounting the proc file system on /target/proc failed.
lo: ເມົ້າທ໌ລະບົບແຟ້ມ proc ເທີງ /target/proc ບໍ່ສຳເລັດ
sr@latin: Montiranje proc fajl sistema na /target/proc nije uspelo.

source: Warning: Your system may be unbootable!
lo: ຄຳເຕືອນ: ລະບົບຂອງທ່ານອາດບໍ່ສາມາດບູດໄດ້!
sr@latin: Upozorenje: vaš sistem možda neće moći da se startuje!

source: Setting firmware variables for automatic boot
lo: ການຕັ້ງຄ່າຕົວແປເຟີມແວສຳລັບການບູດອັດຕະໂນມັດ
sr@latin: Postavljanje promenljive firmvera za automatsko startovanje

source: Some variables need to be set in the Genesi firmware in order for your system to boot automatically. At the end of the installation, the system will reboot. At the firmware prompt, set the following firmware variables to enable auto-booting:
lo: ທ່ານຈຳເປັນຕ້ອງຕັ້ງຄ່າຕົວແປໃນເຟີມແວ Genesi ເພື່ອໃຫ້ລະບົບຂອງທ່ານສາມາດບູດໄດ້ໂດຍອັດຕະໂນມັດ ເມື່ອສຳເລັດຂະບວນການຕິດຕັ້ງແລ້ວ ລະບົບຈະເລີ່ມບູດໃໝ່ ທີ່ແຖວຄຳສັ່ງຂອງເຟີມແວ ໃຫ້ຕັ້ງຄ່າຂອງເຟີມແວຕໍ່ໄປນີ້ ເພື່ອທີ່ຈະສາມາດບູດໄດ້ໂດຍອັດຕະໂນມັດ:
sr@latin: Neke promenljive treba da budu postavljene u Genesi firmver da bi se vaš sistem automatski startovao. Na kraju instalacije sistem će se restartovati. Na promptu firmvera postavite sledeće promenljive da bi omogućili automatsko startovanje:

source: You will only need to do this once. Afterwards, enter the "boot" command or reboot the system to proceed to your newly installed system.
lo: ການສັ່ງດັ່ງກ່າວພຽງເທື່ອດຽວກໍ່ພຽງພໍ ໃນເທື່ອຕໍ່ໄປ ພຽງປ້ອນຄຳສັ່ງ "boot" ຫຼືບູດເຄື່ອງໃໝ່ເພື່ອເຂົ້າສູ້ລະບົບເພື່ອຕິດຕັ້ງໃໝ່
sr@latin: Ovo treba da uradite samo jednom. Posle toga, unesite komandu „boot“ ili restartujte sitem da bi nastavili rad sa novoinstaliranim sistemom.

source: Alternatively, you will be able to boot the kernel manually by entering, at the firmware prompt:
lo: ຫຼື ບໍ່ດັ່ງນັ້ນ ທ່ານກໍ່ສາມາດສັ່ງບູດເດີຄາເນວເອງໄດ້ໂດຍປ້ອນຄຳສັ່ງທີ່ແຖວຄຳສັ່ງຂອງເຟີມແວ:
sr@latin: U suprotnom, možete startovati kernel ručno unoseći na prompt firmvera:

source: Some variables need to be set in CFE in order for your system to boot automatically. At the end of installation, the system will reboot. At the firmware prompt, set the following variables to simplify booting:
lo: ທ່ານຈຳເປັນຕ້ອງຕັ້ງຄ່າຕົວແປໃນ CFE ເພື່ອໃຫ້ລະບົບຂອງທ່ານບູດໄດ້ໂດຍອັດຕະໂນມັດ ເມື່ອສິ້ນສຸດຂະບວນການຕິດຕັ້ງ ລະບົບຈະເລີ່ມບູດໃໝ່ ທີ່ແຖວຄຳສັ່ງຂອງເຟີມແວ ໃຫ້ຕັ້ງຄ່າຕົວແປຕໍ່ໄປນີ້ ເພື່ອໃຫ້ບູດໄດ້ງ່າຍເຂົ້າ:
sr@latin: Neke promenljive treba da budu postavljene u CFE-u da bi se vaš sistem automatski pokrenuo. Na kraju instalacije sistem će se restartovati. Na promptu firmvera postavite sledeće promenljive da bi pojednostavili pokretanje:

source: You will only need to do this once. This enables you to just issue the command "boot_debian" at the CFE prompt.
lo: ທ່ານຈະຕ້ອງເຮັດແບບນີ້ພຽງເທື່ອດຽວເທົ່ານັ້ນ ເພື່ອໃຫ້ທ່ານສາມາດ "boot_debian" ທີ່ແຖວຄຳສັ່ງ CFE ໄດ້
sr@latin: Ovo treba da uradite samo jednom. To vam omogućuje da na CFE promptu samo zadate komandu „boot_debian“.

source: If you prefer to auto-boot on every startup, you can set the following variable in addition to the ones above:
lo: ຖ້າທ່ານຢາກໃຫ້ບູດອັດຕະໂນມັດທຸກໆຄັ້ງທີ່ເປີດເຄື່ອງ ທ່ານສາມາດກຳນົດຕົວແປຕໍ່ໄປນີ້ເພີ່ມເຕີມຈາກຕົວແປຂ້າງຕົ້ນໄດ້:
sr@latin: Ako želite da se prilikom svakog startovanja automatski pokrene vaš Debian sistem, možete postaviti sledeću promenljivu pored gore navedenih:

source: Install GRUB?
sr@latin: Instalirati GRUB?

source: GRUB 2 is the next generation of GNU GRUB, the boot loader that is commonly used on i386/amd64 PCs. It is now also available for ${ARCH}.
sr@latin: GRUB 2 je sledeća generacija GNU GRUB-a, pokretački program koji se najčešće koristi na i386/amd64 PC-jevima. Sada je takođe dostupan za ${ARCH}.

source: It has interesting new features but is still experimental software for this architecture. If you choose to install it, you should be prepared for breakage, and have an idea on how to recover your system if it becomes unbootable. You're advised not to try this in production environments.
sr@latin: Ima zanimljive karakteristike, ali je još uvvek eksperimentalan softver za ovu arhitekturu. Ako izaberete da ga instalirate, trebate biti spremni za kvarove, i znati kako da povratite vaš sistem ako postane nebutabilan. Savetuje se da ovo ne pokušavate na okruženjima koja se koriste za produkciju.

source: NewWorld boot partition
lo: ພາທິຊັ້ນບູດແບບ NewWorld
sr@latin: NewWorld but particija

source: Go back to the menu and resume partitioning?
lo: ຈະກັບໄປຍັງລາຍການເພື່ອແບ່ງພາທິຊັ້ນໃໝ່ ຫຼື ບໍ?
sr@latin: Nazad na meni i nastaviti particionisanje?

source: No NewWorld boot partition was found. The yaboot boot loader requires an Apple_Bootstrap partition at least 819200 bytes in size, using the HFS Macintosh file system.
lo: ບໍ່ພົບພາທິຊັ້ນບູດແບບ NewWorld ບູດໂຫຼດເດີ yabootຈຳເປັນຕ້ອງໃຊ້ພາທິຊັ້ນ Apple_Bootstrap ຂະໜາດຢ່າງໜ້ອຍ 819200 ໄບສ ໂດຍໃຊ້ລະບົບແຟ້ມ HFS ຂອງແມັຄອິນທອດຊ໌
sr@latin: Nije pronađena nijedna NewWorld but particija. Pokretački program za yaboot zahteva Apple_Bootstrap particiju najmanje veličine 819200 bajtova, koristeći HFS Macintosh fajl sistem.

source: The NewWorld boot partition must be at least 819200 bytes in size.
lo: ພາທິຊັ້ນບູດແບບ NewWorld ຕ້ອງມີຂະໜາດຢ່າງໜ້ອຍ 819200 ໄບສ
sr@latin: NewWorld but particija mora biti najmanje veličine 819200 bajtova.

source: boot
lo: ບູດ
sr@latin: but

source: HFS Macintosh file system
lo: ລະບົບແຟ້ມ HFS ຂອງແມັຄອິນທອດຊ໌
sr@latin: HFS Macintosh fajl sistem

source: Use the partition as a PowerPC PReP boot partition
lo: ໃຊ້ພາທິຊັ້ນເປັນພາທິຊັ້ນບູດແບບ PReP ຂອງ PowerPC
sr@latin: Upotrebi particiju kao PowerPC PReP pokretačku particiju

source: PowerPC PReP boot partition
lo: ພາທິຊັ້ນບູດແບບ PReP ຂອງ PowerPC
sr@latin: PowerPC PReP pokretačka particija

source: No PowerPC PReP boot partition is found.
lo: ບໍ່ພົບພາທິຊັ້ນບູດແບບ PReP ຂອງ PowerPC
sr@latin: Nijedna PowerPC PReP pokretačka particija nije pronađena.

source: The PowerPC PReP boot partition must be in the first 8MB.
lo: ພາທິຊັ້ນບູດແບບ PReP ຂອງ PowerPC ຕ້ອງຢູ່ໃນ 8MB ແລກ
sr@latin: PowerPC PReP pokretačka particija mora biti u prvih 8MB.

source: Installing quik
lo: ກຳລັງຕິດຕັ້ງ quik
sr@latin: Instaliranje quik-a

source: Installing quik boot loader
lo: ກຳລັງຕິດຕັ້ງບູດໂຫຼດເດີ quik
sr@latin: Instaliranje quik pokretačkog programa

source: quik installation failed. Continue anyway?
lo: ຕິດຕັ້ງ quik ບໍ່ສຳເລັດ ຈະດຳເນີນການຕໍ່ໄປ ຫຼື ບໍ?
sr@latin: Instalacija quik-a nije uspela. Nastaviti dalje?

source: The quik package failed to install into /target/. Installing quik as a boot loader is a required step. The install problem might however be unrelated to quik, so continuing the installation may be possible.
lo: ຕິດຕັ້ງແພັກເກັດ quik ລົງໃນ /target/ ບໍ່ສຳເລັດ ການຕິດຕັ້ງ quik ເປັນບູດໂຫຼດເດີ ເປັນຂັ້ນຕອນທີ່ຈຳເປັນ ແຕ່ບັນຫາຂອງການຕິດຕັ້ງອາດບໍ່ກ່ຽວກັບ quik ກໍໄດ້ ດັ່ງນັ້ນ ການດຳເນີນການຕິດຕັ້ງຕໍ່ໄປກໍ່ອາດເຮັດໄດ້
sr@latin: Paket quik nije uspeo da se instalira na /target/. Instaliranje quik-a kao pokretačkog programa je obavezan korak. Problem možda ipak nije u vezi sa quik-om, tako da nastavak instalacije može biti moguć.

source: Checking partitions
lo: ກຳລັງກວດສອບພາທິຊັ້ນ
sr@latin: Proveravanje particije

source: No root partition found
lo: ບໍ່ພົບພາທິຊັ້ນພື້ນຖານ
sr@latin: Nijedna root particija nije pronađena

source: No partition is mounted as your new root partition. You must mount a root partition first.
lo: ບໍ່ມີພາທິຊັ້ນເມົ້າທ໌ທີ່ເປັນພາທິຊັ້ນພື້ນຖານໃໝ່ ທ່ານຕ້ອງເມົ້າທ໌ທີ່ເປັນພາທິຊັ້ນພື້ນຖານກ່ອນ
sr@latin: Nijedna particija nije montirana kao vaša nova root particija. Morate prvo montirati root particiju.

source: Boot partition not on first disk
lo: ພາທິຊັ້ນບູດບໍ່ໄດ້ຢູ່ໃນດິກສ໌ທຳອິດ
sr@latin: Pokretačka particija nije na prvom disku

source: The quik boot loader requires partition that holds /boot to be on the first disk. Please return to the partitioning step.
lo: ບູດໂຫຼດເດີ quik ຈຳເປັນຕ້ອງໃຫ້ພາທິຊັ້ນທີ່ມີ /boot ຢູ່ໃນດິກສ໌ທຳອິດ ກະລຸນາກັບໄປທີ່ຂັ້ນຕອນແບ່ງພາທິຊັ້ນ
sr@latin: Pokretački program quik zahteva da se pokretačka particija nalazi na prvom disku. Bratite se na korak particionisanja.

source: Boot partition must be on ext2
lo: ພາທິຊັ້ນບູດຕ້ອງເປັນ ext2
sr@latin: Pokretačka particija mora biti tipa ext2

source: The quik boot loader requires the partition that holds /boot to be formatted using the ext2 file system. Please return to the partitioning step.
lo: ບູດໂຫຼດເດີ quik ຕ້ອງການໃຫ້ພາທິຊັ້ນທີ່ເປັນ /boot ຟໍຣແມັດດ້ວຍລະບົບແຟ້ມແບບ ext2 ກະລຸນາກັບໄປທີ່ຂັ້ນຕອນແບ່ງພາທິຊັ້ນ
sr@latin: Pokretački program quik zahteva da particija koja sadrži direktorijum /boot bude formatirana kao ext2. Vratite se na korak particionisanja.

source: Do you really want to install the quik boot loader?
lo: ທ່ານຕ້ອງການຕິດຕັ້ງບູດໂຫຼດເດີ quik ແທ້ ຫຼື ບໍ?
sr@latin: Da li stvarno želite da instalirate pokretački program quik?

source: You have chosen to install the quik boot loader. You will not be able to boot any other operating system from this disk. Furthermore, your machine may not be bootable in any manner after this process completes. If you are left with a blank screen, you may need to try a cold boot and hold down Command-Option-P-R.
lo: ທ່ານໄດ້ເລືອກທີ່ຈະຕິດຕັ້ງບູດໂຫຼດເດີ quik ທ່ານບໍ່ສາມາດບູດລະບົບປະຕິບັດການອື່ນຈາກດິກສ໌ນີ້ໄດ້ ນອກຈາກນີ້ ເຄື່ອງຂອງທ່ານອາດຈະບໍ່ສາມາດບູດໄດ້ບໍ່ວ່າກໍລະນີໃດໆ ຫຼັງຈາກສິ້ນສຸດການຕິດຕັ້ງນີ້ແລ້ວ ຖ້າທ່ານພົບແຕ່ຈໍເປົ່າ ທ່ານອາດຈະຕ້ອງລອງ cold boot ແລ້ວກົດປຸ່ມ Command-Option-P-R
sr@latin: Izabrali ste da instalirate pokretački program quik. Nećete moći da pokrenete neki drugi operativni sistem sa ovog diska. Dodatno, vaša mašina možda neće uopšte moći da se pokrene pošto se ovaj proces završi. Ako vam se pojavi samo prazan ekran, možda ćete morati da probate sa gašenjem i ponovnim paljenjem mašine i držite pritisnutu kombinaciju tastera Command-Option-P-R.

source: Be aware that this code has not been thoroughly tested.
lo: ກະລຸນາຮັບຮູ້ໄວ້ວ່າໂປຼແກມນີ້ຍັງບໍ່ຜ່ານການກວດສອບຢ່າງຖີ່ຖ້ວນ
sr@latin: Imajte na umu da ovaj kod nije detaljno testiran.

source: You have chosen to install the quik boot loader. You will not be able to boot any other operating system from this disk. Furthermore, your machine may not be bootable in any manner after this process completes.
lo: ທ່ານໄດ້ເລືອກທີ່ຈະຕິດຕັ້ງບູດໂຫຼດເດີ quik ທ່ານບໍ່ສາມາດບູດລະບົບປະຕິບັດການອື່ນຈາກດິກສ໌ນີ້ໄດ້ ນອກຈາກນີ້ ເຄື່ອງຂອງທ່ານອາດຈະບໍ່ສາມາດບູດໄດ້ບໍ່ວ່າກໍລະນີໃດໆ ຫຼັງຈາກສິ້ນສຸດການຕິດຕັ້ງນີ້ແລ້ວ
sr@latin: Izabrali ste da instalirate pokretački program quik. Nećete moći da pokrenete neki drugi operativni sistem sa ovog diska. Dodatno, vaša mašina možda neće uopšte moći da se pokrene pošto se ovaj proces završi.

source: Creating quik configuration
lo: ກຳລັງຕັ້ງຄ່າໃຫ້ກັບ quik
sr@latin: Kreiranje quik konfiguracije

source: Failed to create quik configuration
lo: ສ້າງແຟ້ມຄ່າຕັ້ງໃຫ້ກັບ quik ບໍ່ສຳເລັດ
sr@latin: Kreiranje quik konfiguracije nije uspelo

source: The creation of the main quik configuration file failed.
lo: ບໍ່ສາມາດສ້າງແຟ້ມຄ່າຕັ້ງຫຼັກຂອງ quik ໄດ້
sr@latin: Kreiranje glavnog quik konfiguracionog fajla nije uspelo.

source: Installing quik into bootstrap partition
lo: ກຳລັງຕິດຕັ້ງ quik ລົງໃນພາທິຊັ້ນຍູດ
sr@latin: Instaliranje quik-a na pokretačku particiju

source: Failed to install boot loader
lo: ຕິດຕັ້ງບູດໂຫຼດເດີບໍ່ສຳເລັດ
sr@latin: Instaliranje pokretačkog programa nije uspelo

source: The installation of the quik boot loader failed.
lo: ການຕິດຕັ້ງບູດໂຫຼດເດີ quik ລົ້ມເຫຼວ
sr@latin: Instalacija pokretačkog programa quik nije uspela.

source: Warning: your system may be unbootable!
lo: ຄຳເຕືອນ:ລະບົບຂອງທ່ານອາດບໍ່ສາມາດບູດໄດ້!
sr@latin: Upozorenje: vaš sistem možda neće moći da se startuje!

source: Setting up OpenFirmware
lo: ກຳລັງຕັ້ງຄ່າ OpenFirmware
sr@latin: Podešavanje OpenFirmware-a

source: Unable to configure OpenFirmware
lo: ບໍ່ສາມາດຕັ້ງຄ່າ OpenFirmware ໄດ້
sr@latin: Konfiguracija OpenFirmware-a nije uspela

source: Setting the OpenFirmware boot-device variable failed. You will have to configure OpenFirmware yourself to boot.
lo: ຕັ້ງຄ່າຕົວແປ boot-device ຂອງ OpenFirmware ບໍ່ສຳເລັດ ທ່ານຈະຕ້ອງຕັ້ງຄ່າ OpenFirmware ເອງ ເພື່ອຈະບູດລະບົບໄດ້
sr@latin: Podešavanje promenljive boot-device OpenFirmware-a nije uspelo. Moraćete sami da iskonfigurišete OpenFirmware da biste pokrenuli sistem.

source: Problem configuring OpenFirmware
lo: ເກີດບັນຫາຂະນະຕັ້ງຄ່າ OpenFirmware
sr@latin: Problem pri konfigurisanju OpenFirmware-a

source: Setting the OpenFirmware boot-command variable failed. You may have intermittent boot failures.
lo: ຕັ້ງຄ່າຕົວແປ boot-command ຂອງ OpenFirmware ບໍ່ສຳເລັດ ທ່ານອາດບູດລະບົບບໍ່ຂື້ນເປັນຄັງຄາວ
sr@latin: Podešavanje promenljive boot-command OpenFirmware-a nije uspelo. Možda ćete imati povremene probleme pri pokretanju sistema.

source: Successfully installed quik
lo: ຕິດຕັ້ງ quik ແລ້ວສົມບູນ
sr@latin: Uspešno instaliran quik.

source: The quik boot loader was successfully installed.
lo: ຕິດຕັ້ງບູດໂຫຼດເດີ quik ສຳເລັດສົມບູນ
sr@latin: Pokretački program quik je uspešno instaliran.

source: The new system is now ready to boot.
lo: ລະບົບໃໝ່ພ້ອມທີ່ຈະບູດແລະວ
sr@latin: Novi sistem je sada spreman za startovanje.

source: Install quik on a hard disk
lo: ຕິດຕັ້ງ quik ລົງໃນຮາດດິກສ໌
sr@latin: Instaliraj quik na hard disk

source: Installing Yaboot
lo: ກຳລັງຕິດຕັ້ງ Yaboot
sr@latin: Instaliranje Yaboot-a

source: Installing Yaboot boot loader
lo: ກຳລັງຕິດຕັ້ງບູດໂຫຼດເດີ Yaboot
sr@latin: Instaliranje Yaboot pokretačkog programa

source: Yaboot installation failed. Continue anyway?
lo: ຕິດຕັ້ງ Yaboot ບໍ່ສຳເລັດ ຈະດຳເນີນການຕໍ່ໄປ ຫຼື ບໍ?
sr@latin: Instalacija Yaboot-a nije uspela. Nastaviti dalje?

source: The yaboot package failed to install into /target/. Installing Yaboot as a boot loader is a required step. The install problem might however be unrelated to Yaboot, so continuing the installation may be possible.
lo: ຕິດຕັ້ງແພັກແກັດ yaboot ລົງໃນ /target/ ບໍ່ສຳເລັດ ການຕິດຕັ້ງ yaboot ເປັນບູດໂຫຼດເດີ ເປັນຂັ້ນຕອນທີ່ຈຳເປັນ ແຕ່ບັນຫາຂອງການຕິດຕັ້ງອາດບໍ່ກ່ຽວກັບ Yaboot ກໍ່ໄດ້ ດັ່ງນັ້ນ ການດຳເນີນການຕິດຕັ້ງຕໍ່ໄປກໍ່ອາດເຮັດໄດ້
sr@latin: Paket yaboot nije uspeo da se instalira na /target/. Instaliranje Yaboot-a kao pokretačkog programa je obavezan korak. Problem možda ipaknije u vezi sa Yaboot-om, tako da nastavak instalacije može biti moguć.

source: Looking for bootstrap partitions
lo: ກຳລັງຄົ້ນຫາພາທິຊັ້ນບູດ
sr@latin: Traženje butstrep particije

source: No bootstrap partition found
lo: ບໍ່ພົບພາທິຊັ້ນບູດ
sr@latin: Nijedna butstrep particija nije pronađena

source: No hard disks were found which have an "Apple_Bootstrap" partition. You must create an 819200-byte partition with type "Apple_Bootstrap".
lo: ບໍ່ພົບຮາດດິກສ໌ທີ່ມີພາທິຊັ້ນແບບ "Apple_Bootstrap" ທ່ານຕ້ອງສ້າງພາທິຊັ້ນຂະໜາດ 819200 ໄຍສ໌ ຊະນິດ "Apple_Bootstrap" ເສຍກ່ອນ
sr@latin: Nije pronađen nijedan disk koji ima „Apple_Bootstrap“ particiju. Morate kreirati particiju veličine 819200-bajtova tipa „Apple_Bootstrap“.

source: Looking for root partition
lo: ກຳລັງຄົ້ນຫາພາທິຊັ້ນພື້ນຖານ
sr@latin: Traženje root particije

source: Looking for other operating systems
lo: ກຳລັງກວດຫາລະບົບປະຕິບັດການອື່ນ
sr@latin: Traženje drugih operativnih sistema

source: Yaboot (the Linux boot loader) needs to be installed on a hard disk partition in order for your system to be bootable. Please choose the destination partition from among these partitions that have the bootable flag set.
lo: Yaboot (ບູດໂຫຼດເດີສຳລັບລີນຸກ) ຈະຕ້ອງຕິດຕັ້ງລົງເທີງພາທິຊັ້ນໃນຮາດດິດສ໌ ເພື່ອໃຫ້ລະບົບບູດໄດ້ ກະລຸນາເລືອກພາທິຊັ້ນທີ່ຈະຕິດຕັ້ງຈາກພາທິຊັ້ນເຫຼົ່ານີ້ທີ່ໄດ້ຕັ້ງຄ່າແຟັກບູດໄດ້
sr@latin: Yaboot (Linux pokretački program) treba da bude instaliran na hard disk particiji da bi sistem mogao da se startuje. Odaberite ciljnu particiju među ovim particijama koje imaju postavljenu butabilnu zastavicu.

source: Warning: this will erase all data on the selected partition!
lo: ຄຳເຕືອນ:ຂໍ້ມູນທັງໝົດໃນພາທິຊັ້ນທີ່ເລືອກຈະຖືກລົບຖີ້ມ!
sr@latin: Upozorenje: ovo će obrisati sve podatke na odabranoj particiji?

source: Creating yaboot configuration
lo: ກຳລັງຕິດຕັ້ງຄ່າໃຫ້ກັບ yaboot
sr@latin: Kreiranje yaboot konfiguracije

source: Failed to create yaboot configuration
lo: ສ້າງແຟ້ມຄ່າຕັ້ງໃຫ້ກັບ yaboot ບໍ່ສຳເລັດ
sr@latin: Kreiranje yaboot konfiguracije nije uspelo

source: The creation of the main yaboot configuration file failed.
lo: ບໍ່ສາມາດສ້າງແຟ້ມຄ່າຕັ້ງຫຼັກຂອງ yaboot ໄດ້
sr@latin: Kreiranje glavne yaboot konfiguracije nije uspelo.

source: Installing yaboot into bootstrap partition
lo: ກຳລັງຕິດຕັ້ງ yaboot ລົງໃນພາທິຊັ້ນບູດ
sr@latin: Instaliranje yaboot-a na butstrep particiju

source: The installation of the yaboot boot loader failed.
lo: ການຕິດຕັ້ງບູດໂຫຼດເດີ yaboot ລົ້ມເຫຼວ
sr@latin: Instalacija yaboot pokretačkog programa nije uspela.

source: Successfully installed yaboot
lo: ຕິດຕັ້ງ yaboot ແລ້ວສົມບູນ
sr@latin: Uspešno instaliran yaboot.

source: The yaboot boot loader was successfully installed.
lo: ຕິດຕັ້ງບູດໂຫຼດເດີ yaboot ແລ້ວສົມບູນ
sr@latin: Yaboot pokretački program je uspešno instaliran.

source: Install yaboot on a hard disk
lo: ຕິດຕັ້ງ yaboot ລົງໃນຮາດດິກສ໌
sr@latin: Iinstaliraj yaboot na hard disk

source: Reinstall yaboot boot loader
lo: ຕິດຕັ້ງບູດໂຫຼດເດີ yaboot ໃໝ່
sr@latin: Ponovo instaliraj yaboot pokretački program

source: Install the kernel on a PReP boot partition
lo: ຕິດຕັ້ງເຄີເນວໃນພາທິຊັ້ນບູດແບບ PReP
sr@latin: Instaliraj kernel na PReP pokretačku particiju

source: Copying the kernel to the PReP boot partition
lo: ກຳລັງຄັດລອກເຄີເນວໃນພາທິຊັ້ນບູດແບບ PReP
sr@latin: Kopiranje kernela na PReP pokretačku particiju

source: Looking for PReP boot partitions
lo: ກຳລັງຄົ້ນຫາພາທິຊັ້ນບູດແບບ PReP
sr@latin: Traženje PReP pokretačke particije

source: No PReP boot partitions
lo: ບໍ່ພົບພາທິຊັ້ນບູດແບບ PReP
sr@latin: Nema PReP pokretačkih particija

source: No PReP boot partitions were found. You must create a PReP boot partition within the first 8MB of your hard disk.
lo: ບໍ່ພົບພາທິຊັ້ນບູດແບບ PReP ທ່ານຕ້ອງສ້າງພາທິຊັ້ນບູດແບບ PReP ພາຍໃນ 8MB ທຳອິດຂອງຮາດດິດສ໌
sr@latin: Nije pronađena nijedna PReP pokretačka particija. Morate kreirati PReP pokretačku particiju unutar prvih 8MB vašeg hard diska.

source: Looking for the root partition
lo: ກຳລັງຄົ້ນຫາພາທິຊັ້ນພື້ນຖານ
sr@latin: Traženje root particije

source: Successfully installed PReP
lo: ຕິດຕັ້ງ PReP ແລ້ວສົມບູນ
sr@latin: Uspešno instaliran PReP

source: The kernel was properly copied to the PReP boot partition.
lo: ຄັດລອກເຄີເນວໃນພາທິຊັ້ນບູດແບບ PReP ລຽບຮ້ອຍແລ້ວ
sr@latin: Kernel je ispravno kopiran na PReP pokretačku particiju.

source: Checking the ext2 (revision 0) file system in partition #${PARTITION} of ${DEVICE}...
lo: ກຳລັງກວດສອບລະບົບແຟ້ມ ext2 (revision 0) ໃນພາທິຊັ້ນ #${PARTITION} ຂອງ ${DEVICE}...
sr@latin: Proveravanje ext2 (revizija 0) fajl sistema na particiji #${PARTITION} uređaja ${DEVICE}...

source: The test of the file system with type ext2 (revision 0) in partition #${PARTITION} of ${DEVICE} found uncorrected errors.
lo: ການກວດສອບລະບົບແຟ້ມຊະນິດ ext2 (revision 0) ໃນພາທິຊັ້ນ #${PARTITION} ຂອງ ${DEVICE} ພົບຂໍ້ຜິດພາດທີ່ຍັງບໍ່ໄດ້ຮັບການແກ້ໄຂ
sr@latin: Test fajl sistema tipa ext2 (revizija 0) na particiji #${PARTITION} na ${DEVICE} je pronašao neispravljene greške.

source: If you do not go back to the partitioning menu and correct these errors, the partition will not be used at all.
lo: ຖ້າທ່ານບໍ່ໄປກັບລາຍການແບ່ງພາທິຊັ້ນເພື່ອແກ້ຂໍ້ຜິດພາດເຫຼົ່ານີ້ລະບົບຈະບໍ່ໃຊ້ພາທິຊັ້ນນີ້ເລີຍ
sr@latin: Ako se ne vratite nazad na meni za particionisanje i ne popravite ove greške, particija se uopšte neće upotrebljavati.

source: The ext2 (revision 0) file system creation in partition #${PARTITION} of ${DEVICE} failed.
lo: ສ້າງລະບົບແຟ້ມ ext2 (revision 0) ໃນພາທິຊັ້ນ #${PARTITION} ຂອງ ${DEVICE} ບໍ່ສຳເລັດ
sr@latin: Kreiranje ext2 (revizija 0) fajl sistema na particiji #${PARTITION} na ${DEVICE} nije uspelo.

source: No mount point is assigned for the ext2 (revision 0) file system in partition #${PARTITION} of ${DEVICE}.
lo: ບໍ່ມີການກຳນົດຕຳແໜ່ງເມົ້າທ໌ສຳລັບລະບົບແຟ້ມ ext2 (revision 0) ໃນພາທິຊັ້ນ #${PARTITION} ຂອງ ${DEVICE}
sr@latin: Nijedna tačka montiranja nije dodeljena ext2 (rev. 0) fajl sistemu na particiji #${PARTITION} na ${DEVICE}.

source: old Ext2 (revision 0) file system
lo: ລະບົບແຟ້ມ ext2 (revision0) ເກົ່າ
sr@latin: Stari ext2 (revizija 0) fajl sistem

source: Your boot partition has not been configured with the old ext2 (revision 0) file system. This is needed by your machine in order to boot. Please go back and use the old ext2 (revision 0) file system.
lo: ພາທິຊັ້ນບູດຂອງທ່ານບໍ່ໄດ້ກຳນົດໄວ້ໃຫ້ເປັນລະບົບແຟ້ມ ext2 (revision 0) ຊື່ງຈຳເປັນສຳລັບການບູດເຄື່ອງຂອງທ່ານ ກະລຸນາກັບຫຼັງໄປພາທິຊັ້ນບູດໃຫ້ເປັນລະບົບແຟ້ມ ext2 (revision 0) ເກົ່າ
sr@latin: Vaša pokretačka particija nije konfigurisana sa starim ext2r0 fajl sistemom. Ovo je potrebno da bi vaša mašina mogla da se pokrene. Vratite se nazad i upotrebite stari ext2r0 fajl sistem.

source: Your boot partition is not located on the first primary partition of your hard disk. This is needed by your machine in order to boot. Please go back and use your first primary partition as a boot partition.
lo: ພາທິຊັ້ນບູດຂອງທ່ານບໍ່ແມ່ນພາທິຊັ້ນທີ່ເປັນໄພຮມາລີອັນທຳອິດຂອງຮາດດິດສ໌ຊື່ງຈຳເປັນສຳລັບການບູດເຄື່ອງຂອງທ່ານ ກະລຸນາກັບຫຼັງໄປກຳນົດພາທິຊັ້ນທີ່ເປັນໄພຮມາລີອັນທຳອິດໃຫ້ເປັນພາທິຊັ້ນບູດ
sr@latin: Pokretačka particija nije locirana na prvoj primarnoj particiji hard diska. To je potrebno računaru da bi se butovao. Idite nazad i izaberite prvu primarnu particiju kao pokretačku.
