Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel5/*.po
Languages: cs, da, fa, ga, gl, hi, is, kn, ku, lo, mr, ro, ta, te, th, ug

source: Please enter the name of the VM peer you want to connect to.
cs: Zadejte jméno VM peeru, ke kterému se chcete připojit.
da: Angiv navnet på den VM-vært (VM-peer), du vil forbinde til.
fa: لطفا نام ماشین مجازی مربوط به این اتصال را وارد کنید.
ga: Iontráil ainm an chomhghleacaí VM ar mian leat ceangal leis.
gl: Introduza o nome do parceiro de VM ao que se quere conectar.
hi: कृपया उस वीएम पीयर का नाम प्रविष्ट करें जिससे आप संपर्क स्थापित करना चाहते हैं.
is: Settu inn heiti VM-jafningjans (VM peer) sem þú vilt tengjast.
kn: ದಯವಿಟ್ಟು ನೀವು ಕನೆಕ್ಟ್ ಆಗಬಯಸುವ ವಿ.ಎಂ ಪೀರ್ ನ ಹೆಸರನ್ನು ಎಂಟರ್ ಮಾಡಿ.
ku: Ji kerema xwe re navê VM peera ku dixwazî pê re girêdan çêkî têkevê.
lo: ກະລຸນາປ້ອນຊື່ຂອງ VM peer ທີ່ທ່ານຕ້ອງການເຊື່ອມຕໍ່ດ້ວຍ
mr: ज्याला जोडायचे आहे अशा व्हीएम् पीअरचे नाव द्या.
ro: Vă rugăm să introduceți numele perechii VM la care doriți să vă conectați.
ta: நீங்கள் தொடர்புகொள்ள விரும்பும் VM கூட்டாளியின் பெயரை உள்ளிடவும்.
te: అనుసంధానము కావలసిన VM peer పేరుని ప్రవేశపెట్టండి.
th: กรุณาป้อนชื่อของ VM peer ที่คุณต้องการเชื่อมต่อด้วย
ug: ئۇلانماق بولغان VM peer ئىسمىنى كىرگۈزۈڭ.

source: If you want to connect to multiple peers, separate the names by colons, e.g. tcpip:linux1.
cs: Jestli se chcete připojit k více peerům, oddělte jména dvojtečkami, např. tcpip:linux1.
da: Hvis du vil forbinde til flere værter, kan du adskille navnene med kolonner, som f.eks. tcpip:linux1.
fa: اگر می‌خواهید به چندین peer متصل شوید می‌توانید آن‌ها را با استفاده از کلون از یک دیگر جدا کنید. به عنوان مثال tcpip:linux1.
ga: Más mian leat ceangail a bhunú le comhghleacaithe éagsúla, dealaigh na hainmneacha le hidirstadanna, m.sh. tcpip:linux1.
gl: Se quere conectarse a varios parceiros, separe os nomes con signos de dous puntos; por exemplo, tcpip:linux1.
hi: यदि आप अनेक पीयर्स से संपर्क करना चाहते हैं तो उनके नामों को विसर्ग से पृथक करें, उदाहरणार्थ tcpip:linux1.
is: Ef þú vilt tengjast mörgum jafningjum, aðskildu þá heiti þeirra með tvípunktum, t.d. tcpip:linux1.
kn: ನೀವು ಅನೇಕ ಪೀರ್ ಗಳೊಂದಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಬೇಕೆನ್ದಿದ್ದರೆ, ಹೆಸರುಗಳನ್ನು ':' ಚಿನ್ಹೆಯಿಂದ ಪ್ರತ್ಯೇಕಿಸಿ, ಉದಾ. tcpip:linux1.
ku: Dema tu bixwazî bi gelek peer re girê bidî, nav navên wan duxal binivîse, wekî tcpip:linux1.
lo: ຖ້າທ່ານຕ້ອງການເຊື່ອມຕໍ່ໄປຍັງ peer ຫຼາຍ peer ໃຫ້ຄັ່ນຊື່ຕ່າງໆດ້ວຍທະວີພາກ ເຊັ່ນ tcpip:linux1
mr: तुम्हाला एकापेक्षा जास्त पीअर जोडायचे असल्यास, ती नावे विसर्ग चिन्हांनी विलग करा. उदा. tcpip:linux1
ro: Dacă doriți să vă conectați la mai multe perechi, separați-le numele cu doua puncte, ex.: tcpip:linux1.
ta: ஒன்றிற்கும் மேற்பட்ட கூட்டாளிகளுடன் இணைய விரும்பினால் பெயர்களை ':' கொண்டு பிரிக்கவும். உதா. tcpip:linux1.
te: బహుళ peersకు అనుసంధానము కావలసినపుడు, పేర్లను కాలన్ తో వేరు చేయండి. ఉదా: tcpip:linux1.
th: ถ้าคุณต้องการเชื่อมต่อไปยัง peer หลาย peer ให้คั่นชื่อต่างๆ ด้วยทวิภาค เช่น tcpip:linux1
ug: ئەگەر كۆپ peer غا باغلانسا، بۇ ئىسىملار قوش چېكىت بىلەن ئايرىلىدۇ، مەسىلەن: tcpip:linux1.

source: The standard TCP/IP server name on VM is TCPIP; on VIF it's $TCPIP. Note: IUCV must be enabled in the VM user directory for this driver to work and it must be set up on both ends of the communication.
cs: Standardní jméno TCP/IP serveru na VM je TCPIP, na VIF $TCPIP. Aby tento ovladač fungoval, musí být v uživatelském VM adresáři povolen IUCV a musí být nastaven na obou koncích komunikace.
da: Standardnavnet på en TCP/IP-server på VM er TCPIP, på VIF er det $TCPIP. Bemærk: IUCV skal være aktiveret i VM-brugermappen for at denne driver kan fungere og det skal sættes op i begge ender af kommunikationen.
fa: نام استاندارد برای سرور TCP/IP بر روی VMها TCPIP; و بر روی VIF ها $TCPIP می‌باشد. نکته: شما باید پوشه کاربر را برای کار کردن این قسمت بر روی VM فعال نمایید.
ga: Is é 'TCPIP' gnáthainm an fhreastalaí TCP/IP ar VM; is é $TCPIP ar VIF. Nóta: Caithfidh tú IUCV a chumasú sa chomhadlann úsáideora VM chun an tiománaí seo a úsáid, agus ní mór é a shocrú ag an dá cheann cumarsáide.
gl: O nome de servidor TCP/IP estándar de VM é TCPIP; en VIF é $TCPIP. Nota: IUCV ten que estar activado no directorio de usuario VM para que este controlador funcione, e debe estar configurado nos dous extremos da comunicación.
hi: वीएम पर टीसीपी/आईपी सर्वर का मानक नाम है TCPIP; वीआईएफ पर यह $TCPIP है. नोट: इस ड्राइवर के कार्य करने के लिए वीएम प्रयोक्ता डायरेक्ट्री में IUCV को सक्रिय होना चाहिए और इसे संचार के दोनों छोरों पर व्यवस्थित करना ही होगा.
is: Staðlað heiti á TCP/IP þjóni í VM er TCPIP; á VIF er það $TCPIP. Athugaðu: IUCV verður að vera virkjað í VM notandamöppunni svo að þessi rekill virki og það verður að vera sett upp á báðum endum sambandsins.
kn: ನ ಮೇಲೆ ಸ್ಟಾಂಡರ್ಡ್ TCP/IP ಸರ್ವರ್ ನ ಹೆಸರು TCPIP . VIF ನಲ್ಲಿ ಇದು $TCPIP . ಗಮನಿಸಿ: ಈ ಡ್ರೈವರ್ ಕಾರ್ಯನಿರ್ವಹಿಸಬೇಕಾದರೆ VM ಬಳಕೆದಾರ ಡೈರೆಕ್ಟರಿಯಲ್ಲಿ IUCV ಚಾಲೂ ಇರಬೇಕು ಹಾಗೂ ಅದು ಸಂಪರ್ಕದ ಎರಡೂ ಬದಿಯಲ್ಲಿ ಸೆಟ್ ಅಪ್ಆಗಿರಬೇಕು.
lo: ຊື່ເຊີບເວີ TCP/IP ມາດຕະຖານໃນ VM ຄື TCPIP ແລະ ໃນ VIF ຄື $TCPIP ຂໍ້ສັງເກດ: ຕ້ອງເປີດ IUCV ໃວ້ໃນໄດເຮດທໍລີ້ຂອງຜູ້ໃຊ້ ເພື່ອໃຫ້ໄດເວີນີ້ທຳງານໄດ້ ແລະ ຕ້ອງຄ່າໄວ້ທີ່ທັງສອງຝັ່ງຂອງການຊື່ສານນີ້
mr: VM वरील TCP/IP परिसेवकाचे प्रमाणित नाव TCPIP असते; तर VIF वर हेच नाव $TCPIP असते. सूचनाः या चालकाचे कार्य व्यवस्थित होण्यासाठी VM वापर निर्देशिकेत IUCV कार्यसक्षम केलेला असला पाहिजे आणि संदेशवहनाच्या दोन्ही टोकांना तो संरचित केलेला असला पाहिजे.
ro: Numele standard pentru server TCP/IP pe VM este TCPIP; pe VIF este $TCPIP. Notă: IUCV trebuie să fie activat în directorul VM al utilizatorului, pentru ca acest modul de nucleu să funcționeze și acesta trebuie să fie pregătit la ambele capete ale căii de comunicare.
ta: VM-ல் TCP/IP சேவையகனின் பெயர் பெரும்பாலும் TCPIP-யாக இருக்கும்; VIF-ல் அது $TCPIP. குறிப்பு: இந்த இயக்கி வேலை செய்ய VM பயனர் அடைவில் IUCV-க்கு அனுமதி அளிக்கப்பட்டிருக்க வேண்டும். மேலும் அது தொடர்பின் இரு பக்கங்களிலும் அமிக்கப்பட்டிருக்க வேண்டும்.
te: VM పై ప్రామాణిక TCP/IP సేవిక పేరుTCPIP; VIF పై $TCPIP. గమనిక: ఈ డ్రైవర్ పనిచేయుటకు VM user సంచయంలో, IUCV చేతనంచేయబడాలి. దానిని అనుసంధానము రెండు వైపుల సిద్ధం చేయబడాలి.
th: ชื่อเซิร์ฟเวอร์ TCP/IP มาตรฐานใน VM คือ TCPIP และใน VIF คือ $TCPIP ข้อสังเกต: ต้องเปิด IUCV ไว้ในไดเรกทอรีของผู้ใช้ เพื่อให้ไดรเวอร์นี้ทำงานได้ และต้องตั้งค่าไว้ที่ทั้งสองฝั่งของการสื่อสารนี้
ug: VM دىكى ئۆلچەملىك TCP/IP مۇلازىمېتىر ئاتى TCPIP؛ VIF دىكىسى $TCPIP؛ دىققەت: VM ئىشلەتكۈچى مۇندەرىجىسى چوقۇم IUCV نى قوزغىتىش ئارقىلىق بۇ قوزغاتقۇچنى خىزمەت قىلدۇرىدۇ ھەمدە ئالاقە قىلىدىغان ھەر ئىككى تەرەپتە تەڭشەش لازىم.

source: Configure the network device
cs: Nastavit síťové zařízení
da: Sæt netkortet op
fa: پیکربندی دستگاه شبکه
ga: Cumraigh an gléas líonra
gl: Configurar o dispositivo de rede
hi: नेटवर्क उपकरण कॉन्फ़िगर करें
is: Stilla netlægt tæki
kn: ನೆಟ್ವರ್ಕ್ ಡಿವೈಸುಗಳನ್ನು ಕಾನ್ಫಿಗರ್ ಮಾಡು.
ku: Cîhaza torê mîheng bike
lo: ຕັ້ງຄ່າອຸປະກອນເຄືອຂ່າຍ
mr: नेटवर्क उपकरणे संरचित करा
ro: Configurează dispozitivul de rețea
ta: வலையமைப்பு சாதனத்தை வடிவமை
te: నెట్వర్క్ డివైస్ అమరిక
th: ตั้งค่าอุปกรณ์เครือข่าย
ug: تور ئۈسكۈنە سەپلىمىسى

source: Available devices:
cs: Dostupná zařízení:
da: Tilgængelige enheder:
fa: دستگاه‌های موجود :
ga: Gléasanna le fáil:
gl: Discos dispoñíbeis:
hi: उपलब्ध उपकरण:
is: Tiltæk tæki:
kn: ಲಭ್ಯವಿರುವ ಡಿವೈಸುಗಳು :
ku: Cîhazên amade:
lo: ອຸປະກອນທີ່ມີ:
mr: उपलब्ध उपकरणे:
ro: Dispozitive disponibile:
ta: இருக்கும் சாதனங்கள்:
te: అందుబాటులో వున్న డివైస్లు:
th: อุปกรณ์ที่มี:
ug: ئىشلىتىلىشچان ئۈسكۈنە:

source: The following direct access storage devices (DASD) are available. Please select each device you want to use one at a time.
cs: K dispozici jsou následující DASD (Direct Access Storage Devices). Postupně vyberte všechna, která chcete použít.
da: Følgende lagerenheder med direkte adgang (DASD) er tilgængelige. Vælg de enheder, du vil benytte en ad gangen.
fa: لطفا هر یک از دستگاه‌های DASD موجود که می‌خواهید استفاده کنید را انتخاب نمایید.
ga: Tá na gléasanna stórála dír-rochtana (DASD) seo a leanas ar fáil. Roghnaigh na gléasanna is mian leat úsáid, ceann ar cheann.
gl: Os seguintes DASD (dispositivos de almacenaxe de acceso directo) están dispoñíbeis. Escolla os dispositivos que quere empregar de un en un.
hi: निम्न डिरेक्ट ऐक्सेस स्टोरेज डिवासेज़ (DASD) उपलब्ध हैं। वह प्रत्येक उपकरण एक बार में एक चुनें,जोकि आप प्रयोग करना चाहते हैं।
is: Eftirfarandi geymslumiðlar með beinum aðgangi (direct access storage device - DASD) eru tiltækir. Veldu hvert tæki sem þú vilt nota fyrir sig, eitt í einu.
kn: ಕೆಳಕಂಡ ನೇರ ಅಕ್ಸೆಸ್ ಸಂಗ್ರಹ ಮಾಧ್ಯಮ(ಡಿ.ಎ.ಎಸ್.ಡಿ )ಗಳು ಲಭ್ಯವಿರುತ್ತವೆ. ದಯವಿಟ್ಟು ನೀವು ಬಳಸಬಯಸುವ ಪ್ರತಿಯೊಂದು ದಿವೈಸ್ಸನ್ನು, ಒಂದೊಂದಾಗಿ ಆಯ್ಕೆ ಮಾಡಿ.
lo: direct access storage device (DASD) ຕໍ່ໄປນີ້ ສາມາດໃຊ້ງານໄດ້ ກະລຸນາເລືອກອຸປະກອນທີ່ທ່ານຕ້ອງການໃຊ້ເທື່ອໃຊ້ລະຂັ້ນ
mr: पुढील डायरेक्ट ऍक्सेस स्टोअरेज डिव्हाइसेस (DASA) उपलब्ध आहेत. कृपया तुम्ही वापरू इच्छित असलेल्या उपकरणांपैकी एकावेळी एकच उपकरण निवडा.
ro: Sunt disponibile următoarele dispozitive de stocare cu acces direct (DASD). Vă rugăm să alegeți pe rând fiecare dispozitiv pe care doriți să-l folosiți.
ta: பின்வரும் நேரடி அணுகல் சேமிப்பு சாதனங்கள் (டிஏஎஸ்டி (DASD)) உள்ளன. நீங்கள் பயன்படுத்த விரும்பும் ஒவ்வொரு சாதனத்தையும் ஒவ்வொன்றாக தேர்வு செய்யவும்.
te: అందుబాటులో వున్న డైరెక్టు యాక్సెస్ స్టోరేజ్ డివైస్ (DASD) క్రింద ఇవ్వబడినవి. మీరు వాడదలచుకున్న డివైస్ ని ఒక్కొక్కటిగా ఎంచుకో.
th: direct access storage device (DASD) ต่อไปนี้ สามารถใช้งานได้ กรุณาเลือกอุปกรณ์ที่คุณต้องการใช้ทีละชิ้น
ug: تۆۋەندىكى بىۋاسىتە زىيارەت قىلىدىغان ساقلىغۇچ ئۈسكۈنىسى (DASD)نى ئىشلەتكىلى بولىدۇ. ھەر قېتىمدا ئۇنىڭ ئىچىدىن بىرنى تاللاڭ.

source: Choose device:
cs: Vyberte zařízení:
da: Vælg enhed:
fa: دستگاه را انتخاب کنید :
ga: Roghnaigh gléas:
gl: Escolla un disco:
hi: उपकरण चुनें:
is: Veldu tæki:
kn: ದಿವೈಸನ್ನು ಆಯ್ಕೆ ಮಾಡಿ:
ku: Cîhazê hilbijêre:
lo: ເລືອກອຸປະກອນ:
mr: उपकरण निवडाः
ro: Alegeți dispozitivul:
ta: சாதனத்தை தேர்வு செய்க:
te: డివైస్ ఎంపిక:
th: เลือกอุปกรณ์:
ug: ئۈسكۈنە تاللاش:

source: Please choose a device. You have to specify the complete device number, including leading zeros.
cs: Vyberte prosím zařízení. Musíte zadat celé číslo zařízení včetně úvodních nul.
da: Vælg en enhed. Du skal angive det komplette enhedsnummer inklusive foranstillede nuller.
fa: لطفا دستگاه مورد نظر خود را انتخاب نمایید. شما باید شماره دستگاه را به صورت کامل مشخص کنید.
ga: Roghnaigh gléas, le do thoil. Caithfidh tú an uimhir iomlán ghléis a thabhairt, nialais chun tosaigh san áireamh.
gl: Escolla un disco. Ten que especificar o número de dispositivo completo, incluíndo os ceros á esquerda.
hi: कृपया एक उपकरण चुनें. आपको अंक के प्रारंभ के शून्यों के साथ संपूर्ण उपकरण क्रमांक लिखना है.
is: Veldu tæki. Þú verður að gefa upp allt tækisnúmerið, einnig þau núll sem eru á undan.
kn: ದಯವಿಟ್ಟು ಒಂದು ದಿವೈಸನ್ನು ಆಯ್ಕೆ ಮಾಡಿ. ಪರಿಪೂರ್ಣ ಡಿವೈಸ್ ಸಂಖ್ಯೆಯನ್ನು ನಮೂದಿಸಿ.ಮುಂದಿರುವ ಸೊನ್ನೆಗಳನ್ನೂ ಸೇರಿಸಿ
lo: ກະລຸນາເລືອກອຸປະກອນ ທ່ານຕ້ອງລະບຸໝາຍເລກອຸປະກອນເຕັມ ລວມທັງເລກສູນທີ່ນຳໜ້າດ້ວຍ
mr: कृपया एक उपकरण निवडा. आरंभीच्या शुन्यांसहित संपूर्ण उपकरण क्रमांक देणे आवश्यक आहे.
ro: Vă rugăm să alegeți un dispozitiv. Trebuie să specificați numărul complet de dispozitiv, inclusiv zerourile de la început.
ta: சாதனத்தை தேர்வு செய்யவும். முன்வரும் பூஜ்ஜியங்களையும் கொண்ட முழு சாதன எண்ணை கொடுக்கவும்.
te: డివైస్ ఎంచుకోండి. పూర్తి డివైస్ సంఖ్య మొదల వ చ్చే సున్నాలతో సహా ప్రవేశపెట్టాలి.
th: กรุณาเลือกอุปกรณ์ คุณต้องระบุหมายเลขอุปกรณ์เต็ม รวมทั้งเลขศูนย์ที่นำหน้าด้วย
ug: ئۈسكۈنىدىن بىرنى تاللاڭ. سىز تولۇق ئۈسكۈنە نومۇرىنى بەلگىلىشىڭىز لازىم، ئالدىغا كېلىدىغان نۆلنىمۇ ئۆز ئىچىگە ئالىدۇ.

source: Invalid device
cs: Neplatné zařízení
da: Ugyldig enhed
fa: دستگاه نامعتبر
ga: Gléas neamhbhailí
gl: Dispositivo non válido
hi: अवैध उपकरण
is: Ógilt tæki
kn: ಅಮಾನ್ಯವಾದ ಡಿವೈಸ್
ku: Cîhaza nederbasdar
lo: ອຸປະກອນບໍ່ຖືກຕ້ອງ
mr: अवैध उपकरण
ro: Dispozitiv invalid
ta: செல்லுபடியாகாத சாதனம்
te: తప్పుడు డివైస్
th: อุปกรณ์ไม่ถูกต้อง
ug: ئىناۋەتسىز ئۈسكۈنە

source: An invalid device number has been chosen.
cs: Bylo vybráno chybné číslo zařízení.
da: Der blev valgt et ugyldigt enhedsnummer.
fa: شماره دستگاه انتخاب شده نامعتبر است.
ga: Roghnaíodh uimhir neamhbhailí ghléis.
gl: Escolleuse un número de dispositivo non válido.
hi: कोई अवैध डिवाइस क्रमांक चुना गया है.
is: Ógilt tækisnúmer var valið.
kn: ಒಂದು ಅಮಾನ್ಯವಾದ ಡಿವೈಸ್ ಸಂಖ್ಯೆಯನ್ನು ಆಯ್ಕೆ ಮಾಡಲಾಗಿದೆ.
ku: Hejmarê amûreke nederbasdar hat hilbijartin.
lo: ທ່ານໄດ້ເລືອກໝາຍເລກອຸປະກອນທີ່ບໍ່ຖືກຕ້ອງ
mr: अवैध उपकरण क्रमांक निवडला आहे.
ro: S-a ales un număr de dispozitiv invalid.
ta: செல்லுபடியாகாத சாதன எண் தேர்வு செய்யப்பட்டுள்ளது.
te: సరికాని డివైస్ సంఖ్య ఎంచుకోబడినది.
th: คุณได้เลือกหมายเลขอุปกรณ์ที่ไม่ถูกต้อง
ug: ئىناۋەتسىز ئۈسكۈنە نومۇرى تاللاندى.

source: Format the device?
cs: Formátovat zařízení?
da: Formatér enheden?
fa: قالب بندی این دستگاه؟
ga: Formáidigh an gléas?
gl: Desexa formatar o disco?
hi: उपकरण को फ़ॉर्मेट करें?
is: Forsníða tækið?
kn: ಡಿವೈಸ್ ಅನ್ನು ಫಾರ್ಮ್ಯಾಟ್ ಮಾಡಬಹುದೇ?
ku: Cîhaz bila were formatkirin?
lo: ຈະຟໍແມັດອຸປະກອນ ຫຼື ບໍ?
mr: उपकरणाचे संरुपण करावयाचे का?
ro: Formatați dispozitivul?
ta: சாதனத்தை ஒழுங்குபடுத்தவா?
te: డివైస్ ని ఫార్మాట్ చేయాలా?
th: จะฟอร์แมตอุปกรณ์หรือไม่?
ug: ئۈسكۈنە فورماتلامدۇ؟

source: The installer is unable to detect if the device ${device} has already been formatted or not. Devices need to be formatted before you can create partitions.
cs: Instalační program neumí rozpoznat, zda již zařízení ${device} bylo zformátováno, nebo ne. Před vytvořením oblastí musíte zařízení zformátovat.
da: Installationsprogrammet kan ikke afgøre, om enheden ${device} allerede er blevet formateret eller ej. Enheder skal formateres, før du kan oprette partitioner.
fa: نصاب قادر به تشخیص اگر دستگاه ${device} نمی‌باشد. از فرمت شده بودن دستگاه اطمینان حاصل نمایید. شما باید بعد از پارتیشن بندی باید دستگاه‌ها را فرمت کنید.
ga: Ní féidir leis an suiteálaí déanamh amach an raibh gléas ${device} formáidithe nó nach raibh. Caithfidh tú gléas a fhormáidiú sular féidir deighiltí a chruthú air.
gl: O instalador non pode detectar se o dispositivo ${device} xa está formatado ou non. Os discos teñen que estar formatados para poder crear particións.
hi: संस्थापक यह ज्ञात करने में असफल रहा कि उपकरण ${device} पहले से ही फॉर्मेट है या नहीं.पार्टिशन बनाने से पहले उपकरणों को फॉर्मेट करना आवश्यक है.
is: Uppsetningarforritið getur ekki séð hvort tækið ${device} hafi þegar verið forsniðið. Tæki á borð við geymslumiðla verða að vera forsniðin áður en hægt er að búa til disksneiðar á þeim.
kn: ಡಿವೈಸ್ ${device} ಈಗಾಗಲೇ ಫಾರ್ಮ್ಯಾಟ್ ಆಗಿದೆಯೇ ಎಂದು ಕಂಡು ಹಿಡಿಯಲು ಫಾರ್ಮ್ಯಾಟರ್ ಗೆ ಸಾಧ್ಯವಾಗುತ್ತಿಲ್ಲ ನೀವು ವಿಭಜನೆ ಮಾಡುವ ಮೊದಲು, ಡಿಸ್ಕ್ ಫಾರ್ಮ್ಯಾಟ್ ಆಗಿರಬೇಕು.
lo: ໂປຼແກມຕິດຕັ້ງບໍ່ສາມາດກວດສອບອຸປະກອນ ${device} ໄດ້ ວ່າໄດ້ຟໍແມັດໃວ້ແລ້ວ ຫຼື ຍັງ ທ່ານຕ້ອງຟໍແມັດອຸປະກອນເສຍກ່ອນ ກ່ອນທີ່ຈະສາມາດສ້າງພາທິຊັ້ນໄດ້
mr: उपकरण ${device} आधीच संरुपित केले गेले आहे की नाही, हे या अधिष्ठापकाला समजून येत नाही. विभाजने निर्माण करता येण्यापूर्वी उपकरणे संरुपित करणे गरजेचे आहे.
ro: Programul de instalare nu poate să detecteze dacă dispozitivul ${device} a fost sau nu deja formatat. Dispozitivele trebuie să fie formatate înainte să puteți crea partiții.
ta: ${device} சாதனம் ஏற்கெனெவே ஒழுங்கு படுத்தப்பட்டு விட்டதா என்று நிறுவியால் கண்டு பிடிக்க முடியவில்லை. இத்தகைய வட்டுகள் பகிர்வு செய்வதற்கு முன் ஒழுங்குபடுத்த வேண்டும்.
te: స్థాపన వ్యవస్థ (ఇన్స్టాలర్), ${device} డివైస్ ఇప్పటికే ఫార్మాట్ చేయబడినదా లేదా అని కనుగొనలేకపోయింది. విభజనలు సృష్టించుటకు ముందు, డివైస్లు ఇప్పటికే ఫార్మాట్ చేయబడివుండాలి.
th: โปรแกรมติดตั้งไม่สามารถตรวจสอบอุปกรณ์ ${device} ได้ ว่าได้ฟอร์แมตไว้แล้วหรือยัง คุณต้องฟอร์แมตอุปกรณ์เสียก่อน ก่อนที่จะสามารถสร้างพาร์ทิชันได้
ug: ئورناتقۇچ ${device} ئۈسكۈنىنىڭ فورماتلانغان ياكى فورماتلانمىغانلىقىنى بايقىيالمىدى. ئۈسكۈنىدە رايون قۇرغاندا ئالدى بىلەن ئۇنى فورماتلاش لازىم.

source: If you are sure the device has already been correctly formatted, you don't need to do so again.
cs: Pokud jste si jisti, že již bylo zařízení zformátováno, nemusíte jej formátovat znovu.
da: Hvis du er sikker på, at enheden allerede er blevet formateret korrekt, behøver du ikke at gøre det igen.
fa: اگر شما از فرمت شدن دستگاه خود اطمینان دارید احتیاج به تکرار این کار ندارید.
ga: Má tá tú cinnte go raibh an gléas formáidithe i gceart cheana, ní gá é a dhéanamh arís.
gl: Se está seguro de que o disco xa está formatado correctamente, non precisa de facelo outra vez.
hi: यदि आपने सुनिश्चित कर लिया है कि उपकरण पहले ही ठीक प्रकार से फॉर्मेट की हुई है, तो आपकोदोबारा ऐसा करने की आवश्यकता नहीं है.
is: Ef þú ert viss um að tækið hafi þegar verið rétt forsniðið, þá þarftu ekki að gera slíkt aftur.
kn: ಡಿವೈಸ್ ಈಗಾಗಲೇ ಸರಿಯಾಗಿ ಫಾರ್ಮ್ಯಾಟ್ ಆಗಿದೆ ಎಂಬ ವಿಶ್ವಾಸವಿದ್ದರೆ, ನೀವು ಮತ್ತೆ ಅದನ್ನು ಫಾರ್ಮ್ಯಾಟ್ ಮಾಡುವ ಅಗತ್ಯವಿಲ್ಲ.
lo: ຖ້າທ່ານແນ່ໃຈວ່າໄດ້ຟໍແມັດອຸປະກອນໃວ້ຢ່າງຖືກຕ້ອງຮຽບຮ້ອຍແລ້ວ ກໍ່ບໍ່ຈຳເປັນຕ້ອງຟໍແມັດຊ້ຳອີກ
mr: हे उपकरण आधीच योग्य रीतीने संरुपित केले गेले असल्याची तुमची खात्री असेल तर ते पुन्हा करण्याची गरज नाही.
ro: Dacă sunteți sigur(ă) că dispozitivul a fost deja formatat, nu trebuie să repetați operația.
ta: நீங்கள் உங்கள் சாதனம் சரியாக ஏற்கெனெவே ஒழுங்கு படுத்தப்பட்டு விட்டது என்று உறுதியாக இருப்பின் அதை மீண்டும் செய்ய வேண்டியதில்லை.
te: డివైస్ ఇప్పటికే ఫార్మాట్ చేయబడిందని మీరు నిర్థారించితే మరల చేయవలసినఅవసరంలేదు.
th: ถ้าคุณแน่ใจว่าได้ฟอร์แมตอุปกรณ์ไว้อย่างถูกต้องเรียบร้อยแล้ว ก็ไม่จำเป็นต้องฟอร์แมตซ้ำอีก
ug: ئەگەر ئۈسكۈنىنىڭ توغرا فورماتلانغانلىقىنى جەزملىسىڭىز ئۇنداقتا قايتىدىن تەكرار فورماتلاش ھاجەتسىز.

source: Formatting ${device}...
cs: Formátuje se ${device}...
da: Formaterer ${device}...
fa: قالب بندی ${device}...
ga: ${device} á fhormáidiú...
gl: Estase a formatar ${device}...
hi: ${device} को फॉर्मेट किया जा रहा है...
is: Forsníð ${device}...
kn: ${device} ಅನ್ನು ಫಾರ್ಮ್ಯಾಟ್ ಮಾಡಲಾಗುತ್ತಿದೆ...
ku: ${device} tê formatkirin...
lo: ກຳລັງຟໍແມັດ ${device}...
mr: ${device} चे संरुपण होत आहे...
ro: Se formatează ${device}...
ta: ${device} ஒழுங்குபடுத்தப்படுகிறது...
te: ${device} ఫార్మాట్ చేస్తున్నా...
th: กำลังฟอร์แมต ${device}...
ug: ${device} نى فورماتلاۋاتىدۇ…

source: Configure direct access storage devices (DASD)
cs: Nastavit DASD (Direct Access Storage Devices)
da: Sæt lagerenheder med direkte adgang (DASD) op
fa: پیکربندی دسترسی مستقیم دستگاه‌های ذخیره سازی (DASD)
ga: Cumraigh gléasanna stórála dír-rochtana (DASD)
gl: Configurar dispositivos de almacenaxe de acceso directo (DASD)
hi: डिरेक्ट एक्सेस स्टोरेज डिवाइसेज़ व्यवस्थित करें (डीएएसडी)
is: Stilla geymslumiðla með beinum aðgangi (direct access storage device - DASD)
kn: ನೇರ ಅಕ್ಸೆಸ್ ಸಂಗ್ರಹ ಮಾಧ್ಯಮವನ್ನು ಕಾನ್ಫಿಗರ್ ಮಾಡು
ku: Cîhazên tomarkirinê yên gihîştina rasterast (direct access storage devices an DASD) mîheng bike
lo: ຕັ້ງຄ່າ direct access storage device (DASD)
mr: डायरेक्ट ऍक्सेस स्टोअरेज डिव्हाइसेस् (DASD) संरचित करा
ro: Configurează dispozitivele DASD
ta: நேரடி அணுகல் சேமிப்பு சாதனங்களை (டிஏஎஸ்டி (DASD)) வடிவமை
te: డైరెక్టు యాక్సెస్ స్టోరేజ్ డివైస్ల (DASD) అమరిక
th: ตั้งค่า direct access storage device (DASD)
ug: بىۋاسىتە زىيارەت قىلىدىغان ساقلاش ئۈسكۈنە سەپلىمىسى (DASD)

source: Install the ZIPL boot loader on a hard disk
cs: Instalovat zavaděč ZIPL na pevný disk
da: Installér opstartsindlæseren ZIPL på en harddisk
fa: نصب راه انداز ZIPL بر روی دیسک سخت
ga: Suiteáil luchtóir tosaithe ZIPL ar dhiosca crua
gl: Instalar o cargador de inicio ZIPL nun disco duro
hi: ZIPL बूटलोडर हार्ड डिस्क पर संस्थापित करें
is: Setja ZIPL ræsistjórann upp á harðan disk
kn: ZIPL ಬೂಟ್ ಲೋಡರನ್ನು ಹಾರ್ಡ್ ಡಿಸ್ಕೊಂದಕ್ಕೆ ಇನ್ಸ್ಟಾಲ್ ಮಾಡು
ku: boot loader LILO di hard dîskekê de saz bike
lo: ຕິດຕັງບູດໂຫຼດເດີ ZIPL ລົງໃນຮາດດິດສ໌
mr: झेड आय् पी एल् आरंभ सूचक हार्डडीस्कवर अधिष्ठापित करा
ro: Instalează încărcătorul de sistem ZIPL pe un disc fix
ta: ZIPL துவக்கியை ஒரு வன்தட்டில் நிறுவுக.
te: ZIPL బూట్ లోడర్ ని హార్డ్ డిస్క్ పై స్థాపించు
th: ติดตั้งบูตโหลดเดอร์ ZIPL ลงในฮาร์ดดิสก์
ug: ZIPL قوزغىتىش يېتەكلىگۈچنى قاتتىق دىسكىغا ئورنات
