Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel5/*.po
Languages: cs, da, fa, ga, gl, hi, is, kn, ku, lo, mr, ro, ta, te, th, ug

source: When a partition is mounted, it is available to the users of the system. You always need a root ("/") partition, and it's often good to have a separate partition for /home.
cs: Když je oblast připojená, je dostupná uživatelům systému. Musíte mít minimálně kořenovou („/“) oblast, ale obvykle je lepší mít více oblastí (například pro /home).
da: Når en partition er monteret, er den tilgængelig for brugerne på systemet. Du skal altid have en rodpartition ("/"), og det er ofte en god idé at have en separat partition til /home.
fa: زمانی که یک پارتیشن بارگذاری می‌شود، برای تمامی کاربران سیستم قابل استفاده می‌باشد. شما همیشه به پارتیشن ریشه («/») نیاز دارید، و بهتر است که پارتیشن /home را از این پارتیشن جدا کنید.
ga: Nuair atá deighilt feistithe, tá sé ar fáil d'úsáideoirí an chórais. Tá fréamhdheighilt ("/") de dhíth ort i gcónaí, agus go minic is rud maith é /home a bheith ar dheighilt ar leith.
gl: Ao montar unha partición, ponse a disposición dos usuarios do sistema. Sempre necesita dunha partición raíz («/») e adoita ser bon ter unha partición separada para /home.
hi: जब कभी कोई पार्टिशन माउंट किया जाता है, वह तंत्र के उपयोक्ताओं को उपलब्ध ह जाोता है. आपोे सदैव ही एक रूट ("/") पार्टिशन चाहिए होता है, और अधिांशतःर /home के लिए एक अलग पार्टिशन अच्छा रहता है.
is: Þegar sneið er tengd við skráarkerfið verður hún tiltæk fyrir notendur kerfisins. Þú þarft alltaf að vera með rótarsneið („/‟) og of er betra að vera með sérstaka sneið fyrir heimasvæðið („/home‟) .
kn: ಒಂದು ವಿಭಜನೆಯನ್ನು ಮೌಂಟ್ ಮಾಡಿದಾಗ ಅದು ವ್ಯವಸ್ಥೆಯ ಬಳಕೆದಾರರಿಗೆ ಲಭ್ಯವಿರುತ್ತದೆ. ನಿಮಗೆ ಒಂದು ರೂಟ್ ("/") ವಿಭಜನೆಯು ಸದಾ ಅಗತ್ಯವಿರುತ್ತದೆ ಹಾಗೂ /home ಗಾಗಿ ಒಂದು ಪ್ರತ್ಯೇಕ ವಿಭಜನೆಯನ್ನು ಹೊಂದುವುದು ಒಳ್ಳೆಯದು.
ku: Heke partîsiyonek hat mount kirin, ji bo bikarhênerên pergalê amade ye. Partîsiyoneke root ("/") her dem pêwîst e, û hebûna partîsiyoneke /home ye cuda jî baş e.
lo: ເມື່ອເມົ້າທ໌ພາທີຊັ້ນແລ້ວ ພາທີຊັ້ນນັ້ນກໍ່ຈະສາມາດເລີ່ມໃຊ້ງານໄດ້ ທ່ານຕ້ອງມີພາທີຊັ້ນພື້ນຖານ ("/") ສະເໝີ ແລະ ໂດຍປົກະຕິແລ້ວ ການມີພາທີຊັ້ນແຍກຕ່າງຫາກ /home ກໍ່ເປັນຄວາມຄິດທີ່ດີ
mr: जेव्हा विभाजन आरोहित होते, तेंव्हा ते त्या प्रणालीच्या वापरकर्त्यांसाठी उपलब्ध होते. आपल्याला एक मूल ("/") विभाजन नेहमीच आवश्यक असते आणि /home साठी स्वतंत्र विभाजन असणे कधीही चांगले असते.
ro: Când o partiție este montată, este disponibilă utilizatorilor sistemului. Întotdeauna aveți nevoie de partiție rădăcină („/”), și adesea e bine să aveți o partiție separată pentru /home.
ta: ஒரு பகிர்வு ஏற்றப் பட்டதும் அது கணினி பயனருக்கு கிடைக்கிறது. நமக்கு எப்போதும் ஒரு மூல பகிர்வு ("/") தேவை. இல்ல பகிர்வாக /home தனியாக இருப்பது நல்லது.
te: విభజన అనుసంధానమైనపుడు, అది అన్ని వాడుకరులకు అందుబాటులో వుంటుంది. రూట్ ("/") విభజన తప్పనిసరిగా కావాలి మరియు /home కు ప్రత్యేక విభజన వాడటం మంచిది.
th: เมื่อเมานท์พาร์ทิชันแล้ว พาร์ทิชันนั้นก็จะสามารถเริ่มใช้งานได้ คุณต้องมีพาร์ทิชันราก ("/") เสมอ และโดยปกติแล้ว การมีพาร์ทิชันแยกต่างหากสำหรับ /home ก็เป็นความคิดที่ดี
ug: دىسكا رايونى ئېگەرلەنگەندىن كىيىن، سىستېمىدىكى ئىشلەتكۈچىلەرنىڭ ھەممىسى ئىشلىتەلەيدۇ. سىز root دىسكا رايونى("/") غا ئېھتىياجلىق. /home ئۈچۈن ئايرىم دىسكا رايونى بۆلسىڭىز تېخىمۇ ياخشى.

source: Please enter where the partition should be mounted.
cs: Zadejte, prosím, kam se má oblast připojit.
da: Angiv hvor partitionen skal monteres.
fa: لطفا مسیری را که باید پارتیشن بارگذاری شود را وارد کنید.
ga: Iontráil an áit ar mhaith leat an deighilt a fheistiú.
gl: Indique onde se debería montar a partición.
hi: कृपया लिखें कि पार्टिशन को कहाँ माउंट करना है.
is: Vinsamlegast sláðu inn hvar sneiðin ætti að tengjast skráarkerfinu.
kn: ದಯವಿಟ್ಟು ಎಲ್ಲಿ ವಿಭಜನೆಯನ್ನು ಮೌಂಟ್ ಮಾಡಬೇಕೆಂಬುದನ್ನು ಎಂಟರ್ ಮಾಡಿರಿ.
ku: Ji kerema xwe re cihê mountkirina partîsiyonê binivîse.
lo: ກະລຸນາປ້ອນຕຳແໜ່ງທີ່ພາທີຊັ້ນນີ້ຄວນຈະເມົ້າທ໌
mr: विभाजनाचे आरोहण कोठे करावयाचे ते निश्चित करा.
ro: Vă rugăm să introduceți locul în care ar trebui montată partiția.
ta: எந்த இடத்தில் பகிர்வை ஏற்ற வேண்டும் என உள்ளிடவும்.
te: విభజన ని అనుసంధానము చేయవలసిన దారిని ప్రవేశపెట్టండి.
th: กรุณาป้อนตำแหน่งที่พาร์ทิชันนี้ควรจะเมานท์
ug: دىسكا رايونى ئېگەرلەيدىغان جاينى بەلگىلەڭ.

source: Do you want to unmount the partitions so you can make changes?
cs: Chcete odpojit oblasti, abyste mohli provést změny?
da: Ønsker du at afmontere partitionerne, så du kan udføre ændringer?
fa: آیا می‌خواهید پارتیشن‌ها بارگذاری نشوند، بنابراین شما می‌توانید تغییرات را اعمال کنید؟
ga: An bhfuil fonn ort na deighiltí a dhífheistiú sa chaoi gurbh fhéidir leat athruithe a dhéanamh?
gl: Desexa desmontar as particións para poder modificalas?
hi: क्या आप विभाजनों को अनमाउंट करना चाहते हैं ताकि आप कुछ परिवर्तन कर सकें?
is: Viltu aftengja sneiðina svo þú getir gert breytingar?
kn: ನೀವು ಬದಲಾವಣೆ ಮಾಡುವ ಉದ್ದೇಶದಿಂದ ವಿಭಜನೆಗಳನ್ನು ಅನ್ಮೌಂಟ್ ಮಾಡಬಯಸುತ್ತೀರಾ?
ku: Tû dixwazî partîsiyonan unmount bikî daku bikarî guherandinan çêkî?
lo: ທ່ານຕ້ອງການຍົກເລີກເມົ້າທ໌ພາທີຊັ້ນ ເພື່ອທີ່ຈະໄດ້ປ່ຽນແປງໄດ້ ຫຼື ບໍ?
mr: बदल करणे शक्य होण्यासाठी तुम्हाला ही विभाजने अनारोहित करण्याची इच्छा आहे का?
ro: Doriți sa demontați partițiile pentru a face schimbările?
ta: மாறுதல்கள் செய்வதற்காக பகிர்வுகளை இறக்க வேண்டுமா?
te: మార్పులు చేయటానికి వీలుగా, విభజనల అనుసంధానాలను తొలగించుదామనుకుంటున్నారా?
th: คุณต้องการเลิกเมานท์พาร์ทิชัน เพื่อที่จะได้เปลี่ยนแปลงได้หรือไม่?
ug: ئۆزگەرتىش كىرگۈزۈش ئۈچۈن دىسكا رايونىنى ئېگەرسىزلەمسىز؟

source: Since the partitions have already been mounted, you cannot do any changes.
cs: Protože oblasti již byly připojeny, nemůžete dělat žádné změny.
da: Da partitionerne allerede er monterede, kan du ikke udføre nogen ændringer.
fa: از آنجایی که پارتیشن‌های از قبل نصب شده است ، شما نمی‌توانید هیچ تغییری در آنها ایجاد نمایید.
ga: Ní féidir leat aon rud a athrú toisc go bhfuil na deighiltí feistithe cheana.
gl: Xa que as particións están montadas, non se poden facer modificacións.
hi: चूँकि विभाजनों को को पहले ही माउंट किया जा चुका है, आप कोई परिवर्तन नहीं कर सकते हैं.
is: Þar sem sneiðin hefur þegar verið tengd geturðu ekki breytt neinu.
kn: ವಿಭಜನೆಗಳು ಈಗಾಗಲೇ ಮೌಂಟ್ ಆಗಿರುವುದರಿಂದ, ಈಗ ನೀವು ಯಾವುದೇ ಬದಲಾವಣೆಗಳನ್ನು ಮಾಡಲು ಸಾಧ್ಯವಿಲ್ಲ.
ku: partîsiyon hat mount kirin, ji ber vê tû nikarî biguherînî.
lo: ເນື່ອງຈາກພາທີຊັ້ນເຫຼົ່ານີ້ຖືກເມົ້າທ໌ໃວ້ແລ້ວ ທ່ານຈຶ່ງຍັງປ່ຽນແປງຫັຍງບໍ່ໄດ້
mr: ही विभाजने आधीच आरोहित झाली असल्याने आता कोणतेही बदल करता येणार नाहीत.
ro: Din moment ce partițiile au fost deja montate, nu puteți efectua schimbări.
ta: பகிர்வுகள் ஏற்கெனவே ஏற்றப்பட்டு இருப்பதால் நீங்கள் மாறுதல்களை செய்ய இயலாது.
te: విభజనల అనుసంధానమైనవి కనుక మార్పులు చేయటం వీలు కాదు.
th: เนื่องจากพาร์ทิชันเหล่านี้ถูกเมานท์ไว้แล้ว คุณจึงยังเปลี่ยนแปลงอะไรไม่ได้
ug: دىسكا رايونلىرى ئېگەرلىنىپ بولدى. ئەمدى ئۆزگەرتەلمەيسىز.

source: Failed to unmount partitions
cs: Selhalo odpojování oblastí
da: Kunne ikke afmontere partitionerne
fa: خارج کردن این پارتیشن از دسترسی شکست خورد.
ga: Níorbh fhéidir na deighiltí a dhífheistiú
gl: Non foi posíbel desmontar as particións
hi: विभाजनों को अनमाउंट करने में असफल
is: Gat ekki aftengt disksneiðar
kn: ವಿಭಜನೆಗಳನ್ನು ಅನ್ಮೌಂಟ್ ಮಾಡುವಲ್ಲಿ ವಿಫಲವಾಗಿದೆ.
ku: Unmountkirina partîsiyonan bi ser neket
lo: ຍົກເລີກເມົ້າທ໌ພາທີຊັ້ນບໍ່ສຳເລັດ
mr: विभाजने अनारोहित करणे असफल
ro: Eșec la demontarea partițiilor
ta: பகிர்வுகளை இறக்குவது தோல்வியுற்றது
te: విభజన అనుసంధానం తొలగించటంలో విఫలం
th: เลิกเมานท์พาร์ทิชันไม่สำเร็จ
ug: رايوننى ئېگەرسىزلەش مەغلۇپ بولدى

source: An unexpected error occurred while unmounting the partitions.
cs: Během odpojování oblastí se vyskytla neočekávaná chyba.
da: Der opstod en uventet fejl under afmonteringen af partitionerne.
fa: هنگام خارج کردن پارتیشن از دسترسی خطای غیر منتظره ای رخ داده است.
ga: Tharla earráid gan súil léi agus na deighiltí á ndífheistiú.
gl: Aconteceu un erro inesperado ao desmontar as particións.
hi: विभाजनों को अनमाउंट कर्यवस्थित करते समय अनपेक्षितत्रुटि हुई।
is: Villa kom upp við að aftengja disksneiðarnar.
kn: ವಿಭಜನೆಗಳನ್ನು ಅನ್ಮೌಂಟ್ ಮಾಡುವಾಗ ಒಂದು ಅನಿರೀಕ್ಷಿತ ದೋಷ ಸಂಭವಿಸಿದೆ.
ku: Di sazkirina volumên şîfrekirî de çewtiyek derket holê.
lo: ເກີດຂໍ້ຜິດພາດຂະນະຍົກເລີກເມົ້າທ໌ພາທີຊັ້ນ
mr: विभाजने अनारोहित करताना अनपेक्षित त्रूटी निर्माण झाली.
ro: A apărut o eroare neașteptată în timpul demontării partițiilor.
ta: பகிர்வுகளை கீழிறக்கும் போது அமைக்கும்போது எதிர்பாராத பிழை ஏற்பட்டது.
te: విభజనల అనుసంధానం తొలగించేటప్పుడు అనుకోని దోషం ఎదురైంది
th: เกิดข้อผิดพลาดขณะเลิกเมานท์พาร์ทิชัน
ug: دىسكا رايونىنى ئېگەرسىزلەۋاتقاندا كۈتۈلمىگەن خاتالىق يۈز بەردى.

source: The partition configuration process has been aborted.
cs: Nastavování oblasti bylo přerušeno.
da: Partitioneringen blev afbrudt.
fa: فرایند پیکربندی پارتیشن خاتمه یافت.
ga: Rinneadh tobscor ar phróiseas cumraíochta na ndeighiltí.
gl: Abortouse o proceso de configuración das particións.
hi: पार्टिशन के व्यवस्थापन की प्रक्रिया छोड़ी गई।
is: Stillingarferli fyrir disksneið hefur verið hætt.
kn: ವಿಭಜನಾ ಕಾನ್ಫಿಗರೆಶನ್ ಪ್ರಕ್ರಿಯೆಯು ಸ್ಥಗಿಥಗೊಳಿಸಲ್ಪಟ್ಟಿದೆ.
ku: Pêvajoya mîhenkirina partîsyonkirinê hat betalkirin.
lo: ຈະຍົກເລີກຂະບວນການຕັ້ງຄ່າພາທີຊັ້ນ
mr: विभाजन संरचना प्रक्रिया मधेच सोडून देण्यात आली आहे.
ro: Procesul de configurare a schemei de partiționare fost abandonat.
ta: பகிர்வு வடிவமைப்பு கைவிடப்பட்டது.
te: విభజన అమరిక పద్ధతి రద్దుచేయబడినది.
th: จะยกเลิกกระบวนการตั้งค่าพาร์ทิชัน
ug: دىسكا رايونى سەپلەش ئەمەلدىن قالدۇرۇلدى.

source: Create %s file system
cs: Vytvořit souborový systém %s
da: Opret %s-filsystem
fa: ایجاد %s فایل سیستم.
ga: Cruthaigh córas comhad %s
gl: Crear un sistema de ficheiros %s
hi: फ़ाइल सिस्टम %s बनाएँ
is: Búa til %s skráakerfi
kn: %s ಕಡತ ವ್ಯವಸ್ಥೆಯನ್ನು ನಿರ್ಮಿಸು.
ku: Pergala dosyian %s biafirîne
lo: ສ້າງລະບົບແຟ້ມ %s
mr: %s फाईल प्रणाली बनवा
ro: Creează sistem de fișiere %s
ta: %s கோப்பு அமைப்பை உருவாக்குக
te: %s ఫైల్ వ్యవస్థ సృష్టించు
th: สร้างระบบแฟ้ม %s
ug: %s ھۆججەت سىستېما قۇرۇش

source: No root partition (/)
cs: Nemáte kořenovou oblast (/)
da: Ingen rodpartition (/)
fa: پارتیشن ریشه (/) وجود ندارد.
ga: Gan fréamhdheighilt (/)
gl: Non hai unha partición raíz (/)
hi: कोई रूट पार्टीशन (/) नहीं
is: Engin rótarsneið (/)
kn: ರೂಟ್ ವಿಭಜನೆ (/) ಇಲ್ಲ
ku: partîsiyona root (/) tune
lo: ບໍ່ມີພາທີຊັ້ນພື້ນຖານ (/)
mr: कोणतेही मूल (/) विभाजन नाही
ro: Nu există partiție rădăcină (/)
ta: மூலப் பகிர்வு ((/)) ஏதும் இல்லை
te: రూట్ విభజన (/)లేదు
th: ไม่มีพาร์ทิชันราก (/)
ug: root رايونى يوق (/)

source: You need a root partition. Please assign a partition to the root mount point before continuing.
cs: Kořenovou oblast musí mít každý systém. Před pokračováním ke kořenovému přípojnému bodu přiřaďte oblast.
da: Du skal have en rodpartition. Udpeg en partition til at være monteringspunkt for roden, før du fortsætter.
fa: شما به یک پارتیشن ریشه نیاز دارید. لطفا قبل از ادامه پارتیشن ریشه را برای بارگزاری تعیین نمایید.
ga: Tá fréamhdheighilt de dhíth ort. Sann deighilt don phríomhphointe feistithe sula rachaidh tú ar aghaidh.
gl: Precisa dunha partición raíz. Asigne unha partición ao punto de montaxe raíz antes de continuar.
hi: आपको एक रूट पार्टिशन चाहिए. कृपया जारी रखने से पहले एक पार्टिशन को रूट माउन्ट प्वाइंट के लिए निर्दिष्ट करें.
is: Þú þarfnast rótarsneiðar. Vinsamlegast tilnefndu sneið fyrir rótartenginguna áður en lengra er haldið.
kn: ನಿಮಗೊಂದು ರೂಟ್ ವಿಭಜನೆಯ ಅಗತ್ಯವಿದೆ.ಮುಂದುವರೆಯುವ ಮೊದಲು, ದಯವಿಟ್ಟು ರೂಟ್ ಮೌಂಟ್ ಪಾಯಿಂಟಿಗೆ ಒಂದು ವಿಭಜನೆಯನ್ನು ವಹಿಸಿ.
ku: partîsiyoneke root pêwîst e. Ji kerema xwe re nuqteya mount ya root girêbide partîsiyonekê û piştre bidomîne.
lo: ທ່ານຕ້ອງມີພາທີຊັ້ນພື້ນຖານ ກະລຸນາກຳນົດພາທີຊັ້ນທີ່ຊັນໜຶ່ງໃຫ້ເມົ້າທ໌ທີ່ຕຳແໜ່ງພື້ນຖານທີ່ຈະດຳເນີນການຕໍ່ໄປ
mr: एक मूल विभाजन आवश्यक. पुढे जाण्यापूर्वी मूल आरोहण बिंदूला एक विभाजन नेमून द्या.
ro: Aveți nevoie de o partiție rădăcină. Vă rugăm să asociați o partiție la punctul de montare rădăcină înainte de a continua.
ta: உங்களுக்கு ஒரு மூலப் பகிர்வு அவசியம். தொடரும் முன் மூலத்திற்கு ஒரு ஏற்றப்புள்ளியை கொடுக்கவும்.
te: రూట్ విభజన కావాలి. ఒక విభజనకి రూట్ అనుసంధాన కేంద్రము గా ఇచ్చిన తరువాత, కొనసాగించండి
th: คุณต้องมีพาร์ทิชันราก กรุณากำหนดพาร์ทิชันหนึ่งให้เมานท์ที่ตำแหน่งราก ก่อนที่จะดำเนินการต่อไป
ug: root دىسكا رايونى تەلەپ قىلىنىدۇ، شۇڭا بىر root دىسكا رايونى ئېگەرلەڭ.

source: Partition assigned to ${MOUNT}
cs: Oblast přiřazená k ${MOUNT}
da: Partition udpeget til ${MOUNT}
fa: پارتیشن اختصاص یافته به ${MOUNT}
ga: Deighilt sannta do ${MOUNT}
gl: Asignouse a partición a ${MOUNT}
hi: पार्टिशन को ${MOUNT} के लिए निर्दिष्ट किया गया
is: Sneið tilnefnd fyrir ${MOUNT}
kn: ವಿಭಜನೆಯನ್ನು ${MOUNT}ಗೆ ವಹಿಸಲಾಗಿದೆ.
ku: partîsiyona girêdayî ${MOUNT}
lo: ພາທີຊັ້ນຖືກກຳນົດໃຫ້ເມົ້າ ${MOUNT}
mr: विभाजन ${MOUNT} ला नेमले
ro: Partiție asociată la ${MOUNT}
ta: ${MOUNT} க்கு அளித்த பகிர்வு
te: విభజన కి ${MOUNT} అనుసంధానము ఇవ్వబడిన ది
th: พาร์ทิชันถูกกำหนดให้เมานท์ที่ ${MOUNT}
ug: رايون ${MOUNT} غا تەقسىملەندى

source: Mounting a partition on ${MOUNT} makes no sense. Please change this.
cs: Připojení oblasti k ${MOUNT} nedává žádný smysl. Změňte to, prosím.
da: Det giver ingen mening at montere en partition på ${MOUNT}. Ret det venligst.
fa: بارگزاری یک پارتیشن بر روی ${MOUNT} عملی نمی‌باشد. لطفا این را تغییر دهید.
ga: Níl aon chiall le deighilt a fheistiú ar ${MOUNT}. Athraigh é seo.
gl: Non ten sentido montar unha partición en ${MOUNT}. Modifique isto.
hi: ${MOUNT} पर किसी भी पार्टिशन को माउन्ट करने का कोई अर्थ नहीं है. कृपया इसे बदलें.
is: Það er ekkert vit í að tengja sneið við ${MOUNT}. Vinsamlegast lagaðu þetta.
kn: ಒಂದು ವಿಭಜನೆಯನ್ನು ${MOUNT}ನ ಮೇಲೆ ಮೌಂಟ್ ಮಾಡುವುದರಲ್ಲಿ ಯಾವುದೇ ಅರ್ಥವಿಲ್ಲ. ದಯವಿಟ್ಟು ಇದನ್ನು ಬದಲಿಸಿ.
ku: Mountkirina partîsiyonekê di ${MOUNT} de bê wate ye. Ji kerema xwe re biguherîne.
lo: ບໍ່ມີເຫດຜົນທີ່ຈະເມົ້າທ໌ພາທິຊັ້ນທີ່ ${MOUNT} ກະລຸນາປ່ຽນໃໝ່
mr: ${MOUNT} वर विभाजन आरोहित करण्यात अर्थ नाही. कृपया यात बदल करा.
ro: Montarea unei partiții la ${MOUNT} nu are sens. Vă rugăm să modificați.
ta: ${MOUNT} இல் பகிர்வு ஏற்றுவதில் பொருள் இல்லை. இதை தயவு செய்து மாற்றவும்.
te: విభజన కి ${MOUNT} అనుసంధానము ఇచ్చుట అర్ధవంతమైనది కాదు. దయచేసి దీనిని మార్చండి.
th: ไม่มีเหตุผลที่จะเมานท์พาร์ทิชันที่ ${MOUNT} กรุณาเปลี่ยนใหม่
ug: ${MOUNT} غا دىسكا رايونى ئېگەرلەش قائىدىگە چۈشمەيدۇ، ئۆزگەرتىڭ.

source: Several partitions assigned to ${MOUNT}
cs: K ${MOUNT} je přiřazeno několik oblastí
da: Flere partitioner er blevet tildelt ${MOUNT}
fa: پارتیشن‌های اختصاص یافته به ${MOUNT}
ga: Níos mó ná deighilt amháin sannta do ${MOUNT}
gl: Asignáronse varias particións a ${MOUNT}
hi: ${MOUNT} के लिए कई पार्टिशन निर्दिष्ट हैं
is: Nokkrar sneiðar hafa verið tilnefndar fyrir ${MOUNT}
kn: ${MOUNT} ಗೆ ಹಲವಾರು ವಿಭಜನೆಗಳನ್ನು ವಹಿಸಲಾಗಿದೆ.
ku: Ji yek zêdetir partîsiyon hatin ji ${MOUNT} re girêdan
lo: ມີຫຼາຍພາທິຊັ້ນຖືກກຳນົດໃຫ້ເມົ້າທ໌ທີ່ ${MOUNT}
mr: ${MOUNT} वर अनेक विभाजने नेमली आहेत
ro: Mai multe partiții asociate la ${MOUNT}
ta: பல பகிர்வுகள் ${MOUNT} க்கு கொடுக்கப் பட்டு உள்ளன.
te: ${MOUNT} చాలా విభజనలకు అనుసంధానముగా ఇవ్వబడినది
th: มีหลายพาร์ทิชันถูกกำหนดให้เมานท์ที่ ${MOUNT}
ug: بىرنەچچە دىسكا رايونى تەڭلا ${MOUNT} غا بېرىلدى.

source: You cannot assign several partitions to the same mount point. Please change all but one of them.
cs: Není možné připojit více oblastí do jednoho přípojného bodu. Prosím, opravte to.
da: Du kan ikke udpege flere partitioner til samme monteringspunkt. Ret venligst alle undtagen én.
fa: شما نمی‌توانید پارتیشن‌های مختلفی را برای بارگزاری در یک نقطه مشخص کنید.
ga: Ní féidir leat níos mó ná deighilt amháin a shannadh don phointe feistithe céanna. Athraigh é seo.
gl: Non se poden asignar varias particións ao mesmo punto de montaxe. Tróqueas todas menos unha.
hi: आप कई पार्टिशनों को एक ही माउन्ट प्वाइंट के लिए निर्दिष्ट नहीं कर सकते हैं. कृपया एक पार्टिशन को छोड़ कर बाकी सबको बदलें.
is: Þú getur ekki tilnefnd margar sneiðar fyrir sama tengipunktinn. Vinsamlegast breyttu öllum nema einni.
kn: ನೀವು ಹಲವು ವಿಭಜನೆಗಳನ್ನು ಒಂದೇ ಮೌಂಟ್ ಪಾಯಿಂಟಿಗೆ ವಹಿಸಲು ಸಾಧ್ಯವಿಲ್ಲ. ದಯವಿಟ್ಟು ಒಂದನ್ನು ಹೊರತುಪಡಿಸಿ ಮಿಕ್ಕೆಲ್ಲವನ್ನೂ ಬದಲಿಸಿ.
ku: Girêdana çend partîsiyonan ji yek nuqteya mount re ne gengaz e. Ji kerema xwe yên zêde biguherîne.
lo: ທ່ານບໍ່ສາມາດກຳນົດຫຼາຍພາທິຊັ້ນເມົ້າທ໌ທີ່ຕຳແໜ່ງດຽວກັນໄດ້ ກະລຸນາປ່ຽນໃໝ່ໃຫ້ເຫຼືອພຽງແຕ່ພາທິຊັ້ນດຽວ
mr: एकाच आरोहण बिंदूवर अनेक विभजने नेमता येणार नाहीत. एक सोडून बाकी सर्वांमधे बदल करा.
ro: Nu puteți asocia mai multe partiții la același punct de montare. Vă rugăm să le modificați pe toate, cu excepția uneia.
ta: பல பகிர்வுகள் ஒரே ஏற்றுப் புள்ளிக்கு கு கொடுக் கூடாது. அவற்றில் ஏதேனும் ஒன்றை தவிர மற்றவற்றை நீக்கவும்.
te: ${MOUNT} చాలా విభజనలకు అనుసంధానముగా ఇవ్వకూడదు. ఒక్కటి తప్ప మిగతా వాటిని మార్చండి.
th: คุณไม่สามารถกำหนดหลายพาร์ทิชันให้เมานท์ที่ตำแหน่งเดียวกันได้ กรุณาเปลี่ยนใหม่ให้เหลือเพียงพาร์ทิชันเดียว
ug: بىر ئېگەرلەش نۇقتىسىغا كۆپ دىسكا رايونى بېكىتەلمەيسىز. ئىچىدىكى بىرىنى ئۆزگەرتىڭ.

source: Ready to create file systems and mount partitions?
cs: Připraveni na vytvoření souborových systémů a připojení oblastí?
da: Klar til at oprette filsystemer og montere partitioner?
fa: آماده ایجاد فایل سیستم و بارگزاری پارتیشن‌ها؟
ga: An bhfuil tú réidh le córais chomhad agus deighiltí feistithe a chruthú?
gl: Está preparado para crear os sistemas de ficheiros e montar as particións?
hi: फाइलतंत्र व माउन्ट प्वाइंट्स बनाने के लिए तैयार हैं?
is: Tilbúin að búa til skráakerfi og tengja sneiðar við það?
kn: ಕಡತವ್ಯವಸ್ಥೆಯನ್ನು ನಿರ್ಮಿಸಿ ವಿಭಜನೆಗಳನ್ನು ಮೌಂಟ್ ಮಾಡಲು ಸಿಧ್ಧವೇ?
ku: Ji bo afirandina pergalên pelan û mountkirina partîsiyonan amade yî?
lo: ພ້ອມທີ່ຈະສ້າງລະບົບແຟ້ມ ແລະ ເມົ້າທ໌ພາທິຊັ້ນ ຫຼື ບໍ?
mr: फाईल प्रणाली बनवण्याकरिता व विभाजने आरोहित करण्याकरिता तयार आहात?
ro: Sunteți gata să creați sisteme de fișiere și să montați partiții ?
ta: கோப்பு அமைப்புகளை உருவாக்கவும் பகிர்வுகளை ஏற்றவும் தயார்தானே?
te: ఫైల్ వ్యవస్థలు మరియు అనుసంధాన కేంద్రాలు ఇవ్వటానికి సిద్ధమేనా?
th: พร้อมที่จะสร้างระบบแฟ้มและเมานท์พาร์ทิชันหรือยัง?
ug: ھۆججەت سىستېمىسى قۇرۇش ۋە دىسكا رايونى ئېگەرلەش تەييارلىقى پۈتتىمۇ؟

source: File systems will be created and partitions mounted.
cs: Souborové systémy budou vytvořeny a oblasti připojeny.
da: Filsystemer vil blive oprettet og partitioner monteret.
fa: ایجاد فایل سیستم و بازگزاری پارتیشن‌ها انجام خواهد شد.
ga: Cruthófar córais chomhad agus feisteofar na deighiltí.
gl: Hanse crear os sistemas de ficheiros e montar as particións.
hi: फाइलतंत्र बनाए जाएँगे व पार्टिशन माउंट किये जाएँगे.
is: Skráakerfi verður búið til og sneiðar tengdar því.
kn: ಕಡತವ್ಯವಸ್ಥೆಯನ್ನು ನಿರ್ಮಿಸಿ ವಿಭಜನೆಗಳನ್ನು ಮೌಂಟ್ ಮಾಡಲಾಗುತ್ತದೆ
ku: Pergalên pelan dê werin afirandin û partîsiyonan dê werin mount kirin.
lo: ຈະສ້າງລະບົບແຟ້ມ ແລະ ເມົ້າທ໌ພາທິຊັ້ນ
mr: फाईल प्रणाली बनवल्या जातील व विभाजने आरोहित होतील.
ro: Sistemele de fișiere vor fi create și partițiile montate.
ta: கோப்பு அமைப்புகள் உருவாக்கப் பட்டு பகிர்வுகள் ஏற்றப் படும்.
te: ఫైల్ వ్యవస్థలు సృష్టించబడతాయి మరియు విభజనలు అనుసంధానించబడతాయి.
th: จะสร้างระบบแฟ้ม และเมานท์พาร์ทิชัน
ug: ھۆججەت سىستېمىسى قۇرۇلىدۇ ۋە دىسكا رايونلىرى ئېگەرلىنىدۇ.

source: WARNING: This will destroy all data on the partitions you have assigned file systems to.
cs: VAROVÁNÍ: Tímto zničíte veškerá data na oblastech, kterým jste přiřadili souborový systém.
da: ADVARSEL: Dette vil ødelægge alle data på de partitioner, du har udpeget filsystemer til.
fa: اخطار : همه ی اطلاعات مربوط به پارتیشن‌ها از بین خواهد رفت.
ga: RABHADH: Scriosfaidh sé seo na sonraí go léir ar na deighiltí a sannadh córais chomhad dóibh.
gl: AVISO: Isto ha destruír todos os datos das particións ás que asignou sistemas de ficheiros.
hi: चेतावनीः इससे आपके द्वारा निर्दिष्ट किए पार्टीशन के सभी डाटा नष्ट हो जाएँगे.
is: AÐVÖRUN: Þetta mun eyða öllum gögnum á þeim sneiðum sem þú hefur tilnefnt til tengingar við skráakerfið.
kn: ಎಚ್ಚರಿಕೆ: ಇದು ನೀವು ಕಡತವ್ಯವಸ್ಥೆಯನ್ನು ವಹಿಸಿರುವ ವಿಭಜನೆಗಳಲ್ಲಿನ ಎಲ್ಲಾ ಮಾಹಿತಿಯನ್ನೂ ನಾಶಗೊಳಿಸುತ್ತದೆ.
ku: HIŞYAR: Bi vê, di hemû partîsiyonên ku te ji pergalên pelan re girêdan de, hemû·dane yanî data·dê werin tunekirin.
lo: ຄຳເຕືອນ: ຂໍ້ມູນທັງໝົດໃນພາທິຊັ້ນທີ່ທ່ານກຳນົດໃຫ້ສ້າງລະບົບແຟ້ມ ຈະຖືກທຳລາຍ
mr: इशाराः फाईल प्रणालींसाठी निश्चित केलेल्या विभाजनांवरील सर्व माहिती यामुळे नष्ट होईल.
ro: ATENȚIE: Acesta va distruge toate datele de pe partițiile la care ați asociat sisteme de fișiere.
ta: எச்சரிக்கை: கோப்பு அமைப்புகளை உருவாக்க கொடுக்கப் பட்ட பகிர்வுகளில் உள்ள அனைத்து தகவல்களும் அழிக்கப் படும்.
te: హెచ్చరిక: ఈ చర్య ఫైల్ వ్యవస్థ ఇవ్వబడిన విభజనలపైనున్న దత్తాంశాన్ని నాశనంచేస్తుంది
th: คำเตือน: ข้อมูลทั้งหมดในพาร์ทิชันที่คุณกำหนดให้สร้างระบบแฟ้ม จะถูกทำลาย
ug: ئاگاھلاندۇرۇش: ھۆججەت سىستېمىسى قۇرماقچى بولغان دىسكا رايونلىرىدىكى ھۆججەتلەرنىڭ ھەممىسى يۇيۇلۇپ كېتىدۇ.

source: Failed to create swap space on ${PARTITION}
cs: Selhalo vytvoření odkládacího prostoru na ${PARTITION}
da: Kunne ikke oprette swapområde på ${PARTITION}
fa: ایجاد فضای swap بر روی پارتیشن ${PARTITION} شکست خورد.
ga: Níorbh fhéidir spás babhtála a chruthú ar ${PARTITION}
gl: Fallou a creación de espazo de intercambio en ${PARTITION}
hi: ${PARTITION} पर स्वैप स्थान बनाने में असफल
is: Mistókst að búa til víxlsvæði (swap) á ${PARTITION}
kn: ಸ್ವಾಪ್ ಜಾಗವನ್ನು ${PARTITION} ನ ಮೇಲೆ ನಿರ್ಮಿಸಲು ಸಾಧ್ಯವಾಗಲಿಲ್ಲ
ku: Afirandina cihê swap di ${PARTITION} de serneket
lo: ບໍ່ສາມາດສ້າງພື້ນທີ່ສະຫຼັບໃນ ${PARTITION}
mr: ${PARTITION} वर अदलाबदलीची जागा तयार करताना अपयश
ro: Eșec la crearea spațiului de swap pe ${PARTITION}
ta: ${PARTITION} இல் இட மாற்று வெளி உருவாக்குதல் தோல்வியுற்றது.
te: ${PARTITION} పై swap స్థలము సృష్టించుట విఫలమైంది
th: ไม่สามารถสร้างพื้นที่สลับใน ${PARTITION}
ug: ${PARTITION} غا swap بوشلۇقى قۇرۇش مەغلۇپ بولدى

source: An error occurred when the swap space was created on ${PARTITION}.
cs: Při vytváření odkládacího prostoru na ${PARTITION} se vyskytla chyba.
da: Der opstod en fejl, da swapområdet blev oprettet på ${PARTITION}.
fa: در هنگام ایجاد فضای swap بر روی پارتیشن ${PARTITION} خطایی رخ داده است.
ga: Tharla earráid agus spás babhtála á chruthú ar ${PARTITION}.
gl: Aconteceu un erro ao crear o espazo de intercambio en ${PARTITION}.
hi: ${PARTITION} पर स्वैप स्थान बनाते समय त्रुटि हुई.
is: Villa kom upp þegar víxlsvæði var búið til á ${PARTITION}.
kn: ಸ್ವಾಪ್ ಜಾಗವನ್ನು ${PARTITION} ನ ಮೇಲೆ ನಿರ್ಮಿಸಿದಾಗ ಒಂದು ದೋಷವಾಗಿದೆ.
ku: Di afirandina cihê swap di ${PARTITION} de pirsgirêkek derket holê.
lo: ເກີດຂໍ້ຜິດພາດຂະນະສ້າງພື້ນທີ່ສະຫຼັບໃນ ${PARTITION}
mr: ${PARTITION} वर अदलाबदलीची जागा निर्माण करताना त्रुटी आली.
ro: A apărut o eroare la crearea spațiului de swap pe ${PARTITION}.
ta: ${PARTITION} இல் இட மாற்று வெளி உருவாக்கும் போது ஒரு தவறு ஏற்பட்டது.
te: swap స్థలం ${PARTITION} పై సృష్టించుటలో దోషం ఏర్పడింది.
th: เกิดข้อผิดพลาดขณะสร้างพื้นที่สลับใน ${PARTITION}
ug: ${PARTITION}غا swap بوشلۇقى قۇرۇلۇۋاتقاندا خاتالىق كۆرۈلدى.

source: Please check the error log on the third console or /var/log/messages for more information.
cs: Více informací naleznete na třetí konzoli nebo ve /var/log/messages.
da: Tjek fejlloggen på den tredje konsol eller /var/log/messages for flere oplysninger.
fa: لطفا خطاهای بوجود آمده را در کنسول سوم بازبینی نمایید و یا برای اطلاعات بیشتر فایل /var/log/messages را بررسی نمایید.
ga: Féach ar an logchomhad earráide ar an tríú consól nó ar /var/log/messages chun tuilleadh eolais a fháil.
gl: Consulte o rexistro de erros da terceira consola ou /var/log/messages para obter máis información.
hi: अधिक जानकारी के लिए कृपया तीसरे कन्सोल पर त्रुटियों का लॉग देखें या फिर /var/log/messages देखें.
is: Vinsamlega athugaðu villuannál á þriðja stjórnborðinu eða /var/log boð til að fá meiri upplýsingar.
kn: ದಯವಿಟ್ಟು ಹೆಚ್ಚಿನ ಮಾಹಿತಿಗಾಗಿ ಮೂರನೆಯ ಕನ್ಸೋಲ್ ಅಥವಾ /var/log/messages ನಲ್ಲಿರುವ ದೋಷ ಚರಿತ್ರೆಯನ್ನು ನೋಡಿ.
ku: Ji bo zêdetir agahî ji kerema xwe re log ya çewtiyan di konsola sêyemîn an /var/log/messages de kontrol bike.
lo: ກະລຸນາກວດສອບບັນທຶກຂໍ້ຜິດພາດໃນຄອນໂຊນທີ່ສາມ ຫຼື ທີ່ແຟ້ມ /var/log/messages ເພື່ອເບີ່ງຂໍ້ມູນເພີ່ມເຕີມ
mr: कृपया तिसऱ्या कन्सोलवरील त्रुटी नोंदी पहा. किंवा अधिक माहितीसाठी /var/log/messages पहा.
ro: Vă rugăm verificați jurnalul de erori de pe a treia consolă sau /var/log/messages pentru mai multe informații.
ta: மேலும் தகவலுக்கு தயவு செய்து மூன்றாவது முனையத்தில் உள்ள பிழை லாக் பதிவையோ அல்லது /var/log/messages ஆவணத்தையோ பாருங்கள்.
te: మూడవ కన్సోల్ లో దోషాల పట్టీ చూడండి లేక మరింత సమాచారము కొరకు/var/log/messages చూడండి.
th: กรุณาตรวจสอบบันทึกข้อผิดพลาดในคอนโซลที่สาม หรือที่แฟ้ม /var/log/messages เพื่อดูข้อมูลเพิ่มเติม
ug: /var/log/messages تەكشۈرۈڭ ياكى ئۈچىنچى تەرەپ كونترول سۇپىسىدىكى خاتالىق خاتىرىسى ئارقىلىق تەپسىلىي ئۇچۇرغا ئېرىشىڭ.
