Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel5/*.po
Languages: cs, da, fa, ga, gl, hi, is, kn, ku, lo, mr, ro, ta, te, th, ug

source: Failed to activate the swap space on ${PARTITION}
cs: Chyba při aktivování odkládacího místa na ${PARTITION}
da: Kunne ikke aktivere swapområdet på ${PARTITION}
fa: فعال سازی swap بر روی پارتیشن ${PARTITION} شکست خورد.
ga: Níorbh fhéidir an spás babhtála ar ${PARTITION} a ghníomhachtú
gl: Non foi posíbel activar o espazo de intercambio de ${PARTITION}
hi: ${PARTITION} पर स्वैप क्षेत्र सक्रिय करने में असफल
is: Mistókst að virkja víxlsvæðið á ${PARTITION}
kn: ಸ್ವಾಪ್ ಜಾಗವನ್ನು ${PARTITION} ನ ಮೇಲೆ ಸಕ್ರಿಯಗೊಳಿಸಲು ವಿಫಲವಾಗಿದೆ.
ku: Çalakkirina cihê swap di ${PARTITION} de serneket
lo: ບໍ່ສາມາດເປີດໃຊ້ພື້ນທີ່ສະຫຼັບໃນ ${PARTITION} ໄດ້
mr: ${PARTITION}वर अदलाबदलीची जागा सक्रीय करताना अपयश
ro: Eșec la activarea spațiului de swap pe ${PARTITION}
ta: ${PARTITION} இல் இட மாற்று வெளி செயல் படுத்துதல் தோல்வியுற்றது.
te: swap స్థలము ${PARTITION} పై చేతనంచేయుట విఫలమైంది
th: ไม่สามารถเปิดใช้พื้นที่สลับใน ${PARTITION} ได้
ug: ${PARTITION} رايوندىكى swap بوشلۇقىنى ئاكتىپلاش مەغلۇپ بولدى

source: An error occurred when the swap space on ${PARTITION} was activated.
cs: Při aktivování odkládacího místa na ${PARTITION} se vyskytla chyba.
da: Der opstod en fejl, da swapområdet på ${PARTITION} blev aktiveret.
fa: در هنگام فعال سازی فضای swap بر روی پارتیشن ${PARTITION} خطایی رخ داده است.
ga: Tharla earráid nuair a gníomhachtaíodh an spás babhtála ar ${PARTITION}.
gl: Aconteceu un erro ao activar o espazo de intercambio de ${PARTITION}.
hi: ${PARTITION} पर स्वैप क्षेत्र को सक्रिय करते समय त्रुटि हुई.
is: Það kom upp villa þegar víxlsvæðið á ${PARTITION} var virkjað.
kn: ಸ್ವಾಪ್ ಜಾಗವನ್ನು ${PARTITION} ನ ಮೇಲೆ ಸಕ್ರಿಯಗೊಳಿಸಿದಾಗ ಒಂದು ದೋಷ ಸಂಭವಿಸಿತು.
ku: Dema çalakkirina cihê swap di ${PARTITION} de pirsgirêkek derket holê.
lo: ເກີດຂໍ້ຜິດພາດຂະນະເປີດໃຊ້ພື້ນທີ່ສະຫຼັບໃນ ${PARTITION}
mr: ${PARTITION}वर अदलाबदलीची जागा सक्रीय केल्यावर त्रुटी आली.
ro: A apărut o eroare la activarea spațiului de swap de pe ${PARTITION}.
ta: ${PARTITION} இல் இட மாற்று வெளி செயல் படுத்தும் போது ஒரு தவறு ஏற்பட்டது.
te: swap స్థలము ${PARTITION} పై చేతనంచేయుటలో దోషం ఏర్పడింది
th: เกิดข้อผิดพลาดขณะเปิดใช้พื้นที่สลับใน ${PARTITION}
ug: ${PARTITION} رايوندىكى swap بوشلۇقىنى ئاكتىپلاشتا خاتالىق كۆرۈلدى.

source: Failed to create ${FS} file system on ${PARTITION}
cs: Selhalo vytvoření souborového systému ${FS} na ${PARTITION}
da: Kunne ikke oprette ${FS}-filsystem på ${PARTITION}
fa: ایجاد فایل سیستم ${FS} بر روی پارتیشن ${PARTITION} شکست خورد.
ga: Níorbh fhéidir córas comhaid ${FS} a chruthú ar ${PARTITION}
gl: Fallou a creación dun sistema de ficheiros ${FS} en ${PARTITION}
hi: ${PARTITION} पर ${FS} फाइलतंत्र को बनाने में असफल
is: Ekki tókst að búa til skráarkerfið ${FS} á ${PARTITION}
kn: ${FS} ಕಡತ ವ್ಯವಸ್ಥೆಯನ್ನು ${PARTITION} ನ ಮೇಲೆ ನಿರ್ಮಿಸಲು ಸಾಧ್ಯವಾಗಲಿಲ್ಲ
ku: Afirandina pergala pelan ${FS}·di ·${PARTITION} de serneket
lo: ບໍ່ສາມາດສ້າງລະບົບແຟ້ມ ${FS} ໃນ ${PARTITION}
mr: ${PARTITION} वर ${FS} फाईल प्रणाली निर्माण करताना अपयश
ro: Eșec la crearea sistemului de fișiere ${FS} pe ${PARTITION}
ta: ${PARTITION} பகிர்வில் ${FS} கோப்பு அமைப்பை உருவாக்குதல் தோல்வியுற்றது
te: ${PARTITION} పై ${FS} ఫైల్ వ్యవస్థ సృష్టించుట విఫలమైంది
th: ไม่สามารถสร้างระบบแฟ้ม ${FS} ใน ${PARTITION}
ug: ${PARTITION} رايوندا ${FS} ھۆججەت سىستېمىسى قۇرۇش مەغلۇپ بولدى

source: An error occurred when the ${FS} file system was created on ${PARTITION}.
cs: Při vytváření souborového systému ${FS} na ${PARTITION} se vyskytla chyba.
da: Der opstod en fejl, da ${FS}-filsystemet blev oprettet på ${PARTITION}.
fa: در هنگام ایجاد فایل سیستم ${FS} بر روی پارتیشن ${PARTITION} خطایی رخ داده است.
ga: Tharla earráid nuair a cruthaíodh an córas comhad ${FS} ar ${PARTITION}.
gl: Aconteceu un erro mentres se creaba o sistema de ficheiros ${FS} en ${PARTITION}.
hi: ${PARTITION} पर ${FS} फाइलतंत्र को बनाते समय त्रुटि हुई.
is: Það kom upp villa þegar ${FS} skráarkerfið var búið til á ${PARTITION}.
kn: ${FS} ಕಡತ ವ್ಯವಸ್ಥೆಯನ್ನು ${PARTITION} ನ ಮೇಲೆ ನಿರ್ಮಿಸಿದಾಗ ಒಂದು ದೋಷ ಸಂಭವಿಸಿತು.
ku: Dema pergala pelan ${FS}·di ${PARTITION} de hat afirandin, pirsgirêkek derket holê.
lo: ເກີດຂໍ້ຜິດພາດຂະນະສ້າງລະບົບແຟ້ມ ${FS} ໃນ ${PARTITION}
mr: ${PARTITION} वर ${FS} फाईल प्रणाली निर्माण केल्यावर त्रुटी आली.
ro: A apărut o eroare la crearea sistemului de fișiere ${FS} pe ${PARTITION}.
ta: ${PARTITION} பகிர்வில் ${FS} கோப்பு அமைப்பை உருவாக்கும் போது ஒரு தவறு ஏற்பட்டது.
te: ${PARTITION} పై ${FS} ఫైల్ వ్యవస్థ సృష్టించుటలో దోషం ఏర్పడింది
th: เกิดข้อผิดพลาดขณะสร้างระบบแฟ้ม ${FS} ใน ${PARTITION}
ug: ${PARTITION} رايوندا ${FS} ھۆججەت سىستېمىسى قۇرۇشتا خاتالىق كۆرۈلدى.

source: Failed to mount ${PARTITION} on ${MOUNT}
cs: Selhalo připojení ${PARTITION} na ${MOUNT}
da: Kunne ikke montere ${PARTITION} på ${MOUNT}
fa: بار گزاری پارتیشن ${PARTITION} در ${MOUNT} شکست خورد.
ga: Níorbh fhéidir ${PARTITION} a fheistiú ar ${MOUNT}
gl: Non foi posíbel montar ${PARTITION} en ${MOUNT}
hi: ${PARTITION} को ${MOUNT} पर माउंट करने में असफल
is: Mistókst að tengja ${PARTITION} við ${MOUNT}
kn: ${PARTITION} ಅನ್ನು ${MOUNT}ನ ಮೇಲೆ ಮೌಂಟ್ ಮಾಡಲು ವಿಫಲವಾಗಿದೆ
ku: Mountkirina ${PARTITION}·di ${MOUNT} de serneket
lo: ບໍ່ສາມາດເມົ້າທ໌ ${PARTITION} ທີ່ ${MOUNT} ໄດ້
mr: ${MOUNT} वर ${PARTITION} आरोहित करणे अयशस्वी
ro: Eșec la montarea ${PARTITION} la ${MOUNT}
ta: ${PARTITION} ஐ ${MOUNT} இல் ஏற்றுதல் தோல்வியுற்றது
te: ${PARTITION} ను ${MOUNT} దగ్గర అనుసంధానము చేయుట విఫలమైంది
th: ไม่สามารถเมานท์ ${PARTITION} ที่ ${MOUNT} ได้
ug: ${PARTITION} رايوننى ${MOUNT} غا ئېگەرلەش مەغلۇپ بولدى.

source: An error occurred when ${PARTITION} was mounted on ${MOUNT}.
cs: Při připojování ${PARTITION} na ${MOUNT} se vyskytla chyba.
da: Der opstod en fejl, da ${PARTITION} blev monteret på ${MOUNT}.
fa: در هنگام بار گزاری پارتیشن ${PARTITION} در ${MOUNT} خطایی رخ داده است.
ga: Tharla earráid nuair a feistíodh ${PARTITION} ar ${MOUNT}.
gl: Aconteceu un erro ao montar ${PARTITION} en ${MOUNT}.
hi: ${PARTITION} को ${MOUNT} पर माउन्ट करते समय त्रुटि हुई.
is: Það kom upp villa þegar ${PARTITION} var tengd við ${MOUNT}.
kn: ${PARTITION} ಅನ್ನು ${MOUNT}ನ ಮೇಲೆ ಮೌಂಟ್ ಮಾಡಿದಾಗ ಒಂದು ದೋಷ ಸಂಭವಿಸಿತು.
ku: Dema ${PARTITION}·di ${MOUNT} de hat mountkirin, pirsgirêkek derket holê.
lo: ເກີດຂໍ້ຜິດພາດຂະນະເມົ້າທ໌ ${PARTITION} ທີ່ ${MOUNT}
mr: ${MOUNT} वर ${PARTITION} आरोहित केल्यावर त्रूटी आली.
ro: A apărut o eroare la montarea ${PARTITION} la ${MOUNT}.
ta: ${PARTITION} ஐ ${MOUNT} இல் ஏற்றும் போது ஒரு தவறு ஏற்பட்டது.
te: ${PARTITION} ను ${MOUNT} దగ్గర అనుసంధానము చేయుటలో దోషం ఏర్పడింది
th: เกิดข้อผิดพลาดขณะเมานท์ ${PARTITION} ที่ ${MOUNT}
ug: ${PARTITION} رايوننى ${MOUNT} غا ئېگەرلەشتە خاتالىق كۆرۈلدى.

source: Configure and mount partitions
cs: Nakonfigurovat a připojit oblasti
da: Sæt partitioner op og montér dem
fa: پیکربندی و بارگزاری پارتیشن‌ها
ga: Cumraigh agus feistigh deighiltí
gl: Configurar e montar as particións
hi: पार्टिशनों को व्यवस्थित व माउन्ट करें
is: Stilla og tengja sneiðar við skráakerfi
kn: ವಿಭಜನೆಗಳನ್ನು ಕಾನ್ಫಿಗರ್ ಮಾಡಿ ಮೌಂಟ್ ಮಾಡು
ku: Partîsiyonan saz û mount bike
lo: ຕັ້ງຄ່າ ແລະ ເມົ້າທ໌ພາທິຊັ້ນ
mr: विभाजनांची संरचना व आरोहण करा
ro: Configurează și montează partiții
ta: பகிர்வுகளை வடிவமைத்து ஏற்றவும்
te: విభజనలను అమర్చు మరియు అనుసంధానము చేయు
th: ตั้งค่าและเมานท์พาร์ทิชัน
ug: رايوننى سەپلەش ۋە ئېگەرلەش

source: Disk to partition:
cs: Disk pro rozdělení:
da: Disk at partitionere:
fa: پارتیشن‌بندی دیسک انتخاب شده:
ga: Diosca le deighilt:
gl: Disco a particionar:
hi: पार्टीशन करने के लिए डिस्क:
is: Veldu disk til að sneiða:
kn: ವಿಭಜನೆಯಾಗಬೇಕಿರುವ ಡಿಸ್ಕ್:
ku: Cihê diskê were partîsiyonkirin:
lo: ດິດສ໌ທີ່ຈະແບ່ງພາທິຊັ້ນ:
mr: बिभाजन करण्याकरिता डिस्कः
ro: Discul de partiționat:
ta: பகிர்வு செய்யவேண்டிய வட்டு:
te: ‌విభజన చేయవలసిన డిస్క్:
th: ดิสก์ที่จะแบ่งพาร์ทิชัน:
ug: دىسكىدىن رايونغا:

source: Please choose one of the listed disks to create partitions on it.
cs: Z těchto disků vyberte ten, na kterém chcete vytvořit oblasti.
da: Vælg en af de viste diske for at oprette partitioner på den.
fa: لطفا یک دیسک از لیست برای پارتیشن بندی انتخاب کنید.
ga: Roghnaigh ceann de na dioscaí seo chun deighiltí a chruthú air.
gl: Escolla un dos discos da lista para crear particións nel.
hi: सूचीबद्ध डिस्कों में से एक डिस्क चुनें जिस पर पार्टिशन बनाने है.
is: Veldu einhvern upptalinna diska til að búa til sneiðar á honum.
kn: ದಯವಿಟ್ಟು ವಿಭಜನೆ ಮಾಡಲು ಪಟ್ಟಿಯಿಂದ ಡಿಸ್ಕೊಂದನ್ನು ಆಯ್ಕೆಮಾಡಿ.
ku: Ji kerema xwe re ji bo ku li serî partîsyonan biafirînî, dîskeke lîstebûyî hilbijêre.
lo: ກະລຸນາເລືອກດິດສ໌ໃດດິດສ໌ໜຶ່ງໃນລາຍການທີ່ຈະສ້າງພາທິຊັ້ນໃນນັ້ນ
mr: दर्शविलेल्या डिस्कच्या यादी पैकी विभाजन करण्यासाठी एक डिस्क निवडा.
ro: Vă rugăm să alegeți unul din discurile afișate pentru a crea partiții pe el.
ta: பகிர்வுகளை உருவாக்க பட்டியலிலுள்ள வட்டுக்களில் ஒன்றை தேர்வு செய்க.
te: విభజనలు చేయుటకు, జాబితా లో ఇవ్వబడిన డిస్క్ లలో ఒక దానిని ఎంచుకో
th: กรุณาเลือกดิสก์ใดดิสก์หนึ่งในรายการที่จะสร้างพาร์ทิชันในนั้น
ug: تىزىملىكتىن رايون قۇرىدىغان دىسكىدىن بىرنى تاللاڭ.

source: Select "Finish" at the bottom of the list when you are done.
cs: Až budete hotovi, vyberte z konce seznamu možnost „Skončit“.
da: Vælg "Afslut" i bunden af listen, når du er færdig.
fa: در صورت اتمام کار «پایان» را انتخاب نمایید.
ga: Roghnaigh "Críochnaigh" ag bun an liosta nuair a bheidh tú críochnaithe.
gl: Escolla «Rematar» en baixo da lista cando remate.
hi: जब आप तैयार हो जाएँ तो सूची के अन्त में लिखा हुआ "Finish" चुनें.
is: Veldu "Ljúka" neðst í listanum þegar þú ert búin(n).
kn: ಮಾಡಿದ ನಂತರ ಪಟ್ಟಿಯ ತಳದಲ್ಲಿರುವ "ಸಮಾಪ್ತಿಗೊಳಿಸು" ಅನ್ನು ಆಯ್ಕೆ ಮಾಡಿ
ku: Dema te xelas kir, di dawiya lîsteyê de "Dawî" hilbijêre.
lo: ເລືອກ "ສີ້ນສຸດ" ທີ່ທ້າຍລາຍການເມື່ອທ່ານເລືອກສຳເລັດແລ້ວ
mr: काम पूर्ण झाल्यावर तळातल्या यादीतून "Finish" निवडा.
ro: Selectați „Finalizează” din josul listei atunci când terminați.
ta: மிடிந்தபிறகு பட்டியலின் இறுதியில் உள்ள "Finish" -ஐ (முடி) தேர்வு செய்யவும்.
te: పని పూర్తయిన తర్వాత,జాబితా క్రింద భాగంలో వున్న "Finish" ఎంచుకో.
th: เลือก "เสร็จสิ้น" ที่ท้ายรายการเมื่อคุณเลือกเสร็จแล้ว
ug: تاماملانغاندا تىزىملىك ئاستىدىكى «تامام»نى تاللاڭ.

source: No disk found
cs: Žádné disky nenalezeny
da: Fandt ingen disk
fa: هیچ دیسکی یافت نشد.
ga: Níor aimsíodh diosca
gl: Non se atopou ningún disco
hi: कोई डिस्क नहीं मिला
is: Engin diskur fannst
kn: ಯಾವುದೇ ಡಿಸ್ಕ್ ಪತ್ತೆಯಾಗಿಲ್ಲ
ku: Tu disk nehat dîtin
lo: ບໍ່ພົບດິດສ໌
mr: कोणतीही डिस्क सापडली नाही
ro: Nu s-a găsit nici un disc
ta: வட்டுகள் ஏதும் காணவில்லை
te: డిస్క్ కనబడలేదు
th: ไม่พบดิสก์
ug: دىسكا تېپىلمىدى

source: Unable to find any disk in your system. Maybe some kernel modules need to be loaded.
cs: Nemohu najít žádné disky. Možná se musí zavést nějaké moduly jádra?
da: Kunne ikke finde nogle diske på dit system. Måske skal du indlæse nogle kernemoduler.
fa: هیچ دیسک در سیستم شما یافت نشد. شاید برخی از ماژول‌های کرنل نیاز به بارگذاری داشته باشند.
ga: Níorbh fhéidir diosca a aimsiú ar do chóras. B'fhéidir gur gá roinnt modúl eithne a luchtú.
gl: Non se atopou ningún disco no sistema. Poida que se precisen cargar algúns módulos do núcleo.
hi: आपके सिस्टम में कोई भी डिस्क ढूँढने में असफल. शायद कुछ कर्नेल मॉड्यूल लोड करने की आवश्यकता है.
is: Tókst ekki að finna neinn disk á kerfinu. Kannski þarf að hlaða inn einhverjum kjarnaeiningum.
kn: ನಿಮ್ಮ ಸಿಸ್ಟಮ್ಮಿನಲ್ಲಿ ಯಾವುದೇ ಡಿಸ್ಕನ್ನು ಪತ್ತೆ ಮಾಡಲು ಸಾಧ್ಯವಾಗಿಲ್ಲ. ಪ್ರಾಯಶಃ ಕೆಲವು ಕರ್ನಲ್ ಮೋಡ್ಯೂಲುಗಳು ಲೋಡ್ ಆಗಬೇಕಿವೆ.
ku: Qet dîsk di pergala te nehate dîtin. Dibe ku barkirina çend modulên kernelê pêwist be.
lo: ບໍ່ພົບດິດສ໌ໃດໆ ໃນລະບົບຂອງທ່ານ ບາງທີ ທ່ານອາດຕ້ອງໂຫຼດໂມດູນບາງໂມດູນຂອງເຄີເນວ
mr: तुमच्या संगणकात कोणतीच डिस्क आढळली नाही. कदाचीत काही गाभा मॉड्यूल्स लोड करण्याची गरज आहे.
ro: Nu s-a putut găsi nici un disc în sistemul dumneavoastră. Este posibil ca să fie necesar să încărcați câteva module de nucleu.
ta: தங்கள் கணிணியில் எந்த வட்டையும் கண்டறிய இயலவில்லை. சில கரு தொகுதிகளை ஏற்ற வேண்டியிருக்கலாம்.
te: మీ వ్యవస్థలో డిస్క్ కనబడలేదు. కొన్ని కెర్నెల్ మాడ్యూళ్లు ఏక్కించవలసిన అవసరం వుండవచ్చు.
th: ไม่พบดิสก์ใดๆ ในระบบของคุณ บางที คุณอาจต้องโหลดมอดูลบางมอดูลของเคอร์เนล
ug: سىستېمىدىن قاتتىق دىسكىنى تاپالمىدى. بەزى يادرو بۆلەكلىرىنى يۈكلىسىڭىز بولىدىغاندەك تۇرىدۇ.

source: Partitioning error
cs: Chyba v rozdělování disku
da: Partitioneringsfejl
fa: خطا در پارتیشن بندی
ga: Earráid deighilte
gl: Erro de particionamento
hi: पार्टीशन करने में त्रुटि
is: Disksneiðingarvilla
kn: ವಿಭಜನಾ ದೋಷ
ku: Çewtiya partîsiyonkirinê
lo: ການແບ່ງພາທິຊັ້ນຜິດພາດ
mr: विभाजनीकरण त्रुटी
ro: Eroare la partiționare
ta: பகிர்வுப் பிழை
te: విభజనచేయుటలో దోషం
th: การแบ่งพาร์ทิชันผิดพลาด
ug: رايونغا ئايرىش خاتالىقى

source: Failed to partition the disk ${DISC}.
cs: Selhalo rozdělení disku ${DISC}.
da: Kunne ikke partitionere disken ${DISC}.
fa: پارتیشن‌بندی دیسک ${DISC} شکست خورد
ga: Theip ar dhiosca ${DISC} a dheighilt.
gl: Fallou o particionamento o disco ${DISC}.
hi: डिस्क ${DISC} का विभाजन असफल।
is: Mistókst að sneiða niður ${DISC} diskinn.
kn: ${DISC} ಡಿಸ್ಕನ್ನು ವಿಭಜಿಸಲು ಸಾಧ್ಯವಾಗಲಿಲ್ಲ.
ku: Partîsiyonkirina diska ${DISC} serneket.
lo: ບໍ່ສາມາດແບ່ງພາທິຊັ້ນໃນດິດສ໌ ${DISC}
mr: ${DISC} वर विभाजन करण्याची प्रक्रिया असफल.
ro: Eșec la partiționarea discului ${DISC}.
ta: ${DISC}-ஐ பகிர்சு செய்யும் முயற்சி தோல்வியடைந்தது.
te: ${DISC} డిస్క్ విభజన చేయుట విఫలమైంది .
th: ไม่สามารถแบ่งพาร์ทิชันในดิสก์ ${DISC}
ug: ${DISC} دىسكىنى رايونغا ئايرىش مەغلۇپ بولدى.

source: Partition a hard drive
cs: Rozdělit pevný disk
da: Partitionér en harddisk
fa: پارتیشن‌بندی هارد دیسک
ga: Deighil tiomántán crua
gl: Particionar un disco duro
hi: कोई एक हार्ड ड्राइव पार्टीशन करें
is: Sneiða harðan disk
kn: ಒಂದು ಹಾರ್ಡ್ ಡ್ರೈವನ್ನು ವಿಭಜಿಸು
ku: Dîskeke sabît partîsiyon bike
lo: ແບ່ງພາທິຊັ້ນໃນຮາດດິດສ໌
mr: हार्ड ड्राईव्हचे विभाजन करा
ro: Partiționează un disc fix
ta: வட்டை பகிர்வு செய்
te: హార్డ్ డ్రైవ్ విభజన చేయు
th: แบ่งพาร์ทิชันในฮาร์ดดิสก์
ug: قاتتىق دىسكىنى رايونغا بۆل

source: ctc: Channel to Channel (CTC) or ESCON connection
cs: ctc: Channel to Channel (CTC) nebo ESCON spojení
da: ctc: Channel-to-Channel (CTC) eller ESCON-forbindelse
fa: اتصال CTC یا ESCON
ga: ctc: Cainéal-go-Cainéal (CTC) nó ceangal ESCON
gl: ctc: Conexión canle a canle (CTC) ou ESCON
hi: ctc: चैनल टू चैनल (CTC) या ESCON संबंध
is: ctc: Channel to Channel (CTC) eða ESCON tenging
kn: ctc: ಚಾನಲ್ ನಿಂದ ಚಾನಲ್ ಗೆ (CTC) ಅಥವಾ ESCON ಸಂಪರ್ಕ
ku: ctc: Girêdana Channel to Channel (CTC) an ESCON
lo: ctc: ການເຊື່ອມຕໍ່ແບບ Channel to Channel (CTC) ຫຼື ESCON
mr: ctc: चॅनेल टू चॅनेल (CTC) किंवा ESCON जोडणी
ro: ctc: Conexiune „Channel to Channel” (CTC) sau conexiune ESCON
ta: ctc:சேனல்-டூ-சேனல்(CTC) அல்லது ESCON தொடர்பு
te: ctc: ఛానల్ నుండి ఛానల్ కు(CTC) లేక ESCON అనసంధానము
th: ctc: การเชื่อมต่อแบบ Channel to Channel (CTC) หรือ ESCON
ug: ctc: قانالدىن قانالغا (CTC) ياكى ESCON باغلىنىش

source: qeth: OSA-Express in QDIO mode / HiperSockets
cs: qeth: OSA-Express v QUIDO módu / HiperSockets
da: qeth: OSA-Express i QDIO-tilstand / HiperSockets
fa: qeth: OSA-Express در QDIO mode / HiperSockets
ga: qeth: OSA-Express i mód QDIO / HiperSockets
gl: qeth: OSA-Express en modo QDIO / HiperSockets
hi: qeth: OSA-एक्सप्रेस QDIO मोड में/HiperSockets
is: qeth: OSA-Express í QDIO-ham / HiperSockets
kn: qeth: QDIO ಮೋಡಿನಲ್ಲಿ OSA -ಎಕ್ಸಪ್ರೆಸ್/ ಹೈಪರ್ ಸಾಕೆಟ್
lo: qeth: OSA-Express ໃນໝົດ QDIO / HiperSockets
mr: qeth: OSA -एक्सप्रेस इन QDIO मोड / हायपरसॉकेटस्
ro: qeth: OSA-Express în mod QDIO / HiperSockets
ta: qeth: QDIO நிலையிலுள்ள OSA Express / HiperSockets
te: qeth: QDIO విధము / HiperSockets లో OSA-Express
th: qeth: OSA-Express ในโหมด QDIO / HiperSockets

source: iucv: Inter-User Communication Vehicle - available for VM guests only
cs: iucv: Inter-User Communication Vehicle - dostupné pouze pro hosty systému VM
da: iucv: Mellem-bruger kommunikations-transport - kun for VM-gæster
fa: iucv: Inter-User Communication Vehicle - تنها برای مهمان های ماشین مجازی موجود می‌باشد
ga: iucv: Feithicil chumarsáide idir úsáideoirí - ar fáil d'aíonna VM amháin
gl: iucv: Vehículo de comunicación interusuario; só para hóspedes VM
hi: iucv: इंटर-यूज़र कम्यूनिकेशन वेहिकल - केवल वीएम गेस्ट्स के लिए उपलब्ध
is: iucv: Inter-User Communication Vehicle - einungis tiltækt fyrir VM gesti
kn: iucv: ಅಂತರ-ಬಳಕೆದಾರ ಸಂಪರ್ಕ ವಾಹಕ - ಕೇವಲ VM ಅತಿಥಿಗಳಿಗೆ ಮಾತ್ರ ಲಭ್ಯ
lo: iucv: Inter-User Communication Vehicle - ສຳລັບ VM guest ເທົ່ານັ້ນ
mr: iucvः इंटर-युजर कम्यूनिकेशन व्हेईकल- फक्त VM गेस्टसाठीच उपलब्ध
ro: iucv: Vehicul de comunicare inter-utilizator - pentru oaspeții VM
ta: iucv: பயனர் இடையேயான தொடர்பு வாகனம் -- VM விருந்தாளிகளுக்கு மட்டும்
te: iucv: Inter-User Communication Vehicle - VM అతిథులకొరకు మాత్రమే
th: iucv: Inter-User Communication Vehicle - สำหรับ VM guest เท่านั้น
ug: iucv: Inter-User Communication Vehicle - پەقەت مەۋھۇم ماشىنا(VM)نىڭ خېرىدارىغىلا ماس كېلىدۇ

source: virtio: KVM VirtIO
hi: वर्टआईओ (virtio): के वि एम् वर्टआईओ
kn: virtio: KVM ನ VirtIO
mr: virtio: केव्हीएम VirtIO
th: virtio: VirtIO ของ KVM

source: Network device type:
cs: Typ síťového zařízení:
da: Netkorts-type:
fa: نوع دستگاه شبکه :
ga: Cineál an ghléis líonra:
gl: Tipo de dispositivo de rede:
hi: नेटवर्क उपकरण प्रकार:
is: Tegund netkorts:
kn: ಸಂಪರ್ಕಜಾಲದ ಡಿವೈಸಿನ ಮಾದರಿ:
ku: Cureyê amûra torê:
lo: ຊະນິດຂອງອຸປະກອນເຄືອຂ່າຍ:
mr: नेटवर्क उपकरणाचा प्रकारः
ro: Tipul plăcii de rețea:
ta: வலைபின்னல் சாதன வகை:
te: నెట్వర్క్ డివైస్ రకము:
th: ชนิดของอุปกรณ์เครือข่าย:
ug: تور ئۈسكۈنە تۈرى:

source: Please choose the type of your primary network interface that you will need for installing the Debian system (via NFS or HTTP). Only the listed devices are supported.
cs: Vyberte typ primárního síťového zařízení, které budete potřebovat pro instalaci Debianu (přes NFS nebo HTTP). Podporována jsou pouze vypsaná síťová zařízení.
da: Vælg typen på det primære netkort, som du vil bruge til at installere Debian-systemet fra (via NFS eller HTTP). Kun de viste enheder understøttes.
fa: در صورتی سیستم دبیان را از روی NFS یا HTTP نصب می‌کنید لطفا نوع اصلی رابط شبکه خود را از لیست انتخاب نمایید. فقط دستگاه‌های موجود در لیست پشتیبانی می‌شود.
ga: Roghnaigh cineál an phríomhéadain líonra a úsáidfidh tú chun an córas Debian a shuiteáil (trí NFS nó HTTP). Ní thacaítear ach leis na gléasanna anseo.
gl: Escolla o tipo da interface primaria de rede, que vai necesitar para instalar o sistema Debian (por NFS ou HTTP). Só hai soporte para os dispositivos da lista.
hi: डेबियन प्रणाली के संस्थापन (NFS या HTTP द्वारा) के लिए वांछित प्राथमिक नेटवर्क उपकरण का प्रकार चुनें. केवल निम्न सूचित उपकरण ही समर्थित हैं.
is: Veldu gerð aðalnetkorts sem þú þarft að nota við uppsetningu Debian kerfisins (með NFS eða HTTP). Enungis tækin á listanum eru studd.
kn: ದಯವಿಟ್ಟು ಡೆಬಿಯನ್ ವ್ಯವಸ್ಥೆಯನ್ನು ಸ್ಥಾಪಿಸಲು ಅಗತ್ಯವಿರುವ ಪ್ರಾಥಮಿಕ ಸಂಪರ್ಕಜಾಲದ ಮಾದರಿಯನ್ನು (NFS ಅಥವಾ HTTP ಮುಖಾಂತರ) ಆಯ್ಕೆಮಾಡಿರಿ . ಕೇವಲ ಪಟ್ಟಿಯಲ್ಲಿರುವ ದಿವೈಸುಗಳನ್ನು ಬೆಂಬಲಿಸಲಾಗಿದೆ.
lo: ກະລຸນາເລືອກຊະນິດຂອງອິນເທີເຟຊເຄືອຂ່າຍຫຼັກທີ່ທ່ານຕ້ອງໃຊ້ໃນການຕິດຕັ້ງເດບຽນ (ຜ່ານ NFS ຫຼື HTTP) ໂປຼແກມຕິດຕັ້ງຮອງຮັບສະເພາະອຸປະກອນໃນລາຍການເທົ່ານັ້ນ
mr: डेबिअन प्रणाली (एनएफएस किंवा एचटीटीपी द्वारा ) अधिष्ठापित करण्यासाठी आवश्यक असणार्‍या प्राथमिक नेटवर्क अंतराफलकाचा प्रकार निवडा. फक्त यादीत असणार्‍या उपकरणांनाच पाठबळ आहे.
ro: Vă rugăm alegeți tipul interfeței de rețea principale de care veți avea nevoie pentru a instala sistemul Debian (via NFS sau HTTP). Numai dispozitivele afișate sunt suportate.
ta: டிபியனை (NFS அல்லது HTTP மூலம்) நிறுவ தேவையான முதன்மை வலையமைப்பு இடைமுகத்தை தேர்வு செய்யவும். பட்டியலிலுள்ள சாதனங்களை மட்டுமே பயன்படுத்த முடியும்.
te: డెబియన్ వ్యవస్థ(NFS లేక HTTP ద్వారా) స్థాపనకు ప్రధాన నెట్వర్క్ ముఖాంతరము ఎంచుకో. జాబితాలోని డివైసులకు మాత్రమే తోడ్పాటువుంది.
th: กรุณาเลือกชนิดของอินเทอร์เฟซเครือข่ายหลักที่คุณต้องใช้ในการติดตั้งเดเบียน (ผ่าน NFS หรือ HTTP) โปรแกรมติดตั้งรองรับเฉพาะอุปกรณ์ในรายการเท่านั้น
ug: Debian سىستېمىنى ئورنىتىش (NFS ياكى HTTP ئارقىلىق)قا ئىشلىتىدىغان ئاساسىي تور ئېغىزىنىڭ تۈرىنى تاللاڭ. پەقەت تۆۋەندە كۆرسىتىلگەن ئۈسكۈنىلەرنىلا قوللايدۇ.

source: CTC read device:
cs: CTC zařízení pro čtení:
da: CTC-læseenhed:
fa: خواندن دستگاه CTC :
ga: Gléas léimh CTC:
gl: Dispositivo de lectura CTC:
hi: सीटीसी पढ़ने का उपकरण:
is: CTC lestæki:
kn: CTC ಓದುವ ಡಿವೈಸ್:
ku: Cîhaza xwendina CTC
lo: ອຸປະກອນອ່ານ CTC:
mr: सीटीसी वाचन उपकरणः
ro: Dispozitivul CTC de citire:
ta: சிடிசி (CTC) படிக்கும் சாதனம்:
te: CTC డివైస్ (చదువుటకు):
th: อุปกรณ์อ่าน CTC:
ug: CTC ئوقۇش ئۈسكۈنىسى:

source: The following device numbers might belong to CTC or ESCON connections.
cs: Následující čísla zařízení mohou patřit k spojením CTC nebo ESCON.
da: Følgende enhedsnumre kan tilhøre CTC- eller ESCON-forbindelser.
fa: تعدادی از دستگاه‌ها ممکن است به CTC و یا ESCON‌ متصل باشند.
ga: B'fhéidir gur le ceangail CTC nó ESCON iad na huimhreacha gléis seo a leanas.
gl: Os seguintes números de dispositivo poden pertencer a conexións CTC ou ESCON.
hi: निम्नलिखित उपकरण क्रमांक सीटीसी या एस्कॉन संबंधों से संबद्ध हो सकते हैं।
is: Eftirfarandi tækjanúmer gætu tilheyrt CTC eða ESCON tengingum.
kn: ಕೆಳಕಂಡ ಡಿವೈಸ್ ಸಂಖ್ಯೆಗಳು CTC or ESCON ಕನೆಕ್ಷನ್ನಿಗೆ ಸೇರಿರಬಹುದು.
lo: ອຸປະກອນໝາຍເລກຕໍ່ໄປນີ້ ອາດໃຊ້ສຳລັບການເຊື່ອມຕໍ່ແບບ CTC ຫຼື ESCON
mr: खालील उपकरण क्रमांक सीटीसी किंवा एसकॉन जोडण्यांचे असू शकतील.
ro: Următoarele numere de dispozitive s-ar putea să aparțină unor conexiuni CTC sau ESCON.
ta: பின்வரும் சாதன எண்கள் CTC அல்லது ESCON தொடர்புகளுக்கானதாக இருக்கலாம்.
te: CTC లేక ESCON అనుసంధానాలకు ఈ క్రింది డివైస్ సంఖ్యలు చేరివుండవచ్చు.
th: อุปกรณ์หมายเลขต่อไปนี้ อาจใช้สำหรับการเชื่อมต่อแบบ CTC หรือ ESCON
ug: تۆۋەندىكى ئۈسكۈنە نومۇرى CTC ياكى ESCON باغلىنىشىغا تەۋە بولۇشى مۇمكىن.

source: CTC write device:
cs: CTC zařízení pro zápis:
da: CTC-skriveenhed:
fa: نوشتن بر روی دستگاه CTC:
ga: Gléas scríofa CTC:
gl: Dispositivo de escritura CTC:
hi: सीटीसी लेखन उपकरण:
is: CTC skriftæki:
kn: CTC ಬರೆವ ಡಿವೈಸ್:
ku: Cîhaza nivîsandina CTC
lo: ອຸປະກອນຂຽນ CTC:
mr: सीटीसी लेखन साधनः
ro: Dispozitivul CTC de citire:
ta: சிடிசி (CTC) எழுதும் சாதனம்:
te: CTC డివైస్ (వ్రాయుటకు):
th: อุปกรณ์เขียน CTC:
ug: CTC يېزىش ئۈسكۈنىسى:

source: Do you accept this configuration?
cs: Je toto nastavení správné?
da: Vil du acceptere denne opsætning?
fa: آیا این پیکربندی را قبول می‌کنید؟
ga: An nglacann tú leis an gcumraíocht seo?
gl: Acepta esta configuración?
hi: आपको यह कॉनफिगरेशन स्वीकार्य है?
is: Samþykkir þú þessar stillingar?
kn: ನೀವು ಈ ಕಾನ್ಫಿಗರೆಶನ್ನನ್ನು ಒಪ್ಪಿಕೊಳ್ಳುತ್ತೀರಾ?
ku: Van mîhengan dipejirînî?
lo: ທ່ານຍອມຮັບຄ່າຕັ້ງນີ້ ຫຼື ບໍ?
mr: ही संरचना तुम्हाला मान्य आहे का?
ro: Acceptați această configurație?
ta: இந்த வடிவமைப்பை ஒப்புக்கொள்கிறீர்களா?
te: ఈ అమరిక అంగీకారమేనా?
th: คุณยอมรับค่าตั้งนี้หรือไม่?
ug: بۇ سەپلىمىنى قوبۇل قىلامسىز؟
