Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel5/*.po
Languages: cs, da, fa, ga, gl, hi, is, kn, ku, lo, mr, ro, ta, te, th, ug

source: The configured parameters are: read channel = ${device_read} write channel = ${device_write} protocol = ${protocol}
cs: Nastavené parametry jsou: kanál pro čtení = ${device_read} kanál pro zápis = ${device_write} protokol = ${protocol}
da: De konfigurerede indstillinger er: læsekanal = ${device_read} skrivekanal = ${device_write} protokol = ${protocol}
fa: پارامترهای پیکربندی: read channel = ${device_read} write channel = ${device_write} protocol = ${protocol}
ga: Seo iad na paraiméadair chumraithe: cainéal léite = ${device_read} cainéal scríofa = ${device_write} prótacal = ${protocol}
gl: Os parámetros configurados son: canle de lectura = ${device_read} canle de escritura = ${device_write} protocolo = ${protocol}
hi: कॉन्फ़िगर्ड प्राचल हैं: रीड चैनल = ${device_read} राइट चैनल = ${device_write} प्रोटोकॉल = ${protocol}
is: Skilgreindu viðföngin eru: lesrás/read channel = ${device_read} skrifrás/write channel = ${device_write} samskiptamáti/protocol = ${protocol}
kn: ಕಾನ್ಫಿಗರ್ ಮಾಡಲ್ಪಟ್ಟ ಪ್ಯಾರಾಮೀಟರುಗಳು: ಓದುವ ಚಾನೆಲ್ = ${device_read} ಬರೆಯುವ ಚಾನೆಲ್ = ${device_write} ಪ್ರೋಟೋಕಾಲ್ = ${protocol}
lo: ຄ່າຕັ້ງໃວ້ຄື: ຊ່ອງອ່ານ = ${device_read} ຊ່ອງຂຽນ = ${device_write} ໂພໂຕຄຼໍ = ${protocol}
mr: संरचित मूल्ये पुढील प्रमाणेः वाचन चॅनल = ${device_read} लेखन चॅनल = ${device_write} प्रोटोकॉल = ${protocol}
ro: Parametrii configurați sunt: canal de citire = ${device_read} canal de scriere = ${device_write} protocol = ${protocol}
ta: வடிவமைக்கப்பட்ட அளபுருக்கள்: படிக்கும் தடம் = ${device_read} எழுதும் தடம் = ${device_write} ஒப்புநெறி = ${protocol}
te: అమర్చబడిన లక్షణాలు: ఛానల్ (చదువుటకు) = ${device_read} ఛానల్ (వ్రాయుటకు) = ${device_write} ప్రొటోకాల్ = ${protocol}
th: ค่าที่ตั้งไว้คือ: ช่องอ่าน = ${device_read} ช่องเขียน = ${device_write} โพรโทคอล = ${protocol}
ug: سەپلەيدىغان پارامېتىرلار: ئوقۇش قانىلى = ${device_read} يېزىش قانىلى = ${device_write} كېلىشىم = ${protocol}

source: No CTC or ESCON connections
cs: Nebyla rozpoznána žádná CTC nebo ESCON spojení
da: Ingen CTC- eller ESCON-forbindelser
fa: بدون اتصال‌های CTC یا ESCON
ga: Gan cheangail CTC nó ESCON
gl: Non hai conexións CTC nin ESCON
hi: कोई CTC या ESCON संबंध नहीं
is: Engar CTC eða ESCON tengingar
kn: ಯಾವುದೇ CTC ಅಥವಾ (ESCON)ಇಸ್ಕಾನ್ ಕನೆಕ್ಷನ್ ಇಲ್ಲ
ku: Girêdanên CTC an ESCON tune
lo: ບໍ່ພົບການເຊື່ອມຕໍ່ແບບ CTC ຫຼື ESCON
mr: कोणत्याही सीटीसी किंवा एस्कॉन जोडण्या नाहीत
ro: Nu există conexiuni CTC sau ESCON
ta: CTC அல்லது ESCON தொடர்புகள் ஏதுமில்லை
te: CTC లేక ESCON అనుసంధానాలు లేవు
th: ไม่พบการเชื่อมต่อแบบ CTC หรือ ESCON
ug: CTC ياكى ESCON باغلىنىشى يوق

source: Please make sure that you have set them up correctly.
cs: Ujistěte se, že je máte nastavena správně.
da: Sørg for at du har sat dem korrekt op.
fa: لطفا از گزینه‌های انتخاب شده اطمینان حاصل کنید.
ga: Bí cinnte go bhfuil siad socraithe agat mar is ceart.
gl: Verifique que as ten correctamente configuradas.
hi: कृपया सुनिश्चित करें कि आपने उन्हें ठीक प्रकार से व्यवस्थित किया है।
is: Athugaðu hvort þú hafir sett þær rétt upp.
kn: ದಯವಿಟ್ಟು ಅವುಗಳನ್ನು ಸರಿಯಾಗಿ ಸೆಟ್ ಅಪ್ ಮಾಡಿದ್ದೀರಾ ಎಂಬುದನ್ನು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.
ku: Ji kerema xwe re kontrol binêre ka te mîhengan rast çêkirine en na.
lo: ກະລຸນາກວດສອບໃຫ້ແນ່ໃຈ ວ່າທ່ານໄດ້ຕັ້ງຄ່າຢ່າງຖືກຕ້ອງ
mr: आपण त्यांना व्यवस्थित संरचित केले आहे याची खात्री करा.
ro: Vă rugăm să vă asigurați că le-ați reglat corect.
ta: சரியாக அமைத்திருக்கிறீர்களா என்பதை உறுதி செய்துகொள்ளவும்.
te: అవి సరిగా సిద్ధముచేయబడినవైనట్లు నిర్థారించుకోండి.
th: กรุณาตรวจสอบให้แน่ใจ ว่าคุณได้ตั้งค่าไว้อย่างถูกต้อง
ug: ئۇلارنى توغرا تەڭشىگەنلىكىڭىزنى جەزملەڭ.

source: Protocol for this connection:
cs: Protokol pro toto spojení:
da: Protokol for denne forbindelse:
fa: پروتکل مربوط به این اتصال:
ga: Prótacal don cheangal seo:
gl: Protocolo para esta conexión:
hi: इस संबंध के लिए प्रोटोकॉल:
is: Samskiptamáti fyrir þessa tengingu:
kn: ಈ ಸಂಪರ್ಕದ ಪ್ರೋಟೋಕಾಲ್:
ku: Protokol ji bo vê girêdanê:
lo: ໂພໂຕຄຼໍສຳລັບການເຊື່ອມຕໍ່ນີ້:
mr: या जोडणीसाठी प्रोटोकॉलः
ro: Protocolul pentru acestă conexiune:
ta: இந்த தொடர்புக்கான ஒப்புநெறி:
te: ఈ అనుసంధానానికి ప్రొటోకాల్:
th: โพรโทคอลสำหรับการเชื่อมต่อนี้:
ug: بۇ باغلىنىشنىڭ كېلىشىمى:

source: Device:
cs: Zařízení:
da: Enhed:
fa: دستگاه:
ga: Gléas:
gl: Dispositivo:
hi: उपकरण:
is: Tæki:
kn: ಡಿವೈಸ್:
ku: Amûr:
lo: ອຸປະກອນ:
mr: साधनः
ro: Dispozitiv:
ta: சாதனம்:
te: డివైస్:
th: อุปกรณ์:
ug: ئۈسكۈنە:

source: Please select the OSA-Express QDIO / HiperSockets device.
cs: Vyberte OSA-Express QDIO / HiperSockets zařízení.
da: Vælg OSA-Express QDIO / HiperSockets-enhed.
fa: لطفا دستگاه OSA-Express QDIO / HiperSockets را انتخاب نمایید.
ga: Roghnaigh an gléas OSA-Express QDIO / HiperSockets.
gl: Escolla o dispositivo OSA-Express QDIO / HiperSockets.
hi: कृपया ओएसए-एक्सप्रेस क्यूडीआईओ / हाईपरसॉकेट्स उपकरण चुनें।
is: Veldu OSA-Express QDIO / HiperSockets tækið.
kn: ದಯವಿಟ್ಟು ಯಾವುದಾದರೂ OSA ಎಕ್ಸಪ್ರೆಸ್ QDIO ಕಾರ್ಡ್/ ಹೈಪರ್ ಡಿವೈಸನ್ನು ಸೆಲೆಕ್ಟ್ ಮಾಡಿ.
lo: ກະລຸນາເລືອກອຸປະກອນ OSA-Express QDIO / HiperSockets
mr: कृपया ओएसए-एक्सप्रेस QDIO / हायपरसॉकेटस् साधन निवडा.
ro: Vă rugăm să selectați dispozitivul OSA-Express QDIO / HiperSockets.
ta: OSA-Express·QDIO·/·HiperSockets சாதனத்தை தேர்வு செய்யவும்.
te: OSA-Express QDIO / HiperSockets డివైస్ ఎంచుకో.
th: กรุณาเลือกอุปกรณ์ OSA-Express QDIO / HiperSockets
ug: OSA-Express QDIO/HiperSockets ئۈسكۈنىسىنى تاللاڭ.

source: The configured parameters are: channels = ${device0}, ${device1}, ${device2} port = ${port} portname = ${portname} layer2 = ${layer2}
cs: Nastavené parametry jsou: kanály = ${device0}, ${device1}, ${device2} port = ${port} název portu = ${portname} layer2 = ${layer2}
da: De indstillede parametre er: kanaler = ${device0}, ${device1}, ${device2} port = ${port} portnavn = ${portname} lag2 = ${layer2}
fa: پارامترهای پیکربندی: channels = ${device0}, ${device1}, ${device2} port = ${port} portname = ${portname} layer2 = ${layer2}
ga: Seo iad na paraiméadair chumraithe: cainéil = ${device0}, ${device1}, ${device2} port = ${port} ainm an phoirt = ${portname} sraith2 = ${layer2}
gl: Os parámetros configurados son: canles = ${device0}, ${device1}, ${device2} porto = ${port} nome de porto = ${portname} capa 2 = ${layer2}
hi: कॉनफ़गर किये गये प्राचल हैं: चैनल =${device0}, ${device1}, ${device2} पोर्ट = ${port} पोर्टनाम = ${portname} लेयर२ = ${layer2}
is: Skilgreindu viðföngin eru: rásir/channels = ${device0}, ${device1}, ${device2} gátt/port = ${port} gáttarheiti/portname = ${portname} layer2 = ${layer2}
kn: ಕಾನ್ಫಿಗರ್ ಮಾಡಲ್ಪಟ್ಟ ಪ್ಯಾರಾಮೀಟರುಗಳು: ಚಾನೆಲ್ = ${device0}, ${device1}, ${device2} ಪೋರ್ಟ್ = ${port} ಪೋರ್ಟ್ ಹೆಸರು = ${portname} ಲೇಯರ್೨ = ${layer2}
lo: ຄ່າທີ່ຕັ້ງໃວ້ຄື: ຊ່ອງ = ${device0}, ${device1}, ${device2} ພອດທ໌ = ${port} ຊື່ພອດທ໌ = ${portname} layer2 = ${layer2}
mr: संरचित केलेली घटकमूल्ये आहेतः चॅनेल्स = ${device0}, ${device1}, ${device2} पोर्ट = ${port} पोर्टनाव = ${portname} स्तर२ = ${layer2}
ro: Parametrii configurați sunt: canale = ${device0}, ${device1}, ${device2} port = ${port} nume de port = ${portname} stratul 2 = ${layer2}
ta: வடிவமைக்கப்பட்ட அளபுருக்கல்: தடங்கள் = ${device0}, ${device1}, ${device2} துறை = ${port} துறைபெயர் = ${portname} அடுக்கு2 = ${layer2}
te: అమర్చబడిన లక్షణాలు: ఛానెళ్లు = ${device0}, ${device1}, ${device2} పోర్టు = ${port} పోర్టుపేరు = ${portname} లేయరు2 = ${layer2}
th: ค่าที่ตั้งไว้คือ: ช่อง = ${device0}, ${device1}, ${device2} พอร์ต = ${port} ชื่อพอร์ต = ${portname} layer2 = ${layer2}
ug: سەپلەيدىغان پارامېتىر: قاناللار = ${device0}, ${device1}, ${device2} ئېغىز = ${port} ئېغىز ئىسمى = ${portname} layer2 = ${layer2}

source: No OSA-Express QDIO cards / HiperSockets
cs: Nebyly rozpoznány žádné karty OSA-Express QDIO / HiperSockets.
da: Ingen OSA-Express QDIO-kort / HiperSockets
fa: بدون OSA-Express QDIO cards / HiperSockets
ga: Gan chártaí OSA-Express QDIO / HiperSockets
gl: Non hai tarxetas OSA-Express QDIO / HiperSockets
hi: कोई ओएसए-एक्सप्रेस क्यूडीआईओ कार्ड्स / हाईपरसॉकेट्स नहीं
is: Engin OSA-Express QDIO kort / HiperSockets
kn: ಯಾವುದೇ OSA ಎಕ್ಸಪ್ರೆಸ್ QDIO ಕಾರ್ಡ್/ ಹೈಪರ್ ಸಾಕೆಟ್ ಇಲ್ಲ
ku: Kartên OSA Express QDIO / HiperSocket tune
lo: ບໍ່ພົບຄາດ OSA-Express QDIO / HiperSockets
mr: कोणतीही ओएसए-एक्सप्रेस QDIO कार्डे / हायपरसॉकेट्स नाहीत
ro: Nu există plăci OSA-Express QDIO / HiperSockets
ta: OSA-Express·QDIO·அட்டைகள்·/·HiperSockets ஏதுமில்லை
te: OSA-Express QDIO cards / HiperSockets లేవు
th: ไม่พบการ์ด OSA-Express QDIO / HiperSockets
ug: OSA-Express QDIO كارتا/HiperSockets يوق

source: No OSA-Express QDIO cards / HiperSockets were detected. If you are running VM please make sure that your card is attached to this guest.
cs: Nebyly detekovány žádné karty OSA-Express QDIO / HiperSockets. Pokud běžíte ve VM, ujistěte se, že je karta připojena ke svému hostu.
da: Fandt ingen OSA-Express QDIO-kort eller HiperSockets. Hvis du kører VM, så sørg for at dit kort er forbundet til denne gæst.
fa: هیچ OSA-Express QDIO cards / HiperSockets تشخیص داده نشد. اگر شما در حال اجرا بر روی ماشین مجازی هستید لطفا مطمئن شوید که کارت شما به این میهمان اختصاص داده شده است.
ga: Níor braitheadh aon chártaí OSA-Express QDIO / HiperSockets. Má tá tú ag rith VM, bí cinnte go bhfuil do chárta ceangailte leis an aoi seo.
gl: Non se detectaron tarxetas OSA-Express QDIO / HiperSockets. Se está a executar VM asegúrese de que a súa tarxeta estea conectada a este hóspede.
hi: कोई भी ओएसए-एक्सप्रेस क्यूडीआईओ कार्ड्स / हाईपरसॉकेट्स नहीं पाए गये. यदि आप वीएम चला रहें तो कृपया सुनिश्चित करें कि आपका कार्ड इस अतिथि से जुड़ा हुआ है.
is: Engin OSA-Express QDIO netkort / HiperSockets fundust. Ef þú ert að keyra VM, gakktu þá úr skugga um að kortið þitt sé tengt þessum gesti.
kn: ಯಾವುದೇ OSA ಎಕ್ಸಪ್ರೆಸ್ ಕಾರ್ಡ್/ ಹೈಪರ್ ಸಾಕೆಟ್ ಕಂಡು ಬಂದಿಲ್ಲ. ನೀವು VM ಬಳಸುತ್ತಿದ್ದರೆ ದಯವಿಟ್ಟು , ಈ ಅತಿಥಿಗೆ ನಿಮ್ಮ ಕಾರ್ಡ್ ಜೋಡಿಸಲ್ಪಟ್ಟಿದೆಯೇ ಎಂಬುದನ್ನು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.
lo: ກວດບໍ່ພົບກາດ OSA-Express QDIO / HiperSockets ຖ້າທ່ານກຳລັງໃຊ້ງານ VM ກະລຸນາກວດສອບໃຫ້ແນ່ໃຈວ່າກາດຂອງທ່ານເຊື່ອມຕໍ່ກັບ guest ນີ້
mr: कोणतीही ओएसए-एक्सप्रेस QDIO कार्डे / हायपरसॉकेट्स आढळली नाहीत. जर तुम्ही VM चालवत असाल तर तुमचे कार्ड या गेस्टला जोडले आहे याची खात्री करा.
ro: Nu s-a detectat nici o placă OSA-Express QDIO / HiperSockets. Dacă rulați pe VM vă rugăm să vă asigurați că aveți placa atașată la acest oaspete (guest).
ta: OSA-Express·QDIO·அட்டைகள்·/·HiperSockets ஏதும் கண்டறியப்படவில்லை. நீங்கள் VM-ல் இருந்தால் இந்த விருந்தாளியுடன் உங்கள் அட்டை இணைக்கப்பட்டிருக்கிறதா என்பதை உறுதி செய்யவும்.
te: OSA-Express QDIO cards / HiperSockets కనబడలేదు.VM నడుపుతుంటే, ఈఅతిథికి మీకార్డు జతచేయబడినదని నిర్ధారించబడింది.
th: ตรวจไม่พบการ์ด OSA-Express QDIO / HiperSockets ถ้าคุณกำลังใช้งาน VM กรุณาตรวจสอบให้แน่ใจว่าการ์ดของคุณเชื่อมต่อกับ guest นี้
ug: OSA-Express QDIO كارتا/HiperSockets بايقالمىدى. ئەگەر سىز VM ئىجرا قىلىۋاتقان بولسىڭىز، ئېغىز كارتىڭىزنىڭ بۇ خېرىدار ماشىنىغا ئۇلانغانلىقىنى جەزملەڭ.

source: Portname:
cs: Jméno portu:
da: Portnavn:
fa: نام میزبان:
ga: Ainm an phoirt:
gl: Nome de porto:
hi: पोर्टनाम:
is: Heiti gáttar:
kn: ಪೋರ್ಟಿನ ಹೆಸರು :
ku: Navê portê:
lo: ຊື່ພອດທ໌:
mr: पोर्टनामः
ro: Numele de port:
ta: முகப்புப்பெயர்:
te: పోర్టుపేరు:
th: ชื่อพอร์ต:
ug: ئېغىز ئىسمى:

source: Please enter the portname of your OSA-Express card. This name must be 1 to 8 characters long and must be equal on all systems accessing the same card.
cs: Zadejte jméno portu své OSA-Express karty. Jméno musí mít 1-8 znaků a musí být stejné na všech systémech přistupujících ke stejné kartě.
da: Angiv portnavnet for dit OSA-Express-kort. Det skal være mellem 1 og 8 tegn langt og være det samme på alle systemer, der tilgår det samme kort.
fa: لطفا نام میزبان (portname) مربوط به OSA-Express کارت خود را وارد کنید. برای دسترسی تمامی سیستم‌ها به این کارت شما باید این نام را بین ۱ تا ۸ کارکتر انتخاب نمایید.
ga: Iontráil ainm an phoirt don chárta OSA-Express. Caithfidh sé a bheith idir 1 agus 8 gcarachtar ar fad agus caithfidh tú an luach céanna a úsáid ar gach córas a úsáideann an cárta céanna.
gl: Introduza o número de porto da súa tarxeta OSA-Express. Este nome debe ter entre 1 e 8 caracteres e debe ser o mesmo en todos os sistemas que accedan á mesma tarxeta.
hi: कृपया अपने ओएसए-एक्सप्रेस कार्ड का पोर्टनाम भरें. यह नाम 1 से 8 अक्षरों का हो सकता है और इस कार्ड का अभिगमन करने वाले सभी तंत्रों पर समान होना चाहिए.
is: Settu inn heiti gáttarinnar á OSA-Express kortinu. Þetta heiti verður að vera á bilinu 1 til 8 stafa langt og verður að vera það sama á öllum kerfunum sem hafa aðgang að sama kortinu.
kn: ದಯವಿಟ್ಟು ನಿಮ್ಮ OSA ಎಕ್ಸಪ್ರೆಸ್ ಕಾರ್ಡಿನ ಪೋರ್ಟ್ ಹೆಸರನ್ನು ಎಂಟರ್ ಮಾಡಿ. ಈ ಹೆಸರು ೧ ರಿಂದ ೮ ಅಕ್ಷರಗಳನ್ನು ಒಳಗೊಂಡಿರಬೇಕು ಹಾಗೂ ಒಂದೇ ಕಾರ್ಡನ್ನು ಬಳಸುವ ಎಲ್ಲ ಸಿಸ್ಟಮ್ಮುಗಳಲ್ಲೂ ಈಹೆಸರು ಒಂದೇ ಆಗಿರಬೇಕು.
lo: ກະລຸນາປ້ອນຊື່ພອດທ໌ຂອງຄາດ OSA-Express ຂອງທ່ານ ຊື່ດັ່ງກ່າວຕ້ອງຍາວຕັ້ງແຕ່ 1 ເຖີງ 8 ຕົວອັກສອນ ແລະ ຕ້ອງຄືກັນກັບທຸກລະບົບທີ່ເຂົ້າໃຊ້ກາດດຽວກັນເທົ່ານັ້ນ
mr: कृपया तुमच्या ओएसए-एक्सप्रेस कार्डचे पोर्टनाम द्या. या नावात १ ते ८ चिन्हे असली पाहिजेत व हेच कार्ड वापरणार्‍या सर्व प्रणालींवर ते सारखेच असले पाहिजे.
ro: Vă rugăm să introduceți numele de port al plăcii dumneavoastră OSA-Express. Acest nume trebuie să fie între 1 și 8 caractere și trebuie să fie același pe toate sistemele care accesează aceiași placă.
ta: தங்களது OSA-Express அட்டைக்கான முகப்பு பெயரை உள்ளிடவும். இந்த பெயர் 1 முதல் 8 எழுத்துக்கள் கொண்டதாகவும் அதனை உபயோகிக்கும் அனைத்து அமைப்புகளிலும் அதே பெயரையும் கொண்டிருக்க வேண்டும்.
te: OSA-Express card పోర్టుపేరు ప్రవేశ పెట్టండి. పేరు పొడవు 1 నుండి 8 అక్షరాలు కలిగి, దానితో సంబంధమున్న అన్ని వ్యవస్థలలోను సమానంగా వుండాలి.
th: กรุณาป้อนชื่อพอร์ตของการ์ด OSA-Express ของคุณ ชื่อดังกล่าวต้องยาวตั้งแต่ 1 ถึง 8 ตัวอักษร และต้องเหมือนกันในทุกระบบที่เข้าใช้การ์ดเดียวกันนี้
ug: OSA-Express كارتىنىڭ ئېغىز ئىسمىنى كىرگۈزۈڭ. ئىسىم چوقۇم 1-8 گىچە ھەرپ ئۇزۇنلۇقىدا بولۇپ، بۇ كارتىنى ئىشلىتىدىغان ھەممە سىستېمىلار بىلەن بىردەكلىكنى ساقلايدۇ.

source: Leave it empty if you want to use HiperSockets. This parameter is required for cards with microcode level 2.10 or later or when you want to share a card.
cs: Pokud chcete používat HiperSockets, nezadávejte nic. Tento parametr je vyžadován pro karty s mikrokódem úrovně 2.10 nebo pozdější nebo pokud chcete kartu sdílet.
da: Lad feltet stå tomt, hvis du vil bruge HiperSockets. Denne indstilling kræves for kort med microcode-niveau 2.10 eller senere, eller når du vil dele et kort.
fa: در صورتی که مایل هستید از HiperSockets استفاده کنید این قسمت را خالی باقی بگذارید. این پارامتر برای کارهای microcode level 2.10 به بعد در صورت به اشتراک گذاری کارت اجباری می‌باشد.
ga: Fág folamh é más mian leat HiperSockets a úsáid. Tá an paraiméadar seo riachtanach do chártaí de leibhéal micreacód 2.10 nó níos déanaí, nó nuair is mian leat cárta a chomhroinnt.
gl: Déixeo en branco se quere empregar HiperSockets. Este parámetro é necesario coas tarxetas cun microcódigo de nivel 2.10 ou posterior, ou se quere compartir unha tarxeta.
hi: यदि आप हायपरसॉकेट्स कार्ड का प्रयोग करना चाहते हैं तो इसे खाली छोड़ दें. यह प्राचल तब आवश्यक है जबकि आप माइक्रोकोड लेवेल 2.10 या उसके बाद का कार्ड प्रयोग कर रहे हों या फिर आप एक कार्ड को सहकारी बनाना चाहते हैं.
is: Skildu þetta eftir autt ef þú vilt nota HiperSockets. Þetta viðfang er nauðsynlegt fyrir kort með microcode level 2.10 eða nýrri, eða ef þú vilt deila korti.
kn: ಹೈಪರ್ ಸಾಕೆಟ್ಟುಗಳನ್ನು ಬಳಸಬೇಕೆಂದರೆ ಇದನ್ನು ಖಾಲಿ ಬಿಡಿ. ೨.೧೦ ಅಥವಾ ನಂತರದ ಮೈಕ್ರೋಕೋಡ್ ಲೆವೆಲ್ಲನ್ನು ಹೊದಿರುವ ಕಾರ್ಡುಗಳಿಗೆ ಅಥವಾ ಕಾರ್ಡನ್ನು ನೀವು ಹಂಚಿಕೊಳ್ಳಬೇಕೆಂದರೆ, ಈ ಪ್ಯಾರಾಮೀಟರ್ ಅವಶ್ಯಕ.
lo: ປ່ອຍໃຫ້ວ່າງໃວ້ ຖ້າທ່ານຕ້ອງການໃຊ້ HiperSockets ຄ່ານີ້ຈຳເປັນຕ້ອງໃຊ້ສຳລັບຄາດທີ່ມີ microcode ລະດັບ 2.10 ຫຼື ຫຼັງຈາກນັ້ນ ຫຼື ຖ້າທ່ານຕ້ອງການເປີດໃຫ້ໃຊ້ກາດລວມ
mr: हायपरसॉकेटस् वापरावयाचे असल्यास हे रिक्त ठेवा. मायक्रोकोड पातळी २.१० किंवा नंतरची असलेल्या कार्डांकरिता किंवा तुम्हाला हे कार्ड सामाईकरीत्या वापरावयाचे असल्यास हे घटकमूल्य आवश्यक आहे.
ro: Lăsați câmpul gol dacă doriți să utilizați HiperSockets. Acest parametru este necesar pentru plăci cu nivelul de microcod 2.10 sau mai mult, ori dacă doriți să partajați o placă.
ta: HiperSockets-ஐ பயன்படுத்த விரும்பினால் காலியாக விடவும். இந்த அளபுரு 2.10 அல்லது அதற்கு மேற்பட்ட குறு நிரல் அளவு (microcode level) கொண்ட அட்டைகளுக்கோ அல்லது அட்டையை பகிர விரும்புபோதோதான் தேவைப்படும்.
te: HiperSockets వాడదలిస్తే ఇది ఖాళీగా వుంచండి. microcode level 2.10 లేక ఆపై కలిగిన కార్డులు లేక మీ కార్డుని పంచుకుంటున్నపుడు ఈ లక్షణం కావాలి.
th: ปล่อยให้ว่างไว้ ถ้าคุณต้องการใช้ HiperSockets ค่านี้จำเป็นต้องใช้สำหรับการ์ดที่มี microcode ระดับ 2.10 หรือหลังจากนั้น หรือถ้าคุณต้องการเปิดให้ใช้การ์ดร่วม
ug: ئەگەر HiperSockets ئىشلەتمەكچى بولسىڭىز، بوش قالدۇرۇڭ.كارتىنىڭ ئىشلىتىدىغان پارامېتىرىنىڭ مىكرو كود دەرىجىسى 2.10 ياكى كارتىدىن بىرنى ھەمبەھىرلىگەندە ئىشلىتىدۇ.

source: The name will automatically be converted to uppercase.
cs: Jméno bude automaticky převedeno na velká písmena.
da: Navnet bliver automatisk omsat til store bogstaver.
fa: تبدیل نام به حروف بزرگ.
ga: Tiontófar an t-ainm go dtí an cás uachtair go huathoibríoch.
gl: O nome hase converter a maiúsculas automaticamente.
hi: नाम स्वचालित रूप से अपरकेस में बदल जाएँगे.
is: Heitinu verður sjálfkrafa umbreytt í hástafi.
kn: ಹೆಸರು ಸ್ವಯಂ ಆಗಿ ದೊಡ್ದಕ್ಷರಕ್ಕೆ ಬದಲಾಯಿಸಲ್ಪಡುತ್ತದೆ.
ku: Nav jixweber dê guherandin bi tîpên mezin.
lo: ຊື່ນີ້ຈະຖືກແປງໃຫ້ເປັນຕົວພິມໃຫຍ່ໂດຍອັດຕະໂນມັດ
mr: हे नाव स्वत:हून मोठ्या लिपीत रुपांतरीत केले जाईल.
ro: Numele va fi convertit automat la litere mari.
ta: பெயர் தானாக மேலெழுத்துக்களுக்கு மாற்றப்படும்.
te: పేరుని స్వయంచాలకంగా పైకేసుకి (పెద్ద అక్షరాలలోకి)మార్చబడుతుంది
th: ชื่อนี้จะถูกแปลงให้เป็นตัวพิมพ์ใหญ่โดยอัตโนมัติ
ug: ئات ئۆزلۈكىدىن چوڭ يېزىلىشقا ئايلاندۇرۇلىدۇ.

source: Port:
fa: پورت:
gl: Porto:
hi: पोर्ट:
is: Gátt:
kn: ಪೋರ್ಟ್:
lo: ພອດທ໌:
mr: पोर्टः
ta: முகப்பு:
te: పోర్టు:
th: พอร์ต:
ug: ئېغىز:

source: Please enter a relative port for this connection.
cs: Zadejte prosím relativní port tohoto spojení.
da: Angiv en port for denne forbindelse.
fa: لطفا نام میزبان را برای این سیستم وارد کنید.
ga: Iontráil port coibhneasta don cheangal seo.
gl: Introduza un porto relativo para esta conexión.
hi: इस कनेक्शन हेतु कृपया सापेक्ष पोर्ट भरें.
is: Settu inn afstæða gátt fyrir þessa tengingu.
kn: ದಯವಿಟ್ಟು ಈ ಸಂಪರ್ಕಕ್ಕೆ ಒಂದು ಸಾಪೇಕ್ಷ ಪೋರ್ಟನ್ನು ಎಂಟರ್ ಮಾಡಿ.
ku: Ji kerema xwe re navê hosta vê pergalê binivîse.
lo: ກະລຸນາປ້ອນພອດສຳພັນສຳລັບການເຊື່ອມຕໍ່ນີ້
mr: कृपया या जोडणीसाठी सापेक्ष पोर्टचे नाव द्या.
ro: Vă rugăm să introduceți un port relativ pentru această conexiune.
ta: இந்த தொடர்புக்கான சார்பு முகப்பை தேர்வு உள்ளிடுக:
te: ఈ అనుసంధానమునకు సాపేక్ష పోర్టు ప్రవేశ పెట్టండి.
th: กรุณาป้อนพอร์ตสัมพัทธ์สำหรับการเชื่อมต่อนี้
ug: بۇ باغلىنىشقا مۇناسىپ ئېغىزنى تاللاڭ.

source: Use this device in layer2 mode?
cs: Použít zařízení v režimu layer2?
da: Benyt denne enhed i lag2-tilstand?
fa: استفاده از این دستگاه در لایه۲؟
ga: An bhfuil fonn ort an gléas seo a úsáid sa mhód sraith2?
gl: Desexa empregar este dispositivo en modo capa 2?
hi: इस उपकरण का उपयोग लेयर-२ मोड में करें?
is: Nota þetta tæki í layer2-ham?
kn: ಈ ಡಿವೈಸನ್ನು ಲೇಯರ್೨ ಮೋಡಿನಲ್ಲಿ ಬಳಸಬೇಕೆ?
ku: Ev cîhaz di moda layer2 de were bikaranîn?
lo: ໃຊ້ອຸປະກອນນີ້ໃນໂໝດ layer2 ຫຼື ບໍ?
mr: हे उपकरण स्तर२ मोडमधे वापरायचे?
ro: Acest dispozitiv se folosește în modul „stratul 2”?
ta: 2 ஆம் அடுக்கு பாங்கில் இந்த சாதனத்தை பயன்படுத்தவா?
te: ఈ డివైస్ ని layer2 విధంలో వాడాలా?
th: ใช้อุปกรณ์นี้ในโหมด layer2 หรือไม่?
ug: layer2 ھالەتتە بۇ ئۈسكۈنىنى ئىشلىتەمدۇ؟

source: By default OSA-Express cards use layer3 mode. In that mode LLC headers are removed from incoming IPv4 packets. Using the card in layer2 mode will make it keep the MAC addresses of IPv4 packets.
cs: Karty OSA-Express implicitně používají režim layer3, ve kterém jsou z příchozích IPv4 paketů odstraňovány LLC hlavičky. Používání karty v režimu layer2 zajistí, že budou u IPv4 paketů zachovány MAC adresy.
da: Som udgangspunkt benytter OSA-Express kort lag3-tilstand. I denne tilstand, fjernes LLC-hoveder fra indkommende IPv4-pakker. Hvis kortet benyttes i lag2-tilstand, bevares IPv4-pakkernes MAC-adresser.
fa: بصورت پیش فرض کارهای OSA-Express از مود لایه ۳ استفاده می‌کنند. در این مود هدرهای LLC از بسته های IPV4‌ حذف می‌شوند. درصورتی که مایل هستید MAC آدرس ها در بسته های IPV4 باقی بمانند از کارت در لایه۲ استفاده کنید.
ga: Úsáideann cártaí OSA-Express mód layer3 de réir réamhshocraithe. Sa mhód sin, baintear ceanntásca LLC ó phaicéid IPv4 mar a thagann siad isteach. Má úsáideann tú an cárta sa mhód layer2, coinneoidh sé seoladh MAC de gach paicéad IPv4.
gl: Por omisión, as tarxetas OSA-Express empregan o modo capa 3. Nese modo, as cabeceiras LLC elimínanse dos paquetes IPv4 entrantes. Se emprega a tarxeta en modo capa 2 hanse conservar os enderezos MAC dos paquetes IPv4.
hi: सेटिंग को बदले बिना ओ.एस.ए.-एक्सप्रेस कार्ड लेयर-३ मोड का उपयोग करते हैं. इस मोड में एल.एल.सी. हेडरआनेवाली आई.पी.वी.-४ पैकेट से निकाली जाती है. कार्ड का उपयोग लेयर-२ मोड में करने सेआनेवाली आई.पी.वी.-४ पैकेट की मैक अड्रैस कायम रखी जाती है.
is: OSA-Express kortin nota sjálfgefið layer3 ham. Í þeim ham eru LLC-headers fjarlægðir af innkomandi IPv4 pökkum. Með því að nota kortið í layer2 ham mun kortið halda MAC-vistföngum IPv4 pakkanna.
kn: ಓ.ಎಸ್.ಎ ಎಕ್ಸಪ್ರೆಸ್ ಕಾರ್ಡುಗಳು ಡೀಫಾಲ್ಟ್ ಆಗಿ ಲೇಯರ್೩ ನೋಡುಗಳನ್ನು ಬಳಸುತ್ತವೆ. ಆ ಮೋಡಿನಲ್ಲಿ , ಒಳಬರುವ IPv4 ಪ್ಯಾಕೆಟ್ಟುಗಳಿಂದ LLC ಹೆಡ್ದರುಗಳು ತೆಗೆದು ಹಾಕಲ್ಪಡುತ್ತವೆ. ಕಾರ್ಡನ್ನು ಲೇಯರ್೩ಮೋಡಿನಲ್ಲಿ ಬಳಸುವುದರಿಂದ, ಕಾರ್ಡು IPv4ಪ್ಯಾಕೆಟ್ಟಿನ ಮ್ಯಾಕ್ ವಿಳಾಸಗಳನ್ನು ಉಳಿಸಿಕೊಳ್ಳುತ್ತದೆ.
lo: ໂດຍປົກະຕິແລ້ວ ຄາດ OSA-Express ຈະໃຊ້ໂໝດ layer3 ຊຶ່ງໃນໂໝດດັ່ງກ່າວ ຂໍ້ມູນສ່ວນຫົວ LLC ຈະຖືກຕັດອອກຈາກແພັກເກັດ IPv4 ຂາເຂົ້າ ການເຂົ້າຄາດນີ້ໃນໂໝດ layer2 ຈະເຮັດໃຫ້ທີ່ຢູ່ MAC ຖືກຄົງໃວ້ໃນແພັກເກັດ IPv4
mr: मूलनिर्धारितपणे ओएसए-एक्सप्रेस कार्डे स्तर३ मोड वापरतात. या मोडमधे आत येणार्‍या IPv4 पॅकेट्स मधून एलएलसी हेडर्स काढून टाकले जातात. कार्ड स्तर२ मोडमधे वापरल्याने IPv4 पॅकेट्सचे MAC पत्ते ठेवले जातील.
ro: Implicit, plăcile OSA-Express folosesc modul „stratul 3”. În acel mod antetele LLC sunt șterse din pachetele IPv4 primite. Dacă se folosește placa în modul „stratul 2” atunci aceasta va păstra adresele MAC în pachetele IPv4 primite.
ta: முன்னிருப்பாக ஓஎஸ்ஏ அட்டைகள் அடுக்கு3 பாங்கை பயன் படுத்தும். அந்த பாங்கில் உள்வரும் ஐபிவி4 பொட்டலங்களிலிருந்து எல் எல் சி தலைப்புகள் நீக்கப் படும். அடுக்கு பாங்கு 2 இல் இந்த அட்டையை பயன் படுத்தினால் ஐபிவி4 பொட்டலங்களின் எம்ஏசி முகவரிகள் வைத்துக் கொள்ளப் படும்.
te: అప్రమేయంగా OSA-Express కార్డులు layer3 విధం వాడతాయి. ఆ విధంలో చేరుచున్న IPv4పాకెట్లలో LLC headers తొలగించబడతాయి. కార్డుని layer2 విధంగా వాడితే IPv4 పాకెట్ల MAC చిరునామాలు వుంచబడతాయి.
th: โดยปกติแล้ว การ์ด OSA-Express จะใช้โหมด layer3 ซึ่งในโหมดดังกล่าว ข้อมูลส่วนหัว LLC จะถูกตัดออกจากแพ็กเก็ต IPv4 ขาเข้า การใช้การ์ดนี้ในโหมด layer2 จะทำให้ที่อยู่ MAC ถูกคงไว้ในแพ็กเก็ต IPv4
ug: OSA-Express كارتا كۆڭۈلدىكى ئەھۋالدا layer3 ھالەتنى ئىشلىتىدۇ. بۇ ھالەتتە قوبۇل قىلغان IPv4 بوغچىسىدىكى LLC headers چىقىرىۋېتىلىدۇ. layer2 ھالەتتە بۇ ئۈسكۈنە ئىشلىتىلسە ئۇنداقتا IPv4 بوغچىسىدىكى MAC ئادرېسى ساقلاپ قېلىنىدۇ.

source: The configured parameter is: peer = ${peer}
cs: Nastavený parametr je: peer = ${peer}
da: Det opsatte parameter er: vært = ${peer}
fa: پارامترهای پیکربندی: peer = ${peer}
ga: Seo é an paraiméadar cumraithe: comhghleacaí = ${peer}
gl: O parámetro configurado é: parceiro = ${peer}
hi: कॉन्फ़िगर किया गया प्राचल है: पीयर = ${peer}
is: Skilgreinda viðfangið er: peer = ${peer}
kn: ಕಾನ್ಫಿಗರ್ ಮಾಡಲ್ಪಟ್ಟ ಪ್ಯಾರಾಮೀಟರುಗಳು:ಪೀರ್ = ${peer}
ku: Parametra veavakirî ev e: peer = ${peer}
lo: ຄ່າທີ່ຕັ້ງໃວ້ຄື: peer = ${peer}
mr: संरचित घटकमूल्य आहेः पीअर = ${peer}
ro: Parametrul configurat este: perechea = ${peer}
ta: வடிவமைக்கப்பட்ட அளபுருக்கள்: ·peer··=·${peer}
te: అమర్చబడిన లక్షణము: పీర్ = ${peer}
th: ค่าที่ตั้งไว้คือ: peer = ${peer}
ug: سەپلەيدىغان پارامېتىر: peer = ${peer}

source: VM peer:
da: VM-vært:
fa: ماشین مجازی همکار :
ga: Comhghleacaí VM:
gl: Parceiro de VM:
hi: वीएम पीअर:
is: VM jafningi (peer):
kn: ವಿ.ಎಂ ಪೀರ್ :
ku: Peer a VM:
mr: व्हीएम पीअरः
ro: Perechea VM:
ta: VM கூட்டாளி:
