Repository: dankamongmen/SprezzOS
Catalog: debian-installer/packages/po/sublevel5/*.po
Languages: cs, da, fa, ga, gl, hi, is, kn, ku, lo, mr, ro, ta, te, th, ug

source: ZFS pool %s, volume %s
cs: ZFS pool %s, svazek %s
da: ZFS-pulje %s, arkiv %s
ga: Linn ZFS %s, imleabhar %s
hi: ZFS पूल %s, वॉल्यूम %s
is: ZFS diskasafn %s, gagnahirsla %s
kn: ZFS ಪೂಲ್ %s, ವಲ್ಯೂಮ್ %s
mr: ZFS पूल %s, व्हॉल्यूम %s
ro: Pool ZFS %s, volumul %s
ta: இஸட்எஃப்எஸ் பொதுச் சேர்மம் %s, தொகுதி %s
te: ZFS పూల్ %s, వాల్యూమ్ %s
th: พูล ZFS %s, โวลุม %s
ug: ZFS كۆلچىكى %s، دسىكا %s

source: DASD %s (%s)
hi: डीएएसडी %s (%s)
mr: डीएएसडी %s (%s)
ta: டிஏஎஸ்டி (DASD) %s (%s)

source: DASD %s (%s), partition #%s
cs: DASD %s (%s), oblast č.%s
fa: DASD %s (%s), پارتیشن #%s
ga: DASD %s (%s), deighilt #%s
gl: DASD %s (%s), partición núm. %s
hi: डीएएसडी %s (%s), पार्टीशन #%s (%s)
is: DASD %s (%s), partur #%s
kn: DASD %s (%s), ವಿಭಜನೆ #%s
ku: DASD %s (%s), beş #%s
lo: DASD %s (%s), ພາທີເຊິນ #%s
mr: डीएएसडी %s (%s), विभाजन #%s
ro: DASD %s (%s), partiția nr.%s
ta: டிஏஎஸ்டி (DASD) %s (%s), பகிர்வு #%s
te: DASD %s (%s), విభజన #%s
th: DASD %s (%s), พาร์ทิชัน #%s
ug: DASD %s (%s)، #%s رايون

source: Reserved BIOS boot area
cs: rezervované místo pro BIOS zavaděče
da: Reserveret BIOS-opstartsområde
fa: ناحیه بوت BIOS رزرو شده
ga: Limistéar forchoimeádta tosaithe BIOS
gl: Área de arranque reservada para a BIOS
hi: सुरक्षित बायोस बूट क्षेत्र
is: Frátekið BIOS ræsisvæði
kn: ಕಾಯ್ದಿರಿಸಲ್ಪಟ್ಟ ಬಯೋಸ್ ಬೂಟ್ ಸ್ಥಳ
ku: Qada boot a BIOS'ê a rezervekirî
lo: ພື້ນທີ່ບູດຂອງ BIOS ທີ່ສຳຮອງ:
mr: राखीव बायोस आरंभ क्षेत्र
ro: Zonă de pornire rezervată pentru BIOS
ta: ஒதுக்கீடு செய்த பயாஸ் துவக்கி இடம்.
te: కేటాయించబడిన BIOS బూట్ ప్రదేశము
th: พื้นที่บูตของ BIOS ที่สำรอง:
ug: BIOS نى قوزغىتىش ئۈچۈن ئېلىپ قويۇلغان رايون

source: biosgrub
hi: बायोसग्रब
mr: बायोसग्रब
ta: பயாஸ்க்ரப்

source: In order to start your new system, the firmware on your Itanium system loads the boot loader from its private EFI partition on the hard disk. The boot loader then loads the operating system from that same partition. An EFI partition has a FAT16 file system formatted on it and the bootable flag set. Most installations place the EFI partition on the first primary partition of the same hard disk that holds the root file system.
cs: Abyste mohli zavést svůj nový systém, musí firmware vašeho Itania zavést zavaděč z jeho soukromé EFI oblasti na pevném disku. Zavaděč pak ze stejné oblasti zavede i operační systém. EFI oblast musí obsahovat souborový systém FAT16 a musí mít nastaven příznak zavádění. Většina instalací umísťuje EFI oblast na první primární oblast stejného disku, na kterém leží kořenový souborový systém.
da: For at starte dit nye system, vil dit Itanium-systems firmware indlæse opstartsindlæseren fra sin private EFI-partition på harddisken. Opstartsindlæseren indlæser derefter styresystemet fra den samme partition. EFI-partitionen er formateret med et FAT16-filsystem markeret som opstartbar ("bootable flag" sat). De fleste installationer lægger EFI-partitionen på den første primære partition på den harddisk, der indeholder rodfilsystemet.
fa: به منظور شروع سیستم جدید خود ،firmware خود را در سیستم Itanium بارگذاری و راه انداز خود را از پارتیشن مخصوص EFI بر روی هارد دیسک قرار دهید. راه انداز سیستم عامل موجود در همان پارتیشن راه بار گزاری می‌کند. یک پارتیشن EFI‌ با فایل سیستم FAT16 فرمت بندی شده و مجموعه پرچم های راه انداز بر روی آن تنظیم شده است. پارتیشن EFI بیشتر در اولین پارتیشن اصلی دیسک سخت قرار می‌گیرد.
ga: Chun do chóras nua a thosú, luchtaíonn an dochtearra ar do chóras Itanium an luchtóir tosaithe óna dheighilt phríobháideach EFI ar an diosca crua. Ansin, luchtaíonn an luchtóir tosaithe an córas oibriúcháin ón deighilt chéanna. Tá córas comhad FAT16 formáidithe ar dheighilt EFI, agus tá sé marcáilte 'intosaithe'. Go hiondúil, cuirtear an deighilt EFI ar an chéad phríomhdheighilt ar an diosca crua a bhfuil an fréamhchóras comhad air.
gl: Para iniciar o novo sistema, o firmware do sistema Itanium carga o cargador de arranque desde a súa partición privada EFI no disco duro. Despois, o cargador de arranque carga o sistema operativo desde a mesma partición. Unha partición EFI está formatada co sistema de ficheiros FAT16 e ten o indicador de inicio activado. A maioría das instalacións sitúan a partición EFI na primeira partición primaria do mesmo disco duro que contén a partición raíz.
hi: आपके तंत्र को प्रारंभ करने के लिए, आपके आइटेनियम तंत्र का फर्मवेयर पहले हार्डडिस्क पर इसके निजी ईएफआई पार्टिशन से बूटलोडर को लोड करता है. इसके बाद बूटलोडर उसी पार्टिशन से प्रचालन तंत्र को लोड करता है. एक ईएफआई पार्टिशन पर FAT16 से फॉर्मेट किया हुआ फाइलतंत्र होता है और इस का बूट फ्लैग सेट होता है. अधिकतर संस्थापनों में ईएफआई पार्टिशन को उसी हार्डडिस्क के प्रथम प्राथमिक पार्टिशन में रखा जाता है जिसमें कि रूट फाइलतंत्र होता है.
is: Til þess að ræsa kerfið þitt mun fastbúnaður Itanium kerfisins hlaða ræsihleðsluforrit frá sinni einka EFI sneið á harða disknum. Ræsihleðsluforritið mun síða hlaða stýrikerfinu frá sömu sneið. EFI sneið er forsniðin með FAT16 forsniði og er ræsanlegt flaggið sett. Flestar uppsetningar koma EFI sneiðinni fyrir á fyrstu aðalsneiðinni á sama harða disk og hefur að geyma rótar skráarkerfið.
kn: ನಿಮ್ಮ ಹೊಸ ವ್ಯವಸ್ಥೆಯನ್ನು ಪ್ರಾರಂಭಿಸಲು, ನಿಮ್ಮ ಇಟಾನಿಯಂ ವ್ಯವಸ್ಥೆಯ ಮೇಲಿರುವ ಫರ್ಮ್ ವೇರ್, ಹಾರ್ಡ್ ಡಿಸ್ಕಿನ ಮೇಲಿರುವ ತನ್ನ ಖಾಸಗೀ EFI ವಿಭಜನೆಯಿಂದ ಬೂಟ್ ಲೋಡರನ್ನು ಲೋಡ್ ಮಾಡಿಕೊಳ್ಳುತ್ತದೆ. ನಂತರ ಅದೇ ವಿಭಜನೆಯಿಂದ ಆಪರೇಟಿಂಗ್ ಸಿಸ್ಟಮ್ಮನ್ನು ಬೂಟ್ ಲೋಡರ್ ಲೋಡ್ ಮಾಡುತ್ತದೆ. ಒಂದು EFI ವಿಭಜನೆಯು ತನ್ನ ಮೇಲೆ ಫಾರ್ಮ್ಯಾಟ್ ಮಾಡಲ್ಪಟ್ಟ FAT16 ಕಡತ ವ್ಯವಸ್ಥೆಯನ್ನು ಹೊಂದಿದ್ದು, ಬೂಟ್ ಫ್ಲ್ಯಾಗ್ ಸೆಟ್ ಆಗಿರುತ್ತದೆ. ಬಹುತೇಕ ಇನ್ಸ್ಟಾಲೇಶನ್ ಗಳು EFI ವಿಭಜನೆಯನ್ನು, ರೂಟ್ ಕಡತ ವ್ಯವಸ್ಥೆಯನ್ನು ಹೊದಿರುವ ಹಾರ್ಡ್ ಡಿಸ್ಕಿನ, ಮೊದಲ ಪ್ರಾಥಮಿಕ ವಿಭಜನೆಯ ಮೇಲೆ ಇಡುತ್ತವೆ.
lo: ໃນການເລີ້ມບູດລະບົບທີ່ຕິດຕັ້ງໃໝ່ຂອງເຈົ້າ ເຟີມແວໃນລະບົບ Itanium ຂອງເຈົ້າຈະໂຫຼດບູດໂຫຼດເດີຈາກພາທີເຊິນສະເພາະແບບ EFI ຈາກຮາດດິດຈາກນັ້ນບູດໂຫຼດເດີຈຶ່ງຈະໂຫຼດລະບົບປະຕິບັດການຈາກພາທີເຊິນດຽວກັນຂຶ້ນມາ ພາທີເຊິນ EFI ຈະຟໍແມັດໄວ້ດ້ວຍລະບົບແຟ້ມແບບ FAT16 ໂດຍຕັ້ງແຟັກໃຫ້ບູດໄດ້ເອົາໄວ້ ການຕິດຕັ້ງສ່ວນໃຫຍ່ຈະສ້າງພາທີເຊິນ EFI ໄວ້ໃນພາທີເຊິນ primary ທຳອິດຂອງຮາດດິດດຽວກັບທີ່ເກັບລະບົບແຟ້ມພື້ນ
mr: तुमची नवीन प्रणाली सुरु करण्यासाठी, तुमच्या इटानीअम संगणकातील फर्मवेअर त्याच्या वैयक्तिक ईएफआय विभाजनावरुन आरंभ सूचक हार्डडिस्कमध्ये लोड करतो. नंतर त्याच विभाजनावरुन आरंभ सूचक प्रचालन प्रणाली लोड करतो. ईएफआय विभाजनाचे संरूपण फॅट१६ फाइल पद्धतीने केलेले असून त्यावर आरंभयोग्य झेंडा निर्धारित केलेला असतो. बहूतेक अधिष्ठापने ज्या हार्डडिस्कवर मूल फाइल प्रणाली आहे त्या हार्डडीस्कच्याच प्राथमिक विभाजनावर ईएफआय विभाजन ठेवतात.
ro: Pentru a porni noul dumneavoastră sistem, firmware-ul de pe sistemul dumneavoastră Itanium ia încărcătorul de sistem de pe partiția sa privată EFI de pe discul fix. Încărcătorul de sistem pornește apoi sistemul de operare de pe aceiași partiție. O partiție EFI este formatată cu sistemul de fișiere FAT16 și are fanionul „bootable” activat. Majoritatea instalărilor plasează partiția EFI pe prima partiție primară a aceluiași disc fix care conține sistemul de fișiere rădăcină.
ta: உங்கள் புதிய இயங்கு தளத்தை துவக்க உங்கள் இடானியம் கணினியில் உள்ள ஸ்திர மென்பொருள் வன் தட்டில் உள்ள அதன் தனி ஈஎப் ஐ பகிர்விலிருந்து துவக்கியை துவக்கும். பின்னர் துவக்கி இயங்கு தளத்தை அதன் பகிர்விலிருந்து ஏற்றும் . ஈஎப்ஐ பகிர்வில் பேட்-16 முறைப் படி ஒழுங்கு படுத்தப் பட்டு துவக்க ஏது என குறியிட்டிருக்கும். அனேக நிறுவல்கள் ஈஎப்ஐ பகிர்வை மூல (ரூட்) கோப்பு அமைப்பு உள்ள வன் வட்டின் முதன்மை பகிர்வில் நிறுவும்.
te: మీ కొత్త వ్యవస్థ ప్రారంభానికి, మీ ఇటానియమ్ వ్యవస్థ పై ఫర్మ్ వేర్, హార్డ్ డిస్క్ యొక్క ప్రైవేట్ EFI విభజన నుండి బూట్ లోడర్ ను ఎక్కించాలి. బూట్ లోడర్ అదే విభజన నుండి నిర్వహణ వ్యవస్థను ఎక్కిస్తుంది. ఒక EFI విభజన FAT16 ఫైల్ వ్యవస్థతో మరియుబూటబుల్ ప్లాగ్ చేతనమయ్యి వుండాలి. చాలా స్థాపనలలో EFI విభజన రూట్ ఫైల్ వ్యవస్థ వుండే హార్డ్ డిస్క్ లో మొదటి ప్రధాన విభజన లో వుంటుంది.
th: ในการเริ่มบูตระบบที่ติดตั้งใหม่ของคุณ เฟิร์มแวร์ในระบบ Itanium ของคุณจะโหลดบูตโหลดเดอร์จากพาร์ทิชันเฉพาะแบบ EFI จากฮาร์ดดิสก์ จากนั้น บูตโหลดเดอร์จึงจะโหลดระบบปฏิบัติการจากพาร์ทิชันเดียวกันขึ้นมา พาร์ทิชัน EFI จะฟอร์แมตไว้ด้วยระบบแฟ้มแบบ FAT16 โดยตั้งแฟล็กให้บูตได้เอาไว้ การติดตั้งส่วนใหญ่จะสร้างพาร์ทิชัน EFI ไว้ในพาร์ทิชัน primary แรกของฮาร์ดดิสก์เดียวกับที่เก็บระบบแฟ้มราก
ug: يېڭى سىستېمىنى قوزغىتىش ئۈچۈن Itanium سىستېمىڭىزدىكى مۇقىم دېتال قاتتىق دىسكىدىن شەخسىي EFI رايونىغا قوزغىتىش يېتەكلەش پروگراممىسىنى يۈكلەيدۇ. ئاندىن قوزغىتىش يېتەكلەش پروگراممىسى بىر رايوندىكى مەشغۇلات سىستېمىسىنى يۈكلەيدۇ. EFI رايون FAT16 ھۆججەت سىستېمىسىدىن بىرنى ۋە قوزغىتىش بەلگىسىنى ئۆز ئىچىگە ئالىدۇ. مۇتلەق كۆپ قىسىم ئورنىتىش پروگراممىسى EFI رايوننى غول ھۆججەت سىستېمىسى بار دىسكىدىكى بىرىنچى ئاساسلىق(primary) رايوننى بېكىتىدۇ.

source: EFI boot partition
cs: zaváděcí EFI oblast
da: EFI-opstartspatition
fa: پارتیشن بوت EFI
ga: Deighilt tosaithe EFI
gl: Partición de arranque EFI
hi: ईएफआई पार्टिशन
is: EFI ræsisneið
kn: EFI ಬೂಟ್ ವಿಭಜನೆ
ku: partîsiyona boot a EFI
lo: ພາທີເຊິນບູດ EFI
mr: ईएफआय आरंभ विभाजन
ro: Partiție de pornire EFI
ta: ஈஎப்ஐ பூட் (துவக்கி) பகிர்வு
te: EFI బూట్ విభజన
th: พาร์ทิชันบูต EFI
ug: EFI قوزغىتىش رايونى

source: No EFI partition was found.
cs: Nebyla nalezena žádná EFI oblast.
da: Fandt ingen EFI-partition.
fa: هیچ پارتیشن EFI پیدا نشد.
ga: Níor aimsíodh deighilt tosaithe EFI.
gl: Non se atopou ningunha partición EFI.
hi: कोई ईएफआई पार्टिशन नहीं मिले.
is: Engin EFI disksneið fannst.
kn: ಯಾವುದೇ EFI ಬೂಟ್ ವಿಭಜನೆ ಪತ್ತೆಯಾಗಲಿಲ್ಲ
ku: Partîsiyona EFI nehat dîtin.
lo: ບໍ່ເຫັນພາທີເຊິນ EFI
mr: कोणतेही ईएफआय विभाजन सापडले नाही.
ro: Nu s-a găsit nici o partiție EFI.
ta: ஈஎப்ஐ பகிர்வு ஏதும் காணவில்லை.
te: EFI బూట్ విభజన కనబడలేదు
th: ไม่พบพาร์ทิชัน EFI
ug: EFI رايونى تېپىلمىدى.

source: EFIboot
cs: zaváděcí
gl: InicioEFI
hi: ईएफआईबूट
lo: EFI ບູດ
mr: ईएफआयआरंभ
ta: ஈஎப்ஐ பூட்
th: EFI บูต

source: EFI-fat16
hi: ईएफआई-एफएटी16
mr: ईएफआय-फॅट१६
ta: ஈஎப்ஐ-(பேட்16) FAT16

source: No partitions were found in your system. You may need to partition your hard drives or load additional kernel modules.
cs: Ve vašem systému nebyly nalezeny žádné oblasti. Asi budete muset své disky rozdělit, nebo nahrát další moduly.
da: Fandt ingen partitioner på dit system. Du er muligvis nødt til at partitionere dine harddiske eller indlæse yderligere kernemoduler.
fa: هیچ پارتیشنی بر روی سیستم شما یافت نشد. شما نیاز به پارتیشن بندی دیسک سخت و یا بار گزاری ماژول‌های کرنل دارید.
ga: Níor aimsíodh aon deighiltí ar do chóras. B'fhéidir gur gá duit do dhioscaí crua a dheighilt, nó modúil eithne sa bhreis a luchtú.
gl: Non se atopou ningunha partición no sistema. Pode ter que particionar os discos duros ou cargar módulos adicionais do núcleo.
hi: आपके तंत्र में कोई भी पार्टिशन नहीं पाये गये. आपको या तो अपनी हार्डडिस्क को पार्टिशन करने की आवश्यकता है या फिर कुछ अतिरिक्त कर्नेल मॉड्यूल लोड करने की.
is: Engar disksneiðar fundust á kerfinu. Vera kann að þú þurfir að sneiða hörðu diskana eða hlaða inn auka kjarnaeiningum.
kn: ನಿಮ್ಮ ವ್ಯವಸ್ಥೆಯಲ್ಲಿ ಯಾವುದೇ ವಿಭಜನೆಯೂ ಪತ್ತೆಯಾಗಲಿಲ್ಲ. ನೀವು ನಿಮ್ಮ ಹಾರ್ಡ್ ಡ್ರೈವನ್ನು ವಿಭಜಿಸಬೇಕು ಅಥವಾ ಹೆಚ್ಚುವರಿ ಕರ್ನಲ್ ಮಾಡ್ಯೂಲುಗಳನ್ನು ಲೋಡ್ ಮಾಡಬೇಕು.
ku: Di pergala te de tu partîsiyon nehat dîtin. Belkî partîsiyonkirina diskên te an barkirina modulên kernel a din pêwîst e.
lo: ບໍ່ພົບພາທິຊັນໃນຮາດດິດສ໌ຂອງທ່ານ ທ່ານອາດຕ້ອງແບ່ງພາທິຊັ້ນໃນຮາດດິດສ໌ກ່ອນ ຫຼື ອາດຕ້ອງໂຫຼດໂມດູນເຄີເນວເພີ່ມເຕີມ
mr: तुमच्या प्रणालीत कोणतीही विभाजने आढळली नाहीत. तुम्हाला हार्डडीस्कवर विभाजन करण्याची किंवा अतिरिक्त गाभा मॉड्यूल लोड करण्याची गरज आहे.
ro: Nu au fost găsite partiții pe sistemul dumneavoastră. S-ar putea să trebuiască să vă partiționați discurile fixe sau să încărcați module adiționale de nucleu.
ta: உங்கள் கணினியில் பகிர்வுகள் ஏதும் காணவில்லை. நீங்கள் உங்கள் வன்வட்டுக்களை பகிர்வு செய்ய வேண்டும் அல்லது கூடுதல் உட்கூறு பகுதிகளை ஏற்ற வேண்டும்.
te: మీ వ్యవస్థలో విభజనలు కనబడలేదు. మీ హార్డ్ డ్రైవులను విభజన చేయుట లేక అదనపు కెర్నెల్ మాడ్యూలులను ఎక్కించవలసి రావచ్చు.
th: ไม่พบพาร์ทิชันในฮาร์ดดิสก์ของคุณ คุณอาจต้องแบ่งพาร์ทิชันในฮาร์ดดิสก์ก่อน หรืออาจต้องโหลดมอดลูของเคอร์เนลเพิ่มเติม
ug: سىستېمىدا رايون تېپىلمىدى. سىز دىسكىنى رايونغا ئايرىڭ ياكى قوشۇمچە يادرو بۆلىكى يۈكلەڭ.

source: No file systems found
cs: Nebyly nalezeny žádné souborové systémy
da: Fandt ingen filsystemer
fa: فایل‌های سیستمی یافت نشد.
ga: Níor aimsíodh aon chórais chomhad
gl: Non se atopou ningún sistema de ficheiros
hi: कोई फ़ाइल सिस्टम नहीं मिला
is: Ekkert skráarkerfi fannst
kn: ಯಾವುದೇ ಕಡತ ವ್ಯವಸ್ಥೆಯೂ ಪತ್ತೆಯಾಗಲಿಲ್ಲ
ku: pelen pergalê nehatin dîtin
lo: ບໍ່ພົບລະບົບແຟ້ມ
mr: कोणत्याही फाईल प्रणाली आढळल्या नाहीत.
ro: Nu s-au găsit sisteme de fișiere
ta: கோப்பு அமைப்பு ஏதும் இல்லை
te: ఫైల్ వ్యవస్థలు కనబడలేదు
th: ไม่พบระบบแฟ้ม
ug: ھۆججەت سىستېمىسى تېپىلمىدى

source: No usable file systems were found. You may need to load additional kernel modules.
cs: Nebyly nalezeny žádné použitelné souborové systémy. Asi budete muset nahrát další jaderné moduly.
da: Der blev ikke fundet nogen brugbare filsystemer. Du er muligvis nødt til at indlæse yderligere kernemoduler.
fa: هیچ فایل سیستم قابل استفاده ای یافت نشد. شما نیاز یه بارگزاری ماژول‌های کرنل دارید.
ga: Níor aimsíodh aon chórais chomhad inúsáidte. B'fhéidir gur gá duit modúil eithne sa bhreis a luchtú.
gl: Non se atopou ningún sistema de ficheiros utilizábel Pode ter que cargar módulos adicionais do núcleo.
hi: उपयोग करने योग्य कोई भी फाइलतंत्र नहीं पाये गये. आपको अतिरिक्त कर्नेल मॉड्यूल लोड करने पड़ सकते हैं.
is: Engin nothæf skrákerfi fundust. Vera kann að þú þurfir að hlaða auka kjarnaeiningum.
kn: ಯಾವುದೇ ಉಪಯುಕ್ತ ಕಡತ ವ್ಯವಸ್ಥೆಯೂ ಪತ್ತೆಯಾಗಲಿಲ್ಲ. ನೀವು ಕೆಲ ಹೆಚ್ಚುವರಿ ಕರ್ನಲ್ ಮಾಡ್ಯೂಲುಗಳನ್ನು ಲೋಡ್ ಮಾಡಬೇಕು.
ku: pelên pergalê ku bên bi kar anîn nehatin dîtin. Dibe ku barkirina modulên kernel ên din pêwîst e.
lo: ບໍ່ພົບລະບົບແຟ້ມທີ່ໃຊ້ການໄດ້ ອາດຕ້ອງໂຫຼດໂມດູນເຄີເນວເພີ່ມເຕີມ
mr: वापरण्यायोग्य कोणत्याही फाईल प्रणाली आढळल्या नाहीत. तुम्हाला अतिरिक्त गाभा मॉड्यूल्स लोड करण्याची गरज आहे.
ro: Nu s-a găsit nici un sistem de fișiere utilizabil. S-ar putea să trebuiască să încărcați module de nucleu adiționale.
ta: உபயோகிக்கக் கூடிய கோப்பு அமைப்பு ஏதும் இல்லை. நீங்கள் கூடுதல் உட்கூறு பகுதிகளை ஏற்ற வேண்டும்.
te: వాడదగిన ఫైల్ వ్యవస్థలు కనబడలేదు. మీరు అదనపు కెర్నెల్ మాడ్యూళ్లను ఎక్కించవలసి రావచ్చు.
th: ไม่พบระบบแฟ้มที่ใช้การได้ คุณอาจต้องโหลดมอดูลของเคอร์เนลเพิ่มเติม
ug: ئىشلەتكىلى بولىدىغان ھۆججەت سىستېمىسى تېپىلمىدى. سىز قوشۇمچە يادرو بۆلىكى يۈكلىشىڭىز لازىم.

source: Abort
cs: Zrušit
da: Afbryd
fa: بی نتیجه
ga: Tobscoir
gl: Abortar
hi: छोड़ें
is: Hætta við
kn: ಸ್ಥಗಿತಗೊಳಿಸು
ku: Betal
lo: ຍົກເລີກ
mr: मधेच संपवा
ro: Abandonează
ta: கைவிடுக
te: రద్దు చేయు
th: ยกเลิก
ug: توختات

source: Leave the file system intact
cs: Nechat souborový systém nedotčen
da: Efterlad filsystemet intakt
fa: فایل سیستم دست نخورده رها شد.
ga: Fág an córas comhad ina iomláine
gl: Deixar o sistema de ficheiros intacto
hi: फाइल तंत्र को अखण्डित छोड़ें
is: Skilja við skráarkerfið óspjallað
kn: ಕಡತ ವ್ಯವಸ್ಥೆಯನ್ನು ಹಾಗೆಯೇ ಬಿಡು.
ku: Pergala pelan wek berê bimîne
lo: ປ່ອຍລະບົບແຟ້ມໃວ້ຕາມເດີມ
mr: ही फाईल प्रणाली तशीच ठेवा
ro: Lasă sistemul de fișiere intact
ta: கோப்பு அமைப்பை அப்படியே விடு
te: ఫైల్ వ్యవస్థని మార్చకుండా వుంచు
th: ปล่อยระบบแฟ้มไว้ตามเดิม
ug: ھۆججەت سىستېمىسى ئۆزگەرمىسۇن

source: Create swap space
cs: Vytvořit odkládací prostor
da: Opret swapområde
fa: ایجاد فضای swap
ga: Cruthaigh spás babhtála
gl: Crear o espazo de intercambio
hi: स्वैप जगह बनाएँ
is: Búa til víxlsvæði (swap)
kn: ಸ್ವಾಪ್ ಜಾಗವನ್ನು ನಿರ್ಮಿಸು
ku: cihê swap biafirîne
lo: ສ້າງພື້ນທີ່ສະຫຼັບ
mr: अदलाबदलीसाठी जागा निर्माण करा
ro: Creează spațiu de swap
ta: இட மாற்று வெளியை உருவாக்குக
te: swap స్థలము సృష్టించు
th: สร้างพื้นที่สลับ
ug: swap بوشلۇقى قۇر

source: Action on ${PARTITION}:
cs: Akce na ${PARTITION}:
da: Handling på ${PARTITION}:
fa: عمل بر روی پارتیشن ${PARTITION}:
ga: Gníomh ar ${PARTITION}:
gl: Acción sobre ${PARTITION}:
hi: ${PARTITION} पर क्रिया:
is: Aðgerð á ${PARTITION}:
kn: ${PARTITION} ನ ಮೇಲಿನ ಕ್ರಮ:
ku: Çalakî di ${PARTITION} de:
lo: ການກະທຳໃນ ${PARTITION}:
mr: ${PARTITION}: वर क्रियाः
ro: Acțiunea asupra ${PARTITION}:
ta: ${PARTITION} மீது செயல்:
te: ${PARTITION} పై చర్య:
th: การกระทำใน ${PARTITION}:
ug: ${PARTITION} مەشغۇلاتى:

source: This partition seems to already have a file system (${FSTYPE}). You can choose to leave this file system intact, create a new file system, or create swap space.
cs: Zdá se, že na oblasti je souborový systém (${FSTYPE}). Můžete nechat oblast tak jak je, nebo vytvořit souborový systém nebo odkládací prostor.
da: Partitionen lader allerede til at indeholde et filsystem (${FSTYPE}). Du kan vælge at efterlade det intakt, oprette et filsystem eller et swapområde.
fa: به نظر می‌رسد این پارتیشن در حال حاضر دارای فایل سیستم (${FSTYPE}) می‌باشد. شما می‌توانید این فایل سیستم را دست نخورده ترک کرده و یک فایل سیستم جدید و یا فضای swap ایجاد نمایید.
ga: Dealraíonn sé go bhfuil córas comhad (${FSTYPE}) ar an deighilt seo cheana. Is féidir leat an córas comhad a fhágáil mar atá, córas comhad nua a chruthú, nó spás babhtála a chruthú.
gl: Semella que esta partición xa ten un sistema de ficheiros (${FSTYPE}). Pode deixar este sistema de ficheiros intacto, crear un novo sistema de ficheiros ou crear un espazo de intercambio.
hi: इस पार्टिशन पर पहले से ही कोई फाइलतंत्र (${FSTYPE}) प्रतीत होता है. आप इस पार्टिशन को अखण्डित छोड़ सकते हैं, इस पर नया फाइलतंत्रबना सकते हैं या फिर स्वैप क्षेत्र के लिए प्रयोग कर सकते हैं।
is: Þessi sneið virðist þegar hafa skrárkerfi (${FSTYPE}). Þú getur valið skilja við þetta skráarkerfi óspjallað, búa til nýtt skráarkerfi eða búa til víxlsvæði.
kn: ಈ ವಿಭಜನೆಯು ಈಗಾಗಲೇ ಒಂದು ಕಡತ ವ್ಯವಸ್ಥೆಯನ್ನು (${FSTYPE}) ಹೊದಿರುವಂತೆ ಕಾಣುತ್ತದೆ. ನೀವು ಈ ಕಡತ ವ್ಯವಸ್ಥೆಯನ್ನು ಹಾಗೆಯೇ ಬಿಡಬಹುದು ಅಥವಾ ಹೊಸ ಕಡತ ವ್ಯವಸ್ಥೆಯನ್ನೋ, ಸ್ವಾಪ್ ಜಾಗವನ್ನೋ ನಿರ್ಮಿಸಬಹುದು.
ku: Xuya dike di vê partîsiyonê de pergaleke pelan (${FSTYPE}) heye. Hilbijartinên te ev in: Ev pergala dosyian wek berê bimîne, pergaleke nû bê afirandin an cihekî swap bê afirandin.
lo: ພາທິຊັ້ນນີ້ເບີ່ງຄືຈະມີລະບົບແຟ້ມ (${FSTYPE}) ຢູ່ແລ້ວ ທ່ານສາມາດເລືອກທີ່ຈະປ່ອຍລະບົບແຟ້ມໃວ້ຕາມເດີມ ຫຼື ສ້າງລະບົບແຟ້ມໃໝ່ ຫຼື ສ້າງພື້ນທີ່ສະຫຼັບກໍ່ໄດ້
mr: या विभाजनावर (${FSTYPE}) या पद्धतीची फाईल प्रणाली आधीच अस्तित्वात असल्याचे दिसते. ही फाईल प्रणाली तशीच ठेवण्यासाठी यातून बाहेर पडण्याचे, नवीन फाईल प्रणाली बनवण्याचे किंवा अदलाबदलीसाठी जागा निर्माण करण्याचे तुम्ही निवडू शकता.
ro: Acestă partiție pare că are deja sistem de fișiere (${FSTYPE}). Puteți alege să-l lăsați intact, sau puteți crea un sistem de fișiere ori un spațiu de swap.
ta: இந்த பகிர்வு (${FSTYPE}) கோப்பு அமைப்பை ஏற்கெனவே கொண்டதாக இருக்கிறது. நீங்கள் இந்த கோப்பு அமைப்பை அபபடியே விட்டு விடலாம், புதிய கோப்பு அமைப்பை உருவாக்கலாம் அல்லது இட மாற்று வெளியை உருவாக்கலாம்.
te: (${FSTYPE}) విధముగల ఫైల్ వ్యవస్థ విభజనలో వున్నట్లుంది. దీనిని అలాగే వుంచుట, లేక కొత్త ఫైల్ వ్యవస్థ సృష్టించుట లేక swap స్థలము సృష్టించుట చేయవచ్చు.
th: พาร์ทิชันนี้ดูเหมือนจะมีระบบแฟ้ม (${FSTYPE}) อยู่แล้ว คุณสามารถเลือกที่จะปล่อยระบบแฟ้มไว้ตามเดิม หรือสร้างระบบแฟ้มใหม่ หรือสร้างพื้นที่สลับก็ได้
ug: بۇ رايون ھۆججەت سىستېمىسى(${FSTYPE})نى ئۆز ئىچىگە ئالغان. سىز ئۆزگەرتمەي ساقلاپ قېلىشنى تاللىسىڭىز ياكى ھۆججەت سىستېمىسى قۇرسىڭىز ۋە ياكى swap بوشلۇقى قۇرسىڭىز بولىدۇ.

source: This partition does not seem to have a file system. You can create a file system or swap space on it.
cs: Zdá se, že na oblasti není souborový systém. Můžete na ní vytvořit souborový systém nebo odkládací prostor.
da: Denne partition lader ikke til at have et filsystem. Du kan oprette et filsystem eller et swapområde på den.
fa: این پارتیشن به نظر نمی‌رسد یک فایل سیستم داشته باشید. شما می‌توانید یک فایل سیستم و یا فضای swap را بر روی آن ایجاد کنید.
ga: Dealraíonn sé nach bhfuil córas comhad ar an deighilt seo. Is féidir leat córas comhad nó spás babhtála a chruthú air.
gl: Semella que esta partición non ten un sistema de ficheiros. Pode crear un sistema de ficheiros ou espazo de intercambio nela.
hi: इस पार्टिशन पर कोई भी फाइलतंत्र प्रतीत नहीं हो रहा है. आप इस पर एक नया फाइल तंत्र या स्वैप क्षेत्र बना सकते हैं .
is: Þessi sneið virðist ekki vera með skráarkerfi. Þú getur búið til skráarkerfi eða víxlsvæði á henni.
kn: ಈ ವಿಭಜನೆಯು ಕಡತ ವ್ಯವಸ್ಥೆಯನ್ನು ಹೊಂದಿರುವಂತೆ ಕಾಣುವುದಿಲ್ಲ. ನೀವು ಇದರಲ್ಲಿ ಒಂದು ಕಡತ ವ್ಯವಸ್ಥೆಯನ್ನು ಅಥವಾ ಸ್ವಾಪ್ ಜಾಗವನ್ನು ನಿರ್ಮಿಸಬಹುದು
ku: Xuya dike di vê partîsiyonê de pergaleke pelan ·Tune. Tû dikarî pergaleke pelan an cihekî swap biafirîne.
lo: ພາທິຊັ້ນນີ້ເບີ່ງຄືຈະບໍ່ມີລະບົບແຟ້ມຢູ່ ທ່ານສາມາດໃຊ້ສ້າງລະບົບແຟ້ມ ຫຼື ພື້ນທີ່ສະຫຼັບກໍ່ໄດ້
mr: या विभाजनावर फाईल प्रणाली अस्तित्वात नाही असे दिसते. तुम्ही यावर फाईल प्रणाली किंवा अदलाबदलीची जागा निर्माण करू शकता.
ro: Acestă partiție pare ca nu are sistem de fișiere. Puteți crea un sistem de fișiere sau un spațiu de swap pe ea.
ta: இந்த பகிர்வு கோப்பு அமைப்பு எதையும் கொண்டதாக தெரியவில்லை. நீங்கள் அதில் கோப்பு அமைப்பை உருவாக்கலாம் அல்லது இட மாற்று வெளியை உருவாக்கலாம்.
te: విభజనలో ఫైల్ వ్యవస్థ లేదనిపిస్తుంది. కొత్త ఫైల్ వ్యవస్థ సృష్టించుట లేక swap స్థలము సృష్టించుట చేయవచ్చు.
th: พาร์ทิชันนี้ดูเหมือนจะไม่มีระบบแฟ้มอยู่ คุณสามารถใช้สร้างระบบแฟ้มหรือพื้นที่สลับก็ได้
ug: رايوندا ھۆججەت سىستېمىسى يوق. ئۇنىڭدا ھۆججەت سىستېمىسى ياكى swap بوشلۇقى قۇرسىڭىز بولىدۇ.

source: Don't mount it
cs: Nepřipojovat
da: Montér det ikke
fa: بارگذاری نکن
ga: Ná feistigh é
gl: Non montala
hi: इसे माउन्ट नहीं करें
is: Ekki tengja við skráarkerfi
kn: ಅದನ್ನು ಮೌಂಟ್ ಮಾಡಬೇಡಿ.
ku: Mount neke
lo: ບໍ່ຕ້ອງເມົ້າທ໌
mr: हे आरोहित करू नका
ro: N-o monta
ta: அதை ஏற்றாதீர்
te: దానిని అనుసంధానము చెయ్యవద్దు
th: ไม่ต้องเมานท์
ug: ئېگەرلىمە

source: Mount point for ${PARTITION}:
cs: Přípojný bod pro ${PARTITION}:
da: Monteringspunkt for ${PARTITION}:
fa: محل بارگزاری پارتیشن ${PARTITION}:
ga: Pointe feistithe le haghaidh ${PARTITION}:
gl: Punto de montaxe de ${PARTITION}:
hi: ${PARTITION} के लिए माउंट प्वाइंट:
is: Tengipunktur fyrir ${PARTITION}:
kn: ${PARTITION} ಗಾಗಿ ಮೌಂಟ್ ಪಾಯಿಂಟ್:
ku: Nuqteya mount ji bo ${PARTITION}:
lo: ຕຳແໜ່ງເມົ້າທ໌ສຳລັບ ${PARTITION}:
mr: ${PARTITION}: साठी आरोहण बिंदूः
ro: Punct de montare pentru ${PARTITION}:
ta: ${PARTITION}க்கு ஏற்று புள்ளி:
te: ${PARTITION} కొరకు అనుసంధాన కేంద్రము:
th: ตำแหน่งเมานท์สำหรับ ${PARTITION}:
ug: ${PARTITION} نى ئېگەرلەش نۇقتىسى نۇقتىسى
